[
    {
        "page": 1,
        "category": "Page-header",
        "bbox": [
            90.02,
            72.08,
            541.33,
            735.99
        ],
        "text": "Ontario’s Libraries  Working Together  RFP: R RFP: R RFP: R RFP: Request f quest f quest f quest for Pr r Pr r Pr r Proposal oposal  oposal oposal To Present a Proposal for Developing  the Business Plan for the Ontario  Digital Library  March 21, 2003   The Ontario Digital Library will make Ontario a better place to study, work and live by ensuring that  all Ontario citizens have access to the knowledge and learning supports needed to be life-long  learners and effective contributors towards Ontario’s prosperity."
    },
    {
        "page": 2,
        "category": "Section-header",
        "bbox": [
            90.04,
            88.6,
            320.05,
            116.83
        ],
        "text": "Ontario’s Digital Library"
    },
    {
        "page": 2,
        "category": "Section-header",
        "bbox": [
            90.04,
            120.32,
            484.94,
            138.13
        ],
        "text": "A Critical Component for Implementing Ontario’s Road Map to"
    },
    {
        "page": 2,
        "category": "Section-header",
        "bbox": [
            90.04,
            138.67,
            214.5,
            156.48
        ],
        "text": "Prosperity Strategy"
    },
    {
        "page": 2,
        "category": "Section-header",
        "bbox": [
            96.04,
            195.72,
            193.55,
            240.89
        ],
        "text": "Summary  The purpose of this"
    },
    {
        "page": 2,
        "category": "List-item",
        "bbox": [
            96.04,
            228.57,
            525.28,
            492.61
        ],
        "text": "Request for Proposal  ( RFP The ODL will deliver high-quality library electronic content to all Ontario residents in order to  assist people as they learn, work, and enhance their quality of life. The business plan to be  developed is to document and clearly communicate:  how the ODL will be implemented, including the timeline  the financial plan for the implementation  the financial plan for the first 2 operating years, including capital and operating costs,  revenues, etc.  a financial forecast for the succeeding 2 operating years  the services and products to be delivered by the ODL  how the ODL will operate and be managed following the implementation  who will be involved, and what their role/responsibility will be, for both the  implementation and operational stages  the marketing and communications plan for the ODL  This business plan must be completed and approved by the ODL Steering Committee no  later than September 30, 2003  Timeline:"
    },
    {
        "page": 2,
        "category": "Text",
        "bbox": [
            96.04,
            228.57,
            525.3,
            253.49
        ],
        "text": ") is to invite firms and/or consultants to  present a proposal for developing the business plan for the"
    },
    {
        "page": 2,
        "category": "Section-header",
        "bbox": [
            375.4,
            241.17,
            525.04,
            253.49
        ],
        "text": "Ontario Digital Library (ODL)."
    },
    {
        "page": 2,
        "category": "Text",
        "bbox": [
            96.04,
            504.89,
            525.23,
            579.89
        ],
        "text": "Those firms/consultants intended to submit a proposal to this RFP must indicate their  intention to do so in an e-mail to Michael Ridley ( mridley@uoguelph.ca ) by  April 11 th .  Proposals may be e-mailed, mailed, couriered or faxed to: Larry Moore  ( lmoore@accessola.com ), Executive Director, The Ontario Library Association,  100 Lombard  St., Suite 303, Toronto, ON  M5C 1M3.  Proposals must be received by  Noon on Monday,"
    },
    {
        "page": 2,
        "category": "Section-header",
        "bbox": [
            96.04,
            580.17,
            169.34,
            592.49
        ],
        "text": "April 21, 2003."
    },
    {
        "page": 2,
        "category": "Text",
        "bbox": [
            96.04,
            604.88,
            525.26,
            679.71
        ],
        "text": "Those proposals that are short-listed will be invited to discuss their proposal during the week  of  April 28, 2003 . No presentation will be expected. Firms or consultants invited to an  interview will be expected to discuss the project and their approach with the selection  committee .  Contracts with the firm/consultant will be signed the week of"
    },
    {
        "page": 2,
        "category": "Text",
        "bbox": [
            90.04,
            667.39,
            525.31,
            742.48
        ],
        "text": "May 5, 2003  with the work to  commence as soon as possible thereafter.  RFP: To Develop the Ontario Digital Library Business Plan"
    },
    {
        "page": 2,
        "category": "Text",
        "bbox": [
            296.71,
            730.98,
            524.65,
            743.66
        ],
        "text": "March 2003  2"
    },
    {
        "page": 3,
        "category": "Text",
        "bbox": [
            96.04,
            72.21,
            525.3,
            97.13
        ],
        "text": "Please note that we reserve the right not to select any of the submitted proposals and may  seek further response to these Terms of Reference."
    },
    {
        "page": 3,
        "category": "Text",
        "bbox": [
            96.02,
            109.52,
            525.14,
            223.07
        ],
        "text": "If you require further information or have any questions, please contact Michael Ridley by e- . All questions and  responses will be shared with those who have indicated that they will be submitting a  proposal. Please note, that firms/consultants who have not indicated in an e-mail to Michael  Ridley by April 11 th  that they will be submitting a proposal will not receive any further  information or question responses.  Background"
    },
    {
        "page": 3,
        "category": "Section-header",
        "bbox": [
            96.04,
            122.12,
            123.59,
            134.44
        ],
        "text": "mail ("
    },
    {
        "page": 3,
        "category": "Section-header",
        "bbox": [
            123.4,
            122.12,
            273.8,
            134.44
        ],
        "text": "mridley@uoguelph.ca )  only  by"
    },
    {
        "page": 3,
        "category": "Section-header",
        "bbox": [
            275.31,
            122.12,
            431.58,
            134.44
        ],
        "text": "3:00 p.m. on Friday April 18th"
    },
    {
        "page": 3,
        "category": "Text",
        "bbox": [
            90.04,
            239.13,
            525.33,
            743.66
        ],
        "text": "First, some background on the ODL. For the last two years the Ontario Library Association  has acted as a catalyst, bringing together the stakeholders needed to create the Ontario  Digital Library (ODL). These stakeholders include Ontario’s 5000+ public libraries, university,  college, and school libraries, as well as Ontario government ministries.  Libraries that serve very different clientele recognize that by working together they can create  seamless access to quality electronic library services. Through the ODL, students will be  able to explore a topic at school, use the same child-safe resources after school (either at  home or at a public library), enter college or university with a knowledge of how to use  electronic resources that are still available and then, after graduation, continue to use these  skills and resources at work or at home.  We are moving into a period of convergence. With convergence we no longer have to license  commercial products as individual libraries or institutions. We can work together to spend our  money wisely. The provincial government has made this possible by working hard to provide  all Ontarians with a stable, high-speed communications infrastructure. While there is still a  great deal of work needed to improve this infrastructure, libraries are beginning to plan how  best to exploit communications technology. We can reduce barriers to access and create the  content infrastructure needed to support a knowledge society.  The concept of an ODL is a key element in  The Roadmap to Prosperity , a strategic plan to  envision and attain Ontario’s economic goal prepared by the Ontario Jobs and Investment  Board. The OJIB strategic plan recommends an electronic library to “connect students to new  workplaces, new sources of information and applied learning opportunities”. The ODL will do  that and much more. The ODL will connect students to electronic information, and will also  leverage this investment to help connect all citizens to the electronic information they need as  they make decisions, solve problems and enhance their quality of life.  Libraries have long been a key delivery point for public services. The ODL will allow that  delivery point to move closer to citizens, into the smallest of libraries and even into living  rooms.  Libraries have a long tradition of using a practical, consultative approach to solving problems,  and of learning from others. The ODL is a very practical solution to various problems.  Jurisdiction-wide digital libraries are very practical and very real. The ODL we propose is  leading edge for Ontario but several jurisdictions have forged the path with collaborative  digital libraries. We can learn from their experiences. For example, The Alberta Library (TAL)  RFP: To Develop the Ontario Digital Library Business Plan  March 2003  3"
    },
    {
        "page": 4,
        "category": "Text",
        "bbox": [
            90.03,
            72.12,
            521.26,
            223.49
        ],
        "text": "was incorporated in 1997 as a province-wide library consortium. TAL works collaboratively  with its members to promote universal access to materials and resources in more than 250  public, post-secondary, special, government and regional libraries. Unlike ODL, TAL does  not include elementary or secondary schools. However, the timeline and funding we are  proposing for ODL is comparable to TAL‘s experience. TAL’s business planning took several  years. TAL’s implementation plan was supported by 8 million dollars in provincially shared  funding, spread over three years, later revised to 15 million dollars over 4 years. Not only is  Alberta’s population 30% of Ontario’s, TAL does not include elementary or secondary  schools as partners; it has 250 member libraries. ODL envisions universal access for all  10,000,000 Ontarians, with more than 5000 Ontario libraries as partners. Although ODL can  learn from TAL’s practices, the scope of planning and implementing ODL is much larger than  TAL."
    },
    {
        "page": 4,
        "category": "Text",
        "bbox": [
            90.03,
            236.49,
            525.22,
            361.36
        ],
        "text": "The ODL will be a partnership-based organization providing seamless electronic information  services and resources to the citizens of Ontario. It will use local libraries as the entry point for  common resources The ODL will recognize the unique responsibilities and needs of public  libraries, school libraries, college and university libraries and special libraries. The ODL  envisions a digital network of information resources, allowing members to collaborate when  there is mutual benefit and to support the common mandates of local libraries.  The principles which will define and guide the ODL are:  Equitable access for all Ontarians:"
    },
    {
        "page": 4,
        "category": "Text",
        "bbox": [
            90.03,
            373.76,
            525.1,
            460.58
        ],
        "text": "We will bring consistent, high-quality electronic resources and services to 10 million  Ontario citizens  We will eliminate barriers to the access to information and create more consistent  services for library clients.  Shared decision-making and accountability:"
    },
    {
        "page": 4,
        "category": "Text",
        "bbox": [
            90.03,
            472.98,
            525.21,
            559.81
        ],
        "text": "We will facilitate consensus among members regarding ODL’s portfolio of electronic  licenses and services  We will balance the interests and realities of small and large as well as rich and poor  communities and institutions.  Shared governance structure:"
    },
    {
        "page": 4,
        "category": "Text",
        "bbox": [
            108.03,
            572.21,
            435.11,
            609.13
        ],
        "text": "We will share decision-making in order to enable the people we serve.  We will work based on an underlying assumption of trust and synergy."
    },
    {
        "page": 4,
        "category": "Section-header",
        "bbox": [
            90.03,
            621.4,
            173.77,
            633.73
        ],
        "text": "Shared funding:"
    },
    {
        "page": 4,
        "category": "Text",
        "bbox": [
            90.04,
            646.12,
            525.26,
            742.48
        ],
        "text": "We will leverage provincial, institutional, and local dollars to realize economies of scale  and put Ontario dollars to work for everyone .  We will be willing to pool talents and dollars in order to provide common services that are  truly greater than those that can be maintained by individual institutions.  RFP: To Develop the Ontario Digital Library Business Plan"
    },
    {
        "page": 4,
        "category": "Text",
        "bbox": [
            296.71,
            730.98,
            524.65,
            743.66
        ],
        "text": "March 2003  4"
    },
    {
        "page": 5,
        "category": "Section-header",
        "bbox": [
            90.0,
            72.11,
            199.46,
            84.43
        ],
        "text": "Local points of entry:"
    },
    {
        "page": 5,
        "category": "Text",
        "bbox": [
            114.0,
            97.44,
            501.65,
            122.35
        ],
        "text": "We will provide the licenses, infrastructure, services and support that enable local  libraries to provide exceptional services to their clientele. ODL will focus on support,"
    },
    {
        "page": 5,
        "category": "Text",
        "bbox": [
            114.0,
            122.75,
            336.69,
            135.07
        ],
        "text": "providing the underpinning, not overshadowing."
    },
    {
        "page": 5,
        "category": "Text",
        "bbox": [
            90.0,
            147.95,
            289.3,
            160.27
        ],
        "text": "Services envisioned for the ODL’s include:"
    },
    {
        "page": 5,
        "category": "Section-header",
        "bbox": [
            90.0,
            173.28,
            135.24,
            185.6
        ],
        "text": "Access:"
    },
    {
        "page": 5,
        "category": "Text",
        "bbox": [
            107.99,
            186.0,
            434.4,
            236.23
        ],
        "text": "to the “deep” web (i.e. Commercial, purchased electronic services)  to credible web sites and electronic resources  to digital government information  to local digital collections"
    },
    {
        "page": 5,
        "category": "Section-header",
        "bbox": [
            90.0,
            249.24,
            211.98,
            274.15
        ],
        "text": "Guidance and Advice:  to support e-learning"
    },
    {
        "page": 5,
        "category": "Text",
        "bbox": [
            107.99,
            274.55,
            451.68,
            299.47
        ],
        "text": "to support citizens, in real-time, as they try to use electronic resources  to assist citizens as they use web-links"
    },
    {
        "page": 5,
        "category": "Section-header",
        "bbox": [
            90.0,
            299.74,
            140.16,
            312.06
        ],
        "text": "Training:"
    },
    {
        "page": 5,
        "category": "List-item",
        "bbox": [
            107.99,
            312.46,
            213.9,
            337.38
        ],
        "text": "for library workers  for the general public"
    },
    {
        "page": 5,
        "category": "Section-header",
        "bbox": [
            90.0,
            350.38,
            277.63,
            362.7
        ],
        "text": "Provincial Purchasing & Licensing:"
    },
    {
        "page": 5,
        "category": "List-item",
        "bbox": [
            107.99,
            362.98,
            425.2,
            375.3
        ],
        "text": "of electronic content on a consortia basis for all member libraries"
    },
    {
        "page": 5,
        "category": "Section-header",
        "bbox": [
            90.0,
            388.31,
            215.88,
            400.63
        ],
        "text": "Technological Support:"
    },
    {
        "page": 5,
        "category": "List-item",
        "bbox": [
            90.0,
            401.02,
            520.1,
            506.09
        ],
        "text": "of common standards for the preservation and archiving local digital content  of a common interface to ODL resources and services that can be imbedded in local  library web sites  What could the ODL really mean?  For each Ontario citizen it could mean:"
    },
    {
        "page": 5,
        "category": "Text",
        "bbox": [
            162.0,
            506.61,
            521.65,
            594.75
        ],
        "text": "One local point of entry to access seamless electronic library services and  resources for their personal, educational and professional needs;  Access to credible, high-quality, user-friendly electronic services through their  community, school, or academic library;  Confidence that the electronic services and sources they – and their children  – are using are safe, valid, and bringing them both global and local  perspectives;"
    },
    {
        "page": 5,
        "category": "Text",
        "bbox": [
            90.0,
            595.15,
            525.08,
            644.54
        ],
        "text": "Electronic information and tools that enhance job skills and the learning  experience  For each Ontario student it could mean:"
    },
    {
        "page": 5,
        "category": "Text",
        "bbox": [
            162.0,
            645.06,
            507.19,
            695.3
        ],
        "text": "One local point of entry to quality, curriculum- based electronic information  resources and services  Connection to their individual educational environment, whether at the  elementary, secondary or post-secondary levels"
    },
    {
        "page": 5,
        "category": "Text",
        "bbox": [
            90.04,
            734.04,
            284.27,
            742.48
        ],
        "text": "RFP: To Develop the Ontario Digital Library Business Plan"
    },
    {
        "page": 5,
        "category": "List-item",
        "bbox": [
            296.71,
            734.04,
            340.93,
            742.48
        ],
        "text": "March 2003"
    },
    {
        "page": 5,
        "category": "Text",
        "bbox": [
            516.64,
            730.98,
            524.65,
            743.66
        ],
        "text": "5"
    },
    {
        "page": 6,
        "category": "Text",
        "bbox": [
            162.04,
            72.21,
            506.42,
            97.13
        ],
        "text": "Confidence that the services and resources people are using are credible,  available when they need them and adaptable to different learning styles"
    },
    {
        "page": 6,
        "category": "Section-header",
        "bbox": [
            90.04,
            110.01,
            285.73,
            122.33
        ],
        "text": "For each Ontario library it could mean:"
    },
    {
        "page": 6,
        "category": "Text",
        "bbox": [
            162.04,
            122.85,
            524.22,
            210.99
        ],
        "text": "One point of entry for themselves and their clientele to quality electronic  resources and services that support and enhance their collections, programs  The opportunity to show case their local community, collections, services, and  The opportunity to gain from the provincial, collaborative partnership in order  to provide a seamless gateway to digital resources and services"
    },
    {
        "page": 6,
        "category": "Text",
        "bbox": [
            162.04,
            148.04,
            223.91,
            160.36
        ],
        "text": "and services"
    },
    {
        "page": 6,
        "category": "Text",
        "bbox": [
            162.04,
            173.36,
            207.58,
            185.68
        ],
        "text": "expertise"
    },
    {
        "page": 6,
        "category": "Section-header",
        "bbox": [
            90.04,
            223.88,
            305.87,
            236.2
        ],
        "text": "For the Ontario government it could mean:"
    },
    {
        "page": 6,
        "category": "Section-header",
        "bbox": [
            162.04,
            236.59,
            169.4,
            248.92
        ],
        "text": "A"
    },
    {
        "page": 6,
        "category": "Text",
        "bbox": [
            90.04,
            236.59,
            525.39,
            742.48
        ],
        "text": "point of entry to information services and resources for all Ontario citizens,  connecting to portal initiatives .  Support of the Ontario E-Learning strategy through a collaborative digital  library initiative that positions Ontario on the global e-learning scene  Improved access and flexibility for all students at all ages and stages  (supports Ontario’s lifelong learning strategy)  The opportunity to address emerging job skills shortages and facilitate school  to work and job to job transitions with the necessary information and  knowledge supports and tools  ODL will be an incorporated non-profit organization governed by a Board of Directors elected  by a voting membership. The Board will include representatives from all stakeholders. We  envision a governance model similar to that prepared for the province’s ORION network.  More information regarding the envisioned phasing, funding and resources required for the  ODL can be found in the appendixes.  The Business Plan to be Developed  The business plan which needs to be developed for the ODL must be a formal business plan  that documents and clearly communicates the ODL’s services, funding and governance  structures, as well as implementation plans for 2004-2005, and operational plans for 2005- 2007. The planning process must also secure the full commitment of all stakeholders, as  represented on the Steering Committee.  Specifically, the business plan must include:  how the ODL will be implemented, including the timeline  the financial plan for the implementation  the financial plan for the first 2 operating years, including capital and operating costs,  revenues, etc.  a financial forecast for the succeeding 2 operating years  the services and products to be delivered by the ODL  how the ODL will operate and be managed following the implementation  who will be involved, and what their role/responsibility will be, for both the  implementation and operational stages  RFP: To Develop the Ontario Digital Library Business Plan"
    },
    {
        "page": 6,
        "category": "Text",
        "bbox": [
            296.71,
            730.98,
            524.65,
            743.66
        ],
        "text": "March 2003  6"
    },
    {
        "page": 7,
        "category": "Text",
        "bbox": [
            90.04,
            72.21,
            514.47,
            135.17
        ],
        "text": "the marketing and communications plan for the ODL  the commitment of all stakeholders to their responsibilities  The process of developing this business plan must be extremely consultative to ensure that  all stakeholders are engaged in creating a synergistic ODL organization."
    },
    {
        "page": 7,
        "category": "Table",
        "bbox": [
            425.93,
            122.85,
            515.75,
            135.17
        ],
        "text": "The proposal must"
    },
    {
        "page": 7,
        "category": "Text",
        "bbox": [
            90.04,
            135.45,
            360.55,
            147.77
        ],
        "text": "indicate how this consultative process will be approached."
    },
    {
        "page": 7,
        "category": "Text",
        "bbox": [
            90.04,
            160.77,
            518.16,
            236.32
        ],
        "text": "The business plan for the ODL must address significant issues. There are, for example,  enormous differences in the financial resources available to libraries mandated to provide  similar services. Some post-secondary and public libraries, particularly those in large urban  areas, have the facilities, funding and technological infrastructure necessary to service their  patrons with electronic services and resources.  Many others, particularly in rural regions, do  not."
    },
    {
        "page": 7,
        "category": "Text",
        "bbox": [
            113.09,
            224.0,
            417.62,
            236.32
        ],
        "text": "The proposal must indicate how these issues will be approached."
    },
    {
        "page": 7,
        "category": "Section-header",
        "bbox": [
            96.04,
            270.12,
            166.5,
            287.03
        ],
        "text": "Milestones"
    },
    {
        "page": 7,
        "category": "List-item",
        "bbox": [
            108.04,
            302.97,
            525.26,
            352.6
        ],
        "text": "1) A preliminary report will be issued during June 2003.  2) It is expected that an Interim Report, suitable for distribution to the broader library  community will be available by August 1, 2003 and that there will be an opportunity"
    },
    {
        "page": 7,
        "category": "Text",
        "bbox": [
            126.04,
            352.88,
            269.5,
            365.2
        ],
        "text": "for responses to be evaluated."
    },
    {
        "page": 7,
        "category": "List-item",
        "bbox": [
            108.04,
            377.6,
            525.29,
            389.92
        ],
        "text": "3) The business plan must be completed and approved by the ODL Steering Committee"
    },
    {
        "page": 7,
        "category": "Text",
        "bbox": [
            99.52,
            390.2,
            387.17,
            440.51
        ],
        "text": "no later than September 30, 2003.  Approach and Specific Proposal Requirements"
    },
    {
        "page": 7,
        "category": "Text",
        "bbox": [
            90.04,
            456.57,
            183.03,
            468.89
        ],
        "text": "The firm/consultant"
    },
    {
        "page": 7,
        "category": "Text",
        "bbox": [
            90.04,
            456.57,
            525.18,
            682.57
        ],
        "text": "(or proposed team of consultants)  will be expected to work closely with  the ODL Steering Committee. Terms of reference for the Committee are in the appendix.  Given the consultative nature of this business planning process, the firm/consultant will also  be expected to travel and communicate regularly with various stakeholders as well as with  electronic resource publishers/vendors.  The proposal should include the following information:  a) name of the firm/consultant  b) names of those individuals who will be engaged in this project, their specific  responsibilities on this project and relevant experience/qualifications  c) description of similar engagements that highlight the firm’s experience in business  planning and building stakeholder commitment  d) references with details of work completed for these references  e) description of the approach that will be used for completing the business plan,  including a timeline  f) cost to complete the study including estimated expenses (i.e.: travel, etc.) and payment  structure"
    },
    {
        "page": 7,
        "category": "Text",
        "bbox": [
            90.04,
            734.04,
            284.27,
            742.48
        ],
        "text": "RFP: To Develop the Ontario Digital Library Business Plan"
    },
    {
        "page": 7,
        "category": "Text",
        "bbox": [
            296.71,
            730.98,
            524.65,
            743.66
        ],
        "text": "March 2003  7"
    },
    {
        "page": 8,
        "category": "Text",
        "bbox": [
            96.04,
            81.0,
            324.98,
            97.91
        ],
        "text": "Evaluation and Awarding of Contract"
    },
    {
        "page": 8,
        "category": "Text",
        "bbox": [
            90.04,
            122.85,
            523.86,
            311.67
        ],
        "text": "The contract will be awarded to the bidder whose submission offers the best value; the contract will  not necessarily be awarded to the lowest bidder. We reserve the right not to award the contract to  any of the bidders responding to this RFP and we may seek further response.  Specifically, proposals will be evaluated proposals according to the following criteria:  Quality of the proposal /approach outlined for undertaking the business planning process  Demonstrated experience  Cost, including expenses  Timeline and projected completion date  Other relevant factors as determined by the ODL Steering Committee  Questions regarding this RFP should be directed by e-mail only to Michael Ridley  (mridley@uoguelph.ca)."
    },
    {
        "page": 8,
        "category": "Text",
        "bbox": [
            90.04,
            324.66,
            524.18,
            349.58
        ],
        "text": "Bidders are asked not to contact any other member of the ODL Catalyst Team or the ODL Steering  Committee."
    },
    {
        "page": 8,
        "category": "Text",
        "bbox": [
            90.04,
            734.04,
            284.27,
            742.48
        ],
        "text": "RFP: To Develop the Ontario Digital Library Business Plan"
    },
    {
        "page": 8,
        "category": "Text",
        "bbox": [
            296.71,
            730.98,
            524.65,
            743.66
        ],
        "text": "March 2003  8"
    },
    {
        "page": 9,
        "category": "Section-header",
        "bbox": [
            90.04,
            107.52,
            383.56,
            124.43
        ],
        "text": "Appendix A:  ODL Envisioned Phases & Funding"
    },
    {
        "page": 9,
        "category": "Section-header",
        "bbox": [
            90.04,
            139.79,
            219.39,
            150.9
        ],
        "text": "Phase I:  Business Planning"
    },
    {
        "page": 9,
        "category": "Section-header",
        "bbox": [
            90.04,
            162.82,
            134.51,
            173.94
        ],
        "text": "Timeline:"
    },
    {
        "page": 9,
        "category": "Section-header",
        "bbox": [
            134.32,
            162.82,
            268.01,
            173.94
        ],
        "text": "March 2003 – September 2003"
    },
    {
        "page": 9,
        "category": "Section-header",
        "bbox": [
            90.04,
            174.35,
            185.07,
            185.46
        ],
        "text": "Funding Requested:"
    },
    {
        "page": 9,
        "category": "Text",
        "bbox": [
            187.36,
            174.35,
            520.75,
            185.46
        ],
        "text": "~$100,000 jointly funded by stakeholder groups and the provincial government."
    },
    {
        "page": 9,
        "category": "Section-header",
        "bbox": [
            90.04,
            197.27,
            124.91,
            208.38
        ],
        "text": "Result:"
    },
    {
        "page": 9,
        "category": "Section-header",
        "bbox": [
            124.72,
            197.27,
            226.6,
            208.38
        ],
        "text": "The ODL business plan"
    },
    {
        "page": 9,
        "category": "Text",
        "bbox": [
            90.04,
            220.42,
            523.18,
            300.55
        ],
        "text": "The first phase will be to build the ODL business plan. This plan will clearly define the ODL’s services,  funding and governance structures, as well as implementation plans for 2003-2005. It will also secure  the full commitment of all stakeholders and scope the operational plan for ODL for 2006 and beyond.  Given the number and diversity of stakeholders involved, the business planning process must be a fully  consultative approach. To ensure that the planning results in a workable plan with the full commitment  of all stakeholders it must have competent, dedicated staffing and monies for the travel and"
    },
    {
        "page": 9,
        "category": "Text",
        "bbox": [
            90.04,
            300.96,
            361.23,
            312.07
        ],
        "text": "communication components so critical in a consultative process."
    },
    {
        "page": 9,
        "category": "Section-header",
        "bbox": [
            90.04,
            335.28,
            278.52,
            346.4
        ],
        "text": "Phase II: Implementing and Transitioning"
    },
    {
        "page": 9,
        "category": "Section-header",
        "bbox": [
            90.04,
            358.32,
            134.51,
            369.43
        ],
        "text": "Timeline:"
    },
    {
        "page": 9,
        "category": "Section-header",
        "bbox": [
            134.32,
            358.32,
            257.68,
            369.43
        ],
        "text": "April 2004 – December 2006"
    },
    {
        "page": 9,
        "category": "Section-header",
        "bbox": [
            90.04,
            369.84,
            185.07,
            380.96
        ],
        "text": "Funding Requested:"
    },
    {
        "page": 9,
        "category": "Text",
        "bbox": [
            187.36,
            369.84,
            509.49,
            380.96
        ],
        "text": "Funding from other states and provinces suggest that the ODL could receive"
    },
    {
        "page": 9,
        "category": "Text",
        "bbox": [
            90.04,
            381.37,
            513.93,
            392.48
        ],
        "text": "funding of up to $50 Million (over 3 years). Funding to be provided partnership of government, library"
    },
    {
        "page": 9,
        "category": "Text",
        "bbox": [
            90.04,
            392.77,
            266.22,
            403.89
        ],
        "text": "stakeholders and other interested parties."
    },
    {
        "page": 9,
        "category": "Section-header",
        "bbox": [
            90.04,
            415.81,
            124.91,
            426.92
        ],
        "text": "Result:"
    },
    {
        "page": 9,
        "category": "Text",
        "bbox": [
            124.72,
            415.81,
            291.26,
            426.92
        ],
        "text": "The ODL is implemented and validated"
    },
    {
        "page": 9,
        "category": "Text",
        "bbox": [
            90.04,
            438.96,
            524.84,
            519.09
        ],
        "text": "The second phase will be to implement the ODL based on the business plan. This phase recognizes  that for ODL to be optimally successful libraries must transition to a new way of doing business and  providing services. The transition must occur while libraries continue to provide existing services and  respond to current challenges. This implementation phase will funded by a partnership of government,  library stakeholders and other interested parties as a means to quickly jumpstart the ODL.  The seed money requested will allow libraries to realign their budgets and services as the infrastructure"
    },
    {
        "page": 9,
        "category": "Text",
        "bbox": [
            90.04,
            519.38,
            291.63,
            530.5
        ],
        "text": "and content of the ODL is created and secured."
    },
    {
        "page": 9,
        "category": "Text",
        "bbox": [
            291.4,
            519.38,
            524.73,
            530.5
        ],
        "text": "Some of the funding will be new money, although there"
    },
    {
        "page": 9,
        "category": "Text",
        "bbox": [
            90.04,
            530.79,
            524.85,
            541.9
        ],
        "text": "is every indication that existing budgets and methods of operating may be modified as a result of"
    },
    {
        "page": 9,
        "category": "Text",
        "bbox": [
            90.04,
            542.31,
            165.91,
            553.42
        ],
        "text": "recommendations"
    },
    {
        "page": 9,
        "category": "Text",
        "bbox": [
            90.04,
            542.31,
            524.7,
            599.64
        ],
        "text": ". During this phase the polices, procedures, governance structures and accountability  mechanisms of the ODL will be put in place. Pilot projects will be initiated, evaluated and expanded.  Information resources will be identified, contracts for these resources will be negotiated and resources  will be made deployed through the ODL. Regular evaluation during this phase will ensure the ODL is  achieving its objectives and is accountable to its key communities."
    },
    {
        "page": 9,
        "category": "Section-header",
        "bbox": [
            90.04,
            611.32,
            282.46,
            622.44
        ],
        "text": "Phase III: Operating and Growing the ODL"
    },
    {
        "page": 9,
        "category": "Section-header",
        "bbox": [
            90.04,
            634.36,
            134.57,
            645.47
        ],
        "text": "Timeline:"
    },
    {
        "page": 9,
        "category": "List-item",
        "bbox": [
            134.32,
            634.36,
            197.63,
            645.47
        ],
        "text": "January 2007 -"
    },
    {
        "page": 9,
        "category": "Section-header",
        "bbox": [
            90.04,
            645.88,
            133.74,
            657.0
        ],
        "text": "Funding:"
    },
    {
        "page": 9,
        "category": "Text",
        "bbox": [
            133.48,
            645.88,
            391.54,
            657.0
        ],
        "text": "$50 Million annually ($35 Million requested from government)"
    },
    {
        "page": 9,
        "category": "Section-header",
        "bbox": [
            90.04,
            668.8,
            124.91,
            679.92
        ],
        "text": "Result:"
    },
    {
        "page": 9,
        "category": "Text",
        "bbox": [
            124.72,
            668.8,
            312.53,
            679.92
        ],
        "text": "The ODL is fully operational and sustainable"
    },
    {
        "page": 9,
        "category": "Text",
        "bbox": [
            90.05,
            691.96,
            518.71,
            714.6
        ],
        "text": "In the third phase the ODL moves into the operational stage. Ontarians will experience the full benefits  of the initiative and libraries will consolidate support around the ODL to grow resources and extend"
    },
    {
        "page": 9,
        "category": "Text",
        "bbox": [
            90.04,
            734.04,
            284.27,
            742.48
        ],
        "text": "RFP: To Develop the Ontario Digital Library Business Plan"
    },
    {
        "page": 9,
        "category": "List-item",
        "bbox": [
            296.71,
            734.04,
            340.93,
            742.48
        ],
        "text": "March 2003"
    },
    {
        "page": 9,
        "category": "Text",
        "bbox": [
            516.64,
            730.98,
            524.65,
            743.66
        ],
        "text": "9"
    },
    {
        "page": 10,
        "category": "Text",
        "bbox": [
            90.04,
            72.23,
            522.04,
            83.34
        ],
        "text": "capabilities. The challenge is to secure resources sufficient to both sustain the original investments and"
    },
    {
        "page": 10,
        "category": "Section-header",
        "bbox": [
            90.04,
            83.75,
            180.27,
            94.87
        ],
        "text": "to enhance the ODL."
    },
    {
        "page": 10,
        "category": "Text",
        "bbox": [
            90.04,
            106.67,
            518.5,
            152.35
        ],
        "text": "The ongoing funding of the ODL will be based on a partnership model involving all the key participants  (i.e. government, libraries, donors, public and private sectors). All participants (i.e. beneficiaries) are  expected to make financial contributions to the ODL. It is important in achieving the full impact of the  ODL on Ontario’s economy, society and learning support that all library sectors are participants"
    },
    {
        "page": 10,
        "category": "Text",
        "bbox": [
            90.05,
            152.76,
            298.99,
            163.88
        ],
        "text": "(university, colleges, public libraries and schools)."
    },
    {
        "page": 10,
        "category": "Text",
        "bbox": [
            90.04,
            170.28,
            522.16,
            302.86
        ],
        "text": "The proposed funding model requires a continuing government investment, but also recognizes that as  the ODL matures a growing share of ODL funding will come from libraries and non-governmental  sources. During the 3-year implementation phase (2004 – 2006) libraries will realign their budgets to  enable ongoing funding contributions to ODL. During the same period ODL must build the proposed  endowment and secure public and private sector gifts and/or in-kind contributions. The following chart  outlines the model. This model is based on these assumptions:  1. that ODL expenditures will increase by 50% over a 10 year period  2. that government funding will decrease from 70% to 45% during that 10 year period  3. that library contributions, endowment and gifts/in-kind funding will increase from 30% to 55%  during the same period"
    },
    {
        "page": 10,
        "category": "Section-header",
        "bbox": [
            245.81,
            320.67,
            423.01,
            331.78
        ],
        "text": "OVERVIEW OF ODL FUNDING MODEL"
    },
    {
        "page": 10,
        "category": "Section-header",
        "bbox": [
            114.4,
            344.1,
            205.68,
            357.49
        ],
        "text": "Funding Source"
    },
    {
        "page": 10,
        "category": "Section-header",
        "bbox": [
            313.36,
            344.1,
            342.49,
            357.49
        ],
        "text": "2007"
    },
    {
        "page": 10,
        "category": "Text",
        "bbox": [
            90.05,
            344.1,
            523.38,
            544.65
        ],
        "text": "2017  $35M (70%)  $33.75M (45%)  Libraries  $10M (20%)  $22.5M (30%)  Endowment  $4.5M (9%)  $15M (20%)  Gifts/In-Kind  $0.5M (1%)  $3.75M (5%)  $50M $75M While the private sector will be invited to participate in the ODL through the endowment, gifts and in- kind contributions, the ODL will also explore compatible commercial services which leverage the reach  of the ODL and help to offset operating costs.  A $50M budget leverages the consortium buying power of the province’s libraries to secure the best  prices for information resources, the widest accessibility and the most favourable contracts. A budget of  this nature will ensure a core digital collection of sufficient scope and coverage to address a substantial  amount of the wide and diverse information and learning needs of the citizens of Ontario (an overview  of the nature of the ODL digital collection is appended)."
    },
    {
        "page": 10,
        "category": "List-item",
        "bbox": [
            114.4,
            358.43,
            169.78,
            369.54
        ],
        "text": "Government"
    },
    {
        "page": 10,
        "category": "Section-header",
        "bbox": [
            114.41,
            406.31,
            195.06,
            417.43
        ],
        "text": "TOTAL ANNUAL"
    },
    {
        "page": 10,
        "category": "List-item",
        "bbox": [
            322.37,
            533.53,
            507.58,
            544.65
        ],
        "text": "The proposed ODL expenditures in 2006"
    },
    {
        "page": 10,
        "category": "Section-header",
        "bbox": [
            90.05,
            545.06,
            292.15,
            556.17
        ],
        "text": "represent an investment of $5.00 per citizen."
    },
    {
        "page": 10,
        "category": "Text",
        "bbox": [
            90.05,
            567.97,
            520.53,
            613.66
        ],
        "text": "It is important to recognize that every new dollar per citizen invested in the Ontario Digital Library has a  double benefit: it supports a province-wide library of high quality information resources and it  strengthens every local library in Ontario by allowing them to reinvest existing dollars in new resources  that enhance local services."
    },
    {
        "page": 10,
        "category": "List-item",
        "bbox": [
            208.97,
            602.55,
            521.56,
            613.66
        ],
        "text": "This multiplier means that for every dollar invested in ODL the return"
    },
    {
        "page": 10,
        "category": "Text",
        "bbox": [
            90.05,
            614.07,
            301.65,
            625.18
        ],
        "text": "on investment is worth $2 of value for Ontario."
    },
    {
        "page": 10,
        "category": "Text",
        "bbox": [
            90.04,
            734.04,
            284.27,
            742.48
        ],
        "text": "RFP: To Develop the Ontario Digital Library Business Plan"
    },
    {
        "page": 10,
        "category": "Text",
        "bbox": [
            296.71,
            730.98,
            524.17,
            743.9
        ],
        "text": "March 2003  10 10 10 10"
    },
    {
        "page": 11,
        "category": "Section-header",
        "bbox": [
            96.04,
            92.52,
            173.53,
            109.43
        ],
        "text": "Appendix B:"
    },
    {
        "page": 11,
        "category": "Text",
        "bbox": [
            198.02,
            92.52,
            477.87,
            109.43
        ],
        "text": "ODL Steering Committee Terms of Reference"
    },
    {
        "page": 11,
        "category": "Section-header",
        "bbox": [
            90.04,
            136.79,
            146.07,
            147.9
        ],
        "text": "1. Preamble"
    },
    {
        "page": 11,
        "category": "Text",
        "bbox": [
            95.8,
            159.94,
            521.76,
            171.06
        ],
        "text": "Implementation of the Ontario Digital Library (ODL) requires a detailed business plan to be developed"
    },
    {
        "page": 11,
        "category": "Text",
        "bbox": [
            95.8,
            171.35,
            347.49,
            182.46
        ],
        "text": "and supported by its diverse stakeholder communities (see:"
    },
    {
        "page": 11,
        "category": "Text",
        "bbox": [
            347.32,
            171.35,
            478.9,
            182.46
        ],
        "text": "www.odl.on.ca ).  The business"
    },
    {
        "page": 11,
        "category": "Text",
        "bbox": [
            95.8,
            182.87,
            516.06,
            205.51
        ],
        "text": "development planning and commitment process will be overseen by a Steering Committee, who are  accountable to potential ODL funders including  the Province of Ontario."
    },
    {
        "page": 11,
        "category": "Section-header",
        "bbox": [
            90.04,
            217.31,
            191.93,
            228.43
        ],
        "text": "2. Terms of Reference"
    },
    {
        "page": 11,
        "category": "Text",
        "bbox": [
            95.8,
            240.35,
            505.9,
            262.99
        ],
        "text": "In broad terms, the ODL Business Plan Steering Committee is responsible for development of the  business plan, securing sector support, and management of the planners and process.  Specific"
    },
    {
        "page": 11,
        "category": "List-item",
        "bbox": [
            95.8,
            263.4,
            195.01,
            274.51
        ],
        "text": "responsibilities include:"
    },
    {
        "page": 11,
        "category": "List-item",
        "bbox": [
            95.8,
            286.43,
            524.63,
            320.48
        ],
        "text": "2.1 developing a detailed business plan for the three-year implementation phase of the ODL, including  governance, management, funding model and structure, organizational structure, marketing,  staffing, and evaluation;"
    },
    {
        "page": 11,
        "category": "List-item",
        "bbox": [
            95.8,
            320.89,
            523.9,
            470.05
        ],
        "text": "2.2 consulting with and reporting to stakeholder communities, to ensure open, consistent and two-way  communication, and to ensure meaningful opportunities for stakeholder input into decision- making;  2.3 recruiting and managing the business planner(s);  2.4 defining terms of reference and resource parameters for business planner(s), and authorizing  expenditures;  2.5 serving as a focus group for business planner(s) to test ideas;  2.6 providing signoff for business planner(s) at key decision points of business plan development;  2.7 securing commitment from library, government, and institutional stakeholders for implementation  of the business plan;  2.8 presenting the business plan to funders  2.9 undertaking advocacy efforts to promote the ODL to the broader communities including library  and education communities."
    },
    {
        "page": 11,
        "category": "Section-header",
        "bbox": [
            90.03,
            481.85,
            159.62,
            492.97
        ],
        "text": "3. Membership"
    },
    {
        "page": 11,
        "category": "Text",
        "bbox": [
            95.79,
            504.89,
            512.95,
            550.56
        ],
        "text": "Each of the four sectors, Schools, Colleges, Universities, and Public Libraries can appoint up to two  representatives to the steering committee  3.1 Schools:"
    },
    {
        "page": 11,
        "category": "Text",
        "bbox": [
            95.78,
            550.97,
            514.9,
            642.51
        ],
        "text": "- Ontario School Library Association (OSLA) and The Association of Library Consultants and  Coordinators of Ontario (TALCO)  ( Executive Council of OSLA to name representative in  consultation with TALCO )  3.2 Universities:  - Ontario Council of University Libraries (OCUL) ( OCUL to name )  3.3 Colleges:  - Bibliocentre, and Heads of Libraries and Learning Resources (UAG and HLLR  to name )  3.4 Public libraries:"
    },
    {
        "page": 11,
        "category": "Text",
        "bbox": [
            126.02,
            642.92,
            521.35,
            688.49
        ],
        "text": "- Administrators of Medium-sized Public Libraries of Ontario (AMPLO), Administrators of Rural  Urban Public Libraries of Ontario (ARUPLO), Administrators of Small Public Libraries of  Ontario (ASPLO) and Chief Executives of Large-sized Public Libraries of Ontario (CELPLO)  ("
    },
    {
        "page": 11,
        "category": "Text",
        "bbox": [
            90.04,
            677.37,
            405.33,
            742.48
        ],
        "text": "Executives of AMPLO, ARUPLO, ASPLO and CELPLO to name )  RFP: To Develop the Ontario Digital Library Business Plan"
    },
    {
        "page": 11,
        "category": "List-item",
        "bbox": [
            296.71,
            734.04,
            340.93,
            742.48
        ],
        "text": "March 2003"
    },
    {
        "page": 11,
        "category": "Text",
        "bbox": [
            510.88,
            730.98,
            524.17,
            743.9
        ],
        "text": "11 11 11 11"
    },
    {
        "page": 12,
        "category": "Text",
        "bbox": [
            95.82,
            72.14,
            341.75,
            83.25
        ],
        "text": "3.5 Ontario Library Association representative (ex-officio)  ("
    },
    {
        "page": 12,
        "category": "Page-header",
        "bbox": [
            341.58,
            72.14,
            491.55,
            83.25
        ],
        "text": "OLA to appoint one representative )"
    },
    {
        "page": 12,
        "category": "Text",
        "bbox": [
            126.07,
            83.78,
            518.13,
            106.42
        ],
        "text": "- Role of the OLA ex-officio member: To act as a liaison between the steering committee and  the OLA Board, and to assist the chair with the administrative responsibilities connected with"
    },
    {
        "page": 12,
        "category": "Text",
        "bbox": [
            95.83,
            106.71,
            481.98,
            140.86
        ],
        "text": "the preparation of the business plan, finance, and communications.  3.6 It is anticipated that as planning for the ODL evolves, the Steering Committee may, at its"
    },
    {
        "page": 12,
        "category": "Text",
        "bbox": [
            95.83,
            141.27,
            369.48,
            152.38
        ],
        "text": "discretion, call on invited experts to advise on issues as required."
    },
    {
        "page": 12,
        "category": "Section-header",
        "bbox": [
            90.07,
            164.19,
            264.4,
            175.3
        ],
        "text": "4. Appointment Criteria and Process"
    },
    {
        "page": 12,
        "category": "Section-header",
        "bbox": [
            95.83,
            187.83,
            111.66,
            198.95
        ],
        "text": "4.1"
    },
    {
        "page": 12,
        "category": "Text",
        "bbox": [
            126.06,
            187.83,
            524.75,
            198.95
        ],
        "text": "Groups and organizations named in Section 3 above are responsible for appointing up to two"
    },
    {
        "page": 12,
        "category": "Text",
        "bbox": [
            131.83,
            199.83,
            314.24,
            210.95
        ],
        "text": "representatives to the Steering Committee."
    },
    {
        "page": 12,
        "category": "List-item",
        "bbox": [
            95.84,
            223.84,
            111.67,
            234.95
        ],
        "text": "4.2"
    },
    {
        "page": 12,
        "category": "Text",
        "bbox": [
            126.07,
            223.84,
            404.11,
            234.95
        ],
        "text": "Desired characteristics for steering committee appointees include:"
    },
    {
        "page": 12,
        "category": "List-item",
        "bbox": [
            108.08,
            246.91,
            115.15,
            259.89
        ],
        "text": "•"
    },
    {
        "page": 12,
        "category": "Text",
        "bbox": [
            126.08,
            247.96,
            204.25,
            259.08
        ],
        "text": "Strategic thinkers;"
    },
    {
        "page": 12,
        "category": "List-item",
        "bbox": [
            108.08,
            259.15,
            115.15,
            272.13
        ],
        "text": "•"
    },
    {
        "page": 12,
        "category": "Text",
        "bbox": [
            126.08,
            260.2,
            355.53,
            271.32
        ],
        "text": "Committed to the concept of multi-sector partnerships;"
    },
    {
        "page": 12,
        "category": "List-item",
        "bbox": [
            108.08,
            271.28,
            115.15,
            284.25
        ],
        "text": "•"
    },
    {
        "page": 12,
        "category": "Text",
        "bbox": [
            126.08,
            272.32,
            347.59,
            283.44
        ],
        "text": "Knowledgeable about digital libraries and resources;"
    },
    {
        "page": 12,
        "category": "List-item",
        "bbox": [
            108.08,
            283.52,
            115.15,
            296.49
        ],
        "text": "•"
    },
    {
        "page": 12,
        "category": "Text",
        "bbox": [
            126.08,
            284.56,
            319.68,
            295.68
        ],
        "text": "Knowledgeable about government structures;"
    },
    {
        "page": 12,
        "category": "List-item",
        "bbox": [
            108.08,
            295.64,
            115.15,
            308.62
        ],
        "text": "•"
    },
    {
        "page": 12,
        "category": "Text",
        "bbox": [
            126.08,
            296.68,
            310.64,
            307.8
        ],
        "text": "Respected by their communities; influential;"
    },
    {
        "page": 12,
        "category": "List-item",
        "bbox": [
            108.08,
            307.76,
            115.15,
            320.74
        ],
        "text": "•"
    },
    {
        "page": 12,
        "category": "Text",
        "bbox": [
            126.08,
            308.81,
            283.54,
            319.92
        ],
        "text": "Able to take a consultative approach;"
    },
    {
        "page": 12,
        "category": "List-item",
        "bbox": [
            108.04,
            319.92,
            116.56,
            335.56
        ],
        "text": "•"
    },
    {
        "page": 12,
        "category": "List-item",
        "bbox": [
            126.04,
            323.03,
            505.72,
            347.34
        ],
        "text": "Able to devote time to Steering Committee business: approximately one day per month for  meetings plus 2-3 working days per month on related activities"
    },
    {
        "page": 12,
        "category": "Text",
        "bbox": [
            386.68,
            334.38,
            393.35,
            347.77
        ],
        "text": "."
    },
    {
        "page": 12,
        "category": "Section-header",
        "bbox": [
            90.04,
            359.63,
            134.33,
            370.74
        ],
        "text": "5. Term"
    },
    {
        "page": 12,
        "category": "Text",
        "bbox": [
            95.8,
            382.78,
            492.18,
            405.3
        ],
        "text": "Expected term on the Steering Committee is the time required to complete development of the  business plan plus two months. This process is expected to take approximately 6 months."
    },
    {
        "page": 12,
        "category": "Section-header",
        "bbox": [
            90.04,
            417.11,
            135.05,
            428.22
        ],
        "text": "6. Chair"
    },
    {
        "page": 12,
        "category": "Text",
        "bbox": [
            95.8,
            440.26,
            412.59,
            451.38
        ],
        "text": "Chair will be appointed by the Board of the Ontario Library Association."
    },
    {
        "page": 12,
        "category": "List-item",
        "bbox": [
            95.8,
            465.46,
            171.78,
            476.58
        ],
        "text": "Role of the Chair:"
    },
    {
        "page": 12,
        "category": "Text",
        "bbox": [
            95.8,
            488.5,
            515.55,
            534.18
        ],
        "text": "In addition to the characteristics for appointees (4.2) the role of the chair will be as a process agent  working with the selected consultant(s), OLA, and the Steering Committee to prepare the business  plan. The chair must be able to devote 5-8 days per month on activities related to the preparation of  the business plan, and communications to stakeholders, funders, and government."
    },
    {
        "page": 12,
        "category": "Section-header",
        "bbox": [
            90.04,
            545.87,
            152.21,
            556.98
        ],
        "text": "7. Meetings"
    },
    {
        "page": 12,
        "category": "Text",
        "bbox": [
            90.04,
            569.02,
            508.52,
            614.46
        ],
        "text": "It is expected that in person meetings are held once per month and the majority of business will be  conducted by e-mail, and teleconference.  8. Lines of Accountability and Communication"
    },
    {
        "page": 12,
        "category": "Text",
        "bbox": [
            95.8,
            626.5,
            493.02,
            649.14
        ],
        "text": "8.1 The Steering Committee is accountable to the Province of Ontario, and to its business plan  funders."
    },
    {
        "page": 12,
        "category": "Text",
        "bbox": [
            90.04,
            661.07,
            522.45,
            742.48
        ],
        "text": "8.2 The role of the Ontario Library Association is to assume responsibility for  funds contributed by the  ODL funders to finance the business plan, to hold the funds in a separate account, and  disperse them for purposes as  directed by the Steering Committee. OLA will provide  financial reports to the Steering Committee as requested and shall comply with all  government reporting regulations for funds received.  RFP: To Develop the Ontario Digital Library Business Plan"
    },
    {
        "page": 12,
        "category": "List-item",
        "bbox": [
            296.71,
            734.04,
            340.93,
            742.48
        ],
        "text": "March 2003"
    },
    {
        "page": 12,
        "category": "Text",
        "bbox": [
            510.88,
            730.98,
            524.17,
            743.9
        ],
        "text": "12 12 12 12"
    },
    {
        "page": 13,
        "category": "Text",
        "bbox": [
            95.8,
            83.77,
            519.81,
            129.34
        ],
        "text": "8.3 The Steering Committee is accountable to its constituent groups and other stakeholders for  ongoing communications and consultation on issues and progress.  The Steering committee  is responsible for strong liaison with government particularly the Chief Information Officer  Community Services Cluster, ADM’s and Deputy Ministers."
    },
    {
        "page": 13,
        "category": "Text",
        "bbox": [
            90.04,
            141.14,
            522.13,
            267.36
        ],
        "text": "9. Financial and Administrative Policies  9.1 Service on the Steering Committee is non-remunerative  9.2 Travel and meeting expenses for Steering Committee members are reimbursed according to the  policies of the Ontario Library Association  9.3 Conflict of Interest:  The ODL Steering Committee will function according to standard conflict of interest guidelines  ensuring that members,  their immediate family members, or their places of employment, will  not benefit financially from the decisions  the Steering Committee might make. As a first  order of business, the Steering Committee will be expected to adopt a conflict of interest policy  statement and procedural guidelines that will govern its work."
    },
    {
        "page": 13,
        "category": "Text",
        "bbox": [
            90.04,
            734.04,
            284.27,
            742.48
        ],
        "text": "RFP: To Develop the Ontario Digital Library Business Plan"
    },
    {
        "page": 13,
        "category": "Text",
        "bbox": [
            296.71,
            730.98,
            524.17,
            743.9
        ],
        "text": "March 2003  13 13 13 13"
    },
    {
        "page": 14,
        "category": "Section-header",
        "bbox": [
            96.04,
            92.52,
            173.51,
            109.43
        ],
        "text": "Appendix C:"
    },
    {
        "page": 14,
        "category": "Text",
        "bbox": [
            96.04,
            92.52,
            498.67,
            217.03
        ],
        "text": "ODL’s Envisioned Electronic Resources  The purpose of the ODL is to provide equal access to information for all Ontario citizens through  collaboration and resource sharing. ODL will be a portal - capable of customization as  a home page for local libraries - to organized, comprehensive, authoritative and validated  e-information resources to meet the needs of all Ontario citizens at all stages and in all aspects  of their education, life and work. Some examples:  1. Reference Resources"
    },
    {
        "page": 14,
        "category": "Text",
        "bbox": [
            90.04,
            228.96,
            480.2,
            742.48
        ],
        "text": "- directories: companies, associations, organizations, governments, educational institutions,  etc. etc.  - almanacs, country information  - dictionaries, thesauri, encyclopedias  -consumer information  - phone books,  - travel guides, entertainment guides  - weather information  - media/newspapers  - leisure time, recreational activity guides  - indexing and abstracting services  - currency converters,  - virtual reference services  -vocational/career information  -internet search engines  -current awareness services  2. Subject Guides  -arts and humanities  - business and economics  - education  -recreation and sports  -entertainment - games, activities for kids  -health information  -science and technology  -social sciences  -society and culture  3. Educational tool-kits  -guides to information gathering methodologies, information literacy  -study guides  -study skill development  -web-based curricula  -internet search guides  4. Journals, books, maps, music etc.  RFP: To Develop the Ontario Digital Library Business Plan"
    },
    {
        "page": 14,
        "category": "Text",
        "bbox": [
            296.71,
            734.04,
            340.93,
            742.48
        ],
        "text": "March 2003"
    },
    {
        "page": 14,
        "category": "Text",
        "bbox": [
            510.88,
            730.98,
            524.17,
            743.9
        ],
        "text": "14 14 14 14"
    }
]