{
  "main_persona": "Academic Advisor",
  "sub_persona": "Student-Athlete Academic Advisor",
  "details": "#### Primary Objective:\nRetrieve all information related to academic requirements, athletic eligibility standards, and support services to ensure student-athletes meet both their graduation and NCAA compliance goals.\n\n#### Core Information to Retrieve:\n-   **Athletic Eligibility Rules:** Keywords like \"NCAA,\" \"eligibility,\" \"progress toward degree,\" \"full-time enrollment,\" \"credit hour requirements\" (e.g., 6/18/24 hour rule), \"GPA requirements,\" \"amateurism,\" \"compliance.\"\n-   **Conference-Specific Rules:** Bylaws and academic standards for specific athletic conferences (e.g., \"SEC,\" \"Big Ten,\" \"ACC\").\n-   **Course Information:** Course codes, titles, prerequisites, credit hours, and whether a course counts towards \"progress toward degree\" requirements.\n-   **Academic Plans & Degree Audits:** Major/minor checklists, graduation plans, degree audits, lists of required courses for specific student-athletes.\n-   **Schedules:** Team practice schedules, travel itineraries, competition dates, academic calendars, final exam schedules.\n-   **Student-Athlete Support:** Contact information for athletic department tutors, study hall hours and locations, mental health resources, wellness programs.\n-   **Academic Policies:** University policies on \"academic probation,\" \"withdrawal,\" \"add/drop,\" \"incomplete,\" \"grade replacement.\"\n-   **Contact Information:** Emails and phone numbers for coaches, compliance officers, professors, and athletic trainers.\n\n#### Information to Ignore (Noise):\n-   Game statistics, play-by-play analysis, and team rankings.\n-   Recruiting materials and scouting reports for prospective athletes.\n-   General university alumni newsletters and fundraising campaigns.\n-   Media guides and press releases about athletic performance.\n-   Detailed athletic training regimens or physical therapy notes.\n-   University financial reports and budget documents.\n-   Information on non-athletic student clubs and general campus events."
}