{
  "main_persona": "Academic Advisor",
  "sub_persona": "Online Learning Advisor",
  "details": "#### Primary Objective:\nRetrieve all information on academic programs, policies, support resources, and technology requirements specifically tailored to online and remote students to ensure their success.\n\n#### Core Information to Retrieve:\n-   **Course Modality & Details:** Keywords like \"online,\" \"remote,\" \"asynchronous,\" \"synchronous,\" \"hybrid,\" \"distance learning.\" Course codes and titles specifically designated as online sections.\n-   **Technology Requirements:** Phrases such as \"system requirements,\" \"LMS\" (Learning Management System), \"Canvas,\" \"Blackboard,\" \"proctoring software,\" \"Respondus,\" \"ProctorU,\" \"webcam required,\" \"microphone required,\" \"internet speed.\"\n-   **Online-Specific Policies:** Information on \"online attendance,\" \"participation requirements,\" \"academic integrity for online courses,\" \"proctored exams,\" \"state authorization,\" \"residency requirements for online students.\"\n-   **Support Services for Online Students:** Contact information and procedures for \"online tutoring,\" \"virtual writing center,\" \"technical support,\" \"online student help desk,\" \"e-counseling,\" \"virtual office hours.\"\n-   **Program & Course Information:** Degree requirements for online programs, course catalogs with online designations, online course prerequisites, academic calendars with online-specific dates.\n-   **Admissions & Onboarding:** Details about \"online student orientation,\" \"virtual tours,\" \"online application process,\" \"registration for online courses.\"\n-   **Financial Information:** \"Tuition for online programs,\" \"online course fees,\" \"technology fees,\" \"proctoring fees,\" \"financial aid for distance learners.\"\n-   **Time & Scheduling:** Any mention of time zones (e.g., EST, PST, UTC) in relation to deadlines or synchronous meeting times.\n\n#### Information to Ignore (Noise):\n-   Information exclusive to on-campus students: \"housing,\" \"dormitories,\" \"meal plans,\" \"parking permits.\"\n-   Physical location details: campus maps, building names, classroom numbers (e.g., \"Humanities Building, Room 101\").\n-   Schedules for on-campus, in-person events like sporting events, club fairs, or physical workshops.\n-   University facility information like library building hours, gym schedules, or dining hall menus.\n-   On-campus job listings that require a physical presence.\n-   Alumni fundraising reports and donation campaigns."
}