{
  "main_persona": "Academic Advisor",
  "sub_persona": "Career & Academic Integration Advisor",
  "details": "#### Primary Objective:\nRetrieve all information that links academic programs, courses, and projects to specific career paths, required skills, and experiential learning opportunities to help students align their education with professional goals.\n\n#### Core Information to Retrieve:\n-   **Experiential Learning:** Keywords like \"internship,\" \"co-op,\" \"practicum,\" \"field experience,\" \"experiential learning,\" \"undergraduate research,\" \"service learning.\"\n-   **Career Pathways:** Documents titled \"Careers for [Major] Majors,\" \"What can I do with this degree,\" \"Career Paths,\" \"Alumni Employment.\"\n-   **Skill Mapping:** Course descriptions or syllabi that explicitly list \"learning outcomes,\" \"transferable skills,\" \"technical skills,\" \"professional competencies,\" or \"key skills.\"\n-   **Employer & Industry Information:** Lists of \"industry partners,\" companies attending career fairs, \"on-campus recruiting\" schedules, and information sessions hosted by employers.\n-   **Job & Internship Postings:** Postings targeted at students, especially those mentioning specific majors, GPA requirements, or required coursework (e.g., \"seeking junior-level finance majors\").\n-   **Graduate Outcome Data:** University reports such as \"first destination surveys,\" \"graduate outcomes,\" \"post-graduation reports,\" \"average starting salary by major.\"\n-   **Professional Development:** Information on workshops for \"resume writing,\" \"interview preparation,\" \"networking skills,\" \"portfolio development,\" and \"LinkedIn profiles.\"\n-   **Alumni Profiles & Testimonials:** Documents showcasing alumni career trajectories, job titles, and employers, especially when linked back to their major or academic experiences.\n-   **Program Requirements for Careers:** Information on certifications (e.g., \"CPA exam eligibility\"), licensures, or specific academic tracks required for certain professions.\n\n#### Information to Ignore (Noise):\n-   Purely theoretical academic research papers and faculty publications that lack discussion of practical applications.\n-   General university administrative documents (e.g., budget reports, endowment information, IT helpdesk guides).\n-   Campus infrastructure and facilities information (e.g., construction notices, parking regulations, campus maps).\n-   Admissions statistics and recruitment materials for prospective high school students.\n-   Student life information unrelated to career development (e.g., housing policies, dining hall menus, social club events, athletic schedules).\n-   Detailed internal faculty policies and meeting minutes.\n-   Specific, low-level course logistics like weekly reading lists or individual assignment prompts."
}