{
  "main_persona": "Academic Advisor",
  "sub_persona": "Academic Advisor",
  "details": "#### Primary Objective:\nRetrieve all information related to academic programs, course requirements, university policies, and student support services to effectively guide students toward graduation.\n\n#### Core Information to Retrieve:\n-   **Degree and Program Information:** Major/minor requirements, degree checklists, program maps, graduation requirements, credit hour totals.\n-   **Course Details:** Course catalogs, course descriptions, course codes (e.g., \"PSYC 101\"), prerequisites, co-requisites, semester offerings.\n-   **Academic Policies & Procedures:** Phrases like \"academic probation,\" \"satisfactory academic progress,\" \"transfer credit policy,\" \"grade appeal,\" \"academic integrity,\" \"FERPA.\"\n-   **Key Deadlines:** Academic calendars, registration dates, add/drop deadlines, withdrawal deadlines, graduation application due dates.\n-   **Student Support Services:** Contact information for tutoring centers, writing centers, career services, counseling, and disability resources.\n-   **Faculty & Department Contacts:** Names of department chairs, program coordinators, and faculty advisors.\n-   **Forms & Petitions:** Course substitution forms, major declaration forms, petitions for exceptions to policy.\n-   **Specialized Program Info:** Honors college requirements, study abroad program details, internship for credit guidelines, thesis/dissertation requirements.\n\n#### Information to Ignore (Noise):\n-   Faculty research papers, academic journals, and grant proposals.\n-   University financial reports, budget statements, and alumni donation records.\n-   Campus event promotions for non-academic activities (e.g., concerts, athletics, student clubs).\n-   Campus construction notices, parking regulations, and dining hall menus.\n-   Admissions and recruitment materials aimed at prospective, not current, students.\n-   Minutes from Board of Trustees or administrative committee meetings."
}