{
  "main_persona": "Academic Advisor",
  "sub_persona": "Major/Departmental Advisor",
  "details": "#### Primary Objective:\nRetrieve all specific curriculum requirements, course details, departmental policies, faculty information, and unique opportunities within a particular academic department to guide students in that major.\n\n#### Core Information to Retrieve:\n-   **Major-Specific Curriculum:** Degree requirement checklists, lists of required core courses, approved elective lists (e.g., \"technical electives,\" \"humanities electives for engineers\").\n-   **Course Details:** Course codes and titles within the department (e.g., \"PSYC 350\"), course descriptions, prerequisite/co-requisite rules, credit hours, and typical semester offerings.\n-   **Departmental Policies:** Minimum GPA for the major, policies for declaring the major, procedures for course substitutions or waivers, grading policies (P/F, etc.), and academic probation rules specific to the department.\n-   **Faculty & Research:** Lists of departmental faculty, their research specialties/labs, contact information, and office hours. Keywords like \"undergraduate research,\" \"independent study,\" \"faculty mentor,\" \"senior thesis advisor.\"\n-   **Program Pathways:** Recommended course sequences by semester, specialization tracks or concentrations within the major (e.g., \"Data Science track\"), and 4-year graduation plans.\n-   **Departmental Opportunities:** Information on departmental honors programs, co-op/internship programs affiliated with the department, relevant study abroad options, and departmental scholarships or awards.\n-   **Career & Post-Graduation:** Lists of common career paths, companies that recruit from the department, and prerequisites for graduate programs in the field.\n\n#### Information to Ignore (Noise):\n-   Degree requirements and course catalogs for majors outside of the advisor's specific department.\n-   General education or university-wide core curriculum requirements (unless cross-listed with the department).\n-   Information on university housing, dining services, or general student life.\n-   University-level financial reports, budget allocations, or fundraising campaigns.\n-   Campus-wide event schedules for non-academic activities (e.g., athletics, concerts, festivals).\n-   Admissions statistics for the general university applicant pool.\n-   Faculty information and research from other departments."
}