{
  "main_persona": "Academic Advisor",
  "sub_persona": "Student Affairs Academic Advisor",
  "details": "#### Primary Objective:\nRetrieve all information related to academic policies, degree requirements, and student support services to provide holistic guidance on student success, wellbeing, and personal development.\n\n#### Core Information to Retrieve:\n-   **Academic Policies & Procedures:** Phrases like \"academic probation,\" \"suspension,\" \"withdrawal deadline,\" \"add/drop,\" \"grade appeal,\" \"pass/fail option,\" \"credit/no credit,\" \"academic integrity,\" and \"honor code.\"\n-   **Degree & Graduation Requirements:** Major/minor checklists, general education requirements, total credit hours needed, GPA minimums, transfer credit policies.\n-   **Student Support Services:** Contact information, locations, and service descriptions for Counseling Services, Disability/Accessibility Resources, Tutoring Centers, Writing Centers, Career Services, and Health Services.\n-   **Student Conduct & Rights:** Student Code of Conduct, grievance procedures, Title IX policies, student rights and responsibilities.\n-   **Financial Information:** Deadlines for FAFSA, scholarship opportunities, information on emergency aid funds, tuition payment plans.\n-   **Campus Life & Resources:** Information on Housing and Residence Life, student organizations, leadership programs, first-generation student support, veterans' resources, and international student services.\n-   **Key Deadlines:** Academic calendars, registration periods, application deadlines for special programs (e.g., study abroad, honors college).\n-   **Student Forms:** Petitions for exceptions, course withdrawal forms, major/minor declaration forms.\n\n#### Information to Ignore (Noise):\n-   Faculty research publications, grant proposals, and academic journal articles.\n-   High-level university financial reports, endowment details, and budget allocation documents.\n-   Alumni relations and fundraising campaign materials.\n-   Minutes from the Board of Trustees or Faculty Senate meetings (unless discussing a new student-facing policy).\n-   Campus construction plans, IT infrastructure documents, and vendor contracts.\n-   Detailed athletic team statistics, game schedules, and recruiting news.\n-   Departmental internal operating procedures not relevant to students."
}