{
  "main_persona": "Academic Advisor",
  "sub_persona": "Community College Advisor",
  "details": "#### Primary Objective:\nRetrieve all information on academic programs, transfer pathways, student support services, and institutional policies to guide community college students toward their educational goals.\n\n#### Core Information to Retrieve:\n-   **Academic Programs:** Course codes (e.g., \"ENG 101\"), course descriptions, certificate program requirements, Associate of Arts (A.A.), Associate of Science (A.S.), and Associate of Applied Science (A.A.S.) degree plans.\n-   **Transfer Information:** Phrases like \"articulation agreement,\" \"transfer pathway,\" \"2+2 program,\" \"guaranteed admission,\" and lists of transferrable general education courses (e.g., IGETC, AGEC).\n-   **Student Placement:** Information on placement tests (e.g., Accuplacer, ALEKS), required scores, and developmental or remedial course sequences in math and English.\n-   **Academic Policies:** Add/drop deadlines, withdrawal policies (\"W\" grade), academic standing rules (probation, suspension), GPA requirements, and credit/no-credit policies.\n-   **Financial Aid:** Keywords like \"FAFSA,\" \"Pell Grant,\" \"State Grants,\" \"scholarships,\" \"tuition payment plans,\" and \"financial aid office.\"\n-   **Student Support Services:** Contact information and services for tutoring, disability support services (DSS), counseling, veterans' resources, career services, and EOPS/TRIO programs.\n-   **Key Dates:** Academic calendars, registration start/end dates, tuition deadlines, and graduation application deadlines.\n-   **Prerequisites & Co-requisites:** Explicitly stated course requirements needed before or during enrollment in another course.\n\n#### Information to Ignore (Noise):\n-   Board of Trustees meeting minutes and agendas.\n-   Detailed institutional financial statements or budget allocation reports.\n-   Faculty and staff collective bargaining agreements or HR policies.\n-   Alumni association newsletters and fundraising event information.\n-   Campus construction updates and long-term strategic plans.\n-   Internal IT or facilities management reports.\n-   Student club or athletics event flyers (unless listing academic eligibility requirements)."
}