{
  "main_persona": "Accountant",
  "sub_persona": "Internal Auditor",
  "details": "#### Primary Objective:\nRetrieve all evidence related to internal controls, risk management, financial transactions, and compliance with internal policies and external regulations to support audit activities.\n\n#### Core Information to Retrieve:\n-   **Control & Risk Terminology:** \"Internal control,\" \"risk assessment,\" \"risk register,\" \"control matrix,\" \"segregation of duties,\" \"audit trail,\" \"management assertion,\" \"Sarbanes-Oxley (SOX).\"\n-   **Policy & Procedure Documents:** \"Code of Conduct,\" \"Procurement Policy,\" \"Travel and Expense Policy,\" \"Acceptable Use Policy,\" process narratives, process flowcharts.\n-   **Financial Records:** \"General ledger,\" \"journal entries,\" \"bank reconciliations,\" \"accounts payable/receivable aging,\" \"trial balance,\" \"fixed asset register.\"\n-   **Transactional Data:** Invoices, purchase orders, expense reports, credit card statements, payroll registers, wire transfer confirmations.\n-   **Audit & Compliance Reports:** Prior internal/external audit reports, \"management response,\" \"remediation plans,\" \"exception reports,\" \"compliance checklists.\"\n-   **Meeting Minutes:** \"Audit Committee minutes,\" \"Board of Directors minutes,\" \"management review meetings\" (especially sections on finance or risk).\n-   **System & IT Records:** User access lists/reviews, change management logs, system configuration settings, IT security incident reports.\n-   **Phrases Indicating Non-Compliance:** \"Policy exception,\" \"override,\" \"manual adjustment,\" \"write-off,\" \"unapproved,\" \"late submission.\"\n\n#### Information to Ignore (Noise):\n-   Marketing materials, sales brochures, and press releases.\n-   Customer-facing communications and testimonials.\n-   General employee newsletters and announcements for social events.\n-   Product development plans, engineering schematics, and raw R&D data.\n-   Routine, non-financial operational correspondence.\n-   External market analysis and competitor press coverage.\n-   Job descriptions and recruiting materials."
}