{
  "main_persona": "Accountant",
  "sub_persona": "Public Accountant (Auditor)",
  "details": "#### Primary Objective:\nRetrieve all financial statements, supporting transaction evidence, internal control documentation, and compliance records to assess the fairness and accuracy of a company's financial reporting.\n\n#### Core Information to Retrieve:\n-   **Financial Statements:** Balance Sheet, Income Statement (Profit and Loss), Statement of Cash Flows, Statement of Retained Earnings, Statement of Changes in Equity, Footnotes to the financial statements.\n-   **Core Accounting Records:** General Ledger, Trial Balance, Chart of Accounts.\n-   **Transaction-Level Evidence:** Invoices (sales and vendor), purchase orders, bank statements, bank reconciliations, expense reports, credit card statements.\n-   **Specific Account Schedules:** Accounts Receivable aging report, Accounts Payable aging report, fixed asset register, depreciation schedule, inventory valuation report, amortization schedules.\n-   **Internal Controls:** Phrases like \"internal control,\" \"segregation of duties,\" \"risk assessment,\" \"control environment,\" \"authorization,\" process narratives, and flowcharts.\n-   **Compliance & Governance:** Keywords like \"GAAP,\" \"IFRS,\" \"contingent liability,\" \"going concern,\" \"covenant,\" \"related party transactions.\"\n-   **Meeting Minutes:** Board of Directors minutes, Audit Committee minutes.\n-   **Payroll & HR:** Payroll registers, payroll tax filings (941, W-2, W-3), employee benefit plan documents.\n-   **Legal & Contracts:** Major customer or vendor contracts, loan agreements, lease agreements, legal correspondence regarding litigation.\n-   **Tax Documents:** Federal and state income tax returns, sales tax filings.\n\n#### Information to Ignore (Noise):\n-   Marketing materials, advertising copy, and brand guidelines.\n-   Sales forecasts and customer relationship management (CRM) reports.\n-   Non-financial employee data such as performance reviews, recruiting information, or company culture surveys.\n-   General company newsletters, press releases, or internal announcements.\n-   Detailed product schematics or technical engineering documents.\n-   IT support logs or routine system maintenance reports.\n-   Corporate social responsibility reports."
}