{
  "main_persona": "Accountant",
  "sub_persona": "Management Accountant",
  "details": "#### Primary Objective:\nRetrieve internal financial and operational data to support business planning, cost analysis, performance measurement, and strategic decision-making for management.\n\n#### Core Information to Retrieve:\n-   **Costing Data:** Keywords like \"cost of goods sold (COGS),\" \"direct costs,\" \"indirect costs,\" \"variable costs,\" \"fixed costs,\" \"overhead allocation,\" \"activity-based costing (ABC).\"\n-   **Budgeting & Forecasting:** Phrases such as \"annual budget,\" \"departmental budget,\" \"sales forecast,\" \"cash flow projection,\" \"pro forma,\" and any tables showing budget vs. actual figures.\n-   **Performance Metrics:** Key Performance Indicators (KPIs) like \"gross margin,\" \"contribution margin,\" \"return on investment (ROI),\" \"customer acquisition cost (CAC),\" \"inventory turnover,\" \"days sales outstanding (DSO),\" \"EBITDA.\"\n-   **Variance Analysis:** Reports and tables showing \"variance,\" \"price variance,\" \"volume variance,\" \"efficiency variance,\" \"spending variance.\"\n-   **Profitability Analysis:** Information broken down by \"product line profitability,\" \"customer profitability,\" \"divisional performance,\" \"segment reporting.\"\n-   **Capital Budgeting:** Terms and metrics related to investment decisions, such as \"net present value (NPV),\" \"internal rate of return (IRR),\" \"payback period,\" \"make or buy analysis,\" \"capital expenditure request.\"\n-   **Operational Data:** Non-financial metrics that drive costs, including \"units produced,\" \"machine hours,\" \"labor hours,\" \"sales volume,\" \"headcount.\"\n-   **Internal Management Reports:** Documents titled \"Management P&L,\" \"Internal Financial Statement,\" \"Monthly Performance Review,\" \"Operational Dashboard.\"\n\n#### Information to Ignore (Noise):\n-   **External Financial Reports:** Public-facing documents like audited Annual Reports (10-K), quarterly reports (10-Q), and shareholder press releases.\n-   **Tax Compliance Documents:** Tax returns, IRS forms (e.g., Form 1120, 941), and detailed discussions of tax law or strategy.\n-   **Marketing & Communications:** Marketing brochures, brand guidelines, social media policies, and general company newsletters.\n-   **Human Resources Policies:** Employee handbooks, benefits descriptions, and hiring policies unless they contain specific payroll or headcount data.\n-   **Detailed Legal Contracts:** Boilerplate legal language, terms and conditions, and litigation documents.\n-   **Highly Technical Schematics:** Engineering diagrams, software source code, and detailed scientific research."
}