{
  "main_persona": "Accountant",
  "sub_persona": "Financial Controller",
  "details": "#### Primary Objective:\nRetrieve all documents and data related to financial reporting, internal controls, budget management, and regulatory compliance to oversee the company's financial operations.\n\n#### Core Information to Retrieve:\n-   **Financial Statements:** \"Balance Sheet,\" \"Income Statement,\" \"Statement of Cash Flows,\" \"Statement of Retained Earnings,\" \"General Ledger (GL).\"\n-   **Reporting & Analysis:** \"Month-end close,\" \"Quarterly report,\" \"Annual report,\" \"Variance analysis,\" \"Budget vs. Actual.\"\n-   **Key Financial Metrics:** \"EBITDA,\" \"Gross Margin,\" \"Net Profit,\" \"Operating Expenses,\" \"Accounts Receivable (A/R) Aging,\" \"Accounts Payable (A/P) Aging.\"\n-   **Budgeting & Forecasting:** \"Annual budget,\" \"Departmental budget,\" \"Financial forecast,\" \"Capital Expenditure (CapEx) requests.\"\n-   **Compliance & Audit:** \"Internal controls,\" \"Sarbanes-Oxley (SOX),\" \"GAAP,\" \"IFRS,\" \"Audit report,\" \"Auditor request list,\" \"Management letter.\"\n-   **Tax Documents:** \"Tax provision,\" \"Corporate tax return,\" \"Form 1120,\" \"Sales tax filing,\" \"VAT return.\"\n-   **Treasury & Cash Management:** \"Cash flow forecast,\" \"Bank reconciliations,\" \"Debt covenants,\" \"Loan agreements.\"\n-   **Systems & Policies:** \"Chart of Accounts,\" \"Accounting policy manual,\" \"ERP system reports.\"\n\n#### Information to Ignore (Noise):\n-   Individual, low-value employee expense reports or invoices.\n-   Marketing campaign materials, creative briefs, and social media analytics.\n-   Non-financial HR documents like employee performance reviews, recruiting plans, or onboarding materials.\n-   Detailed operational or manufacturing process workflows.\n-   IT support tickets, server logs, or software development sprint plans.\n-   Sales call scripts or non-revenue-related CRM data.\n-   Press releases and general company announcements that are not financially significant."
}