{
  "main_persona": "Administrator",
  "sub_persona": "Facilities Administrator",
  "details": "#### Primary Objective:\nRetrieve all information related to the maintenance, safety, operation, and financial management of physical buildings, grounds, and infrastructure.\n\n#### Core Information to Retrieve:\n-   **Maintenance & Operations:** Keywords like \"work order,\" \"preventive maintenance,\" \"maintenance log,\" \"repair request,\" \"HVAC,\" \"plumbing,\" \"electrical,\" \"janitorial,\" \"landscaping.\"\n-   **Safety & Compliance:** Phrases such as \"safety inspection,\" \"fire code,\" \"building code,\" \"OSHA regulations,\" \"ADA compliance,\" \"emergency evacuation plan,\" \"incident report,\" \"hazardous materials,\" \"safety data sheet (SDS).\"\n-   **Contracts & Vendors:** Documents titled \"Service Agreement,\" \"Vendor Contract,\" \"Scope of Work,\" \"Request for Proposal (RFP),\" and invoices from service providers (e.g., security, cleaning, waste management).\n-   **Building Systems & Assets:** Equipment manuals, warranty information, asset tags, serial numbers, blueprints, floor plans, and electrical/plumbing schematics.\n-   **Financial & Budgeting:** Terms like \"facilities budget,\" \"operating expense (OpEx),\" \"capital expenditure (CapEx),\" \"utility costs,\" \"cost estimate,\" and specific invoices for utilities or repairs.\n-   **Security & Access:** Information related to \"access control,\" \"key management,\" \"security system,\" \"CCTV,\" \"visitor log,\" and security incident reports.\n-   **Project Management:** Documents for \"renovation,\" \"construction,\" \"tenant improvement,\" including project timelines, bids, and progress reports.\n\n#### Information to Ignore (Noise):\n-   Human Resources documents like employee performance reviews, payroll, and benefits administration.\n-   Marketing materials, sales reports, and customer relationship data.\n-   Company-wide financial reports, profit and loss statements, and shareholder information (unless it's a specific facilities budget report).\n-   IT-specific documents like software code, network architecture, or cybersecurity policies that don't relate to physical infrastructure.\n-   Legal documents unrelated to property, leasing, or vendor contracts (e.g., intellectual property patents).\n-   Department-specific operational memos that do not involve physical space or facility services."
}