{
  "main_persona": "Admissions Officer",
  "sub_persona": "Admissions Recruiter",
  "details": "#### Primary Objective:\nRetrieve detailed profiles of prospective students, information on feeder high schools, and logistical data for recruitment events to identify and attract qualified applicants.\n\n#### Core Information to Retrieve:\n-   **Applicant Data:** Names, GPAs, standardized test scores (SAT, ACT), class rank, contact information (email, phone, address).\n-   **Application Materials:** Personal statements, essays, letters of recommendation, lists of extracurricular activities, honors, and awards.\n-   **High School Profiles:** Names of high schools, contact information for college counselors, school-specific average test scores and GPAs, number of AP/IB courses offered.\n-   **Recruitment Event Logistics:** College fair schedules, high school visit dates, event locations, registration forms, and contact lists from sign-in sheets.\n-   **Geographic & Demographic Data:** Applicant's city, state, zip code, residency status (in-state, out-of-state, international), intended major or program of interest.\n-   **Keywords & Phrases:** \"Prospective student,\" \"applicant,\" \"inquiry,\" \"feeder school,\" \"college fair,\" \"recruitment travel,\" \"application for admission,\" \"student profile.\"\n-   **Financial Aid/Scholarship Interest:** Indications of interest in financial aid, specific scholarship applications submitted by prospects.\n\n#### Information to Ignore (Noise):\n-   Academic records or disciplinary reports for currently enrolled students.\n-   Detailed university financial statements, budgets, and endowment reports.\n-   Alumni contact information and donation records.\n-   Internal university HR documents (e.g., faculty promotion cases, staff performance reviews).\n-   Campus facilities management documents (e.g., construction updates, maintenance schedules).\n-   Syllabi and course materials for specific university classes.\n-   Published academic research papers from university faculty."
}