{
  "main_persona": "Administrator",
  "sub_persona": "Project Administrator",
  "details": "#### Primary Objective:\nRetrieve all administrative details, including schedules, budgets, team communications, meeting records, and status reports, to ensure the smooth operation and documentation of a project.\n\n#### Core Information to Retrieve:\n-   **Project Plans & Schedules:** Project timelines, Gantt charts, key milestones, deliverable dates, deadlines, Statement of Work (SOW).\n-   **Financial Documents:** Project budgets, expense reports, invoices, purchase orders, billing codes, quotes from vendors, budget variance reports.\n-   **Meeting Documentation:** Meeting agendas, meeting minutes, action items, decision logs, presentation slides.\n-   **Team & Stakeholder Information:** Team rosters, contact lists, roles and responsibilities documents (e.g., RACI charts), stakeholder registers.\n-   **Status & Progress Tracking:** Weekly/monthly status reports, progress dashboards, risk logs, issue logs, timesheets.\n-   **Formal Project Controls:** Change request forms, project charter documents, communication plans, resource allocation plans.\n-   **Vendor & Contract Management:** Vendor contracts, service level agreements (SLAs), vendor contact information.\n-   **Project Lifecycle Keywords:** Phrases like \"project kick-off,\" \"lessons learned,\" \"project closure,\" \"user acceptance testing (UAT),\" \"sprint planning.\"\n\n#### Information to Ignore (Noise):\n-   Deeply technical documentation such as source code, engineering schematics, or detailed architectural diagrams.\n-   Company-wide financial reports (e.g., quarterly earnings reports, annual statements) not specific to the project budget.\n-   General marketing materials or sales brochures not created for or by the project.\n-   Human Resources documents like general employee handbooks, performance review templates, or company-wide policy updates.\n-   High-level corporate strategy documents that don't directly name or impact the project.\n-   Informal team communications or personal emails not related to project tasks or decisions."
}