{
  "main_persona": "Admissions Officer",
  "sub_persona": "Transfer Admissions Officer",
  "details": "#### Primary Objective:\nRetrieve all information related to transfer admission requirements, course equivalency policies, and articulation agreements to evaluate transfer applicants.\n\n#### Core Information to Retrieve:\n-   **Transfer Policies:** Keywords like \"transfer credit policy,\" \"transfer admission requirements,\" \"transfer eligibility,\" \"credit evaluation.\"\n-   **Course Equivalency Data:** Phrases like \"course equivalency,\" \"course-to-course,\" \"transfer guide,\" \"equivalent to,\" course codes from other institutions (e.g., \"MTH 155 at NVCC\").\n-   **Articulation Agreements:** The full text of documents titled or containing \"articulation agreement,\" \"transfer agreement,\" or \"2+2 agreement\" with specific community colleges or universities.\n-   **Academic Records:** From applicant documents, extract: course codes, course titles, credit hours, grades, cumulative GPA, date of attendance, degree conferred (e.g., A.A., A.S.).\n-   **Program Prerequisites:** Lists of required courses for specific majors, especially phrases like \"prerequisites for nursing,\" \"required for admission to the business school.\"\n-   **Admissions Criteria:** Minimum GPA requirements, minimum number of completed credits, good academic standing status.\n-   **Deadlines:** \"Transfer application deadline,\" \"priority deadline for transfers,\" \"document submission deadline.\"\n-   **International Transfer specifics:** \"WES evaluation,\" \"course-by-course evaluation,\" \"TOEFL/IELTS score requirements for transfers.\"\n\n#### Information to Ignore (Noise):\n-   Information specific to first-year/freshman applicants (e.g., \"high school transcripts,\" \"SAT scores,\" \"ACT requirements,\" \"early action\").\n-   Information related to graduate school admissions (e.g., \"GRE scores,\" \"Master's program,\" \"Ph.D. applicant\").\n-   General student life information (e.g., campus event schedules, housing selection, dining hall menus).\n-   University financial reports, endowment data, or budget documents.\n-   Alumni relations and fundraising materials.\n-   Faculty research, publications, and internal departmental memos."
}