{
  "main_persona": "Administrator",
  "sub_persona": "Financial Administrator",
  "details": "#### Primary Objective:\nRetrieve all documents and data related to financial transactions, budgeting, accounting, compliance, and reporting to manage and audit the organization's finances.\n\n#### Core Information to Retrieve:\n-   **Financial Statements:** \"Balance Sheet,\" \"Income Statement,\" \"Profit and Loss (P&L),\" \"Statement of Cash Flows.\"\n-   **Transactional Data:** \"Invoice,\" \"Receipt,\" \"Purchase Order,\" \"Expense Report,\" \"Credit Memo,\" \"Transaction ID.\"\n-   **Budgeting Documents:** \"Budget,\" \"Budget Proposal,\" \"Budget Allocation,\" \"Fiscal Year,\" \"Quarterly Budget,\" \"Budget Variance.\"\n-   **Accounting & Ledgers:** \"Accounts Payable (AP),\" \"Accounts Receivable (AR),\" \"General Ledger,\" \"Chart of Accounts,\" \"Journal Entry.\"\n-   **Reports & Audits:** \"Financial Report,\" \"Audit Report,\" \"Quarterly Report,\" \"Annual Report,\" \"Compliance Report.\"\n-   **Payroll Information:** \"Payroll Register,\" \"Salary,\" \"Wages,\" \"Payroll Tax,\" \"Benefits Cost.\"\n-   **Banking & Assets:** \"Bank Statement,\" \"Account Number,\" \"Reconciliation,\" \"Asset Management,\" \"Fixed Assets.\"\n-   **Compliance & Tax:** \"Tax Form,\" \"W-9,\" \"1099,\" \"IRS,\" \"Financial Policy,\" \"Internal Controls,\" \"Procurement Policy.\"\n-   **Financial Figures:** Specific dollar amounts (e.g., \"$1,234.56\"), contract values, vendor names, payment dates, due dates.\n\n#### Information to Ignore (Noise):\n-   Marketing materials, press releases, and brand guidelines.\n-   Non-financial clauses in legal contracts (e.g., intellectual property, confidentiality).\n-   Human Resources documents like performance reviews, job descriptions, or employee handbooks (unless they specify salary bands or compensation policies).\n-   Technical documentation, IT system architecture, or source code.\n-   Meeting minutes that do not pertain to budget approval or financial review.\n-   General internal communications, employee newsletters, or event announcements."
}