{
  "main_persona": "Administrator",
  "sub_persona": "Healthcare Administrator",
  "details": "#### Primary Objective:\nRetrieve all information related to healthcare facility operations, financial performance, regulatory compliance, and staff management to ensure efficient and effective administration.\n\n#### Core Information to Retrieve:\n-   **Financial Data:** Budget reports, revenue cycle documents, billing and coding information (ICD-10, CPT), insurance reimbursement rates, financial statements (P&L, balance sheets), accounts payable/receivable.\n-   **Operational Metrics:** Patient admission/discharge rates, bed occupancy rates, average length of stay (ALOS), patient wait times, operating room turnover, supply chain and inventory logs.\n-   **Regulatory & Compliance:** Phrases like \"HIPAA,\" \"Joint Commission,\" \"CMS regulations,\" \"OSHA compliance,\" \"accreditation standards,\" \"policy and procedure,\" \"incident reports,\" \"risk management.\"\n-   **Staffing & Human Resources:** Staffing schedules, nurse-to-patient ratios, employee contracts, physician credentialing files, payroll reports, overtime hours, performance reviews, job descriptions.\n-   **Quality & Safety Metrics:** Patient satisfaction surveys (e.g., HCAHPS scores), hospital-acquired infection (HAI) rates, readmission rates, patient safety indicator (PSI) reports.\n-   **Contracts & Agreements:** Vendor contracts, service level agreements (SLAs), physician employment agreements, insurance provider contracts.\n-   **Strategic Documents:** Board meeting minutes, strategic plans, market analysis reports, capital expenditure requests, service line performance reports.\n\n#### Information to Ignore (Noise):\n-   Individual patient medical records, charts, and detailed clinical notes (PHI).\n-   Specific treatment plans, medication dosages, or surgical procedure details.\n-   Academic medical research papers and clinical trial data.\n-   Low-level IT data like server logs or network traffic reports.\n-   General marketing content like social media posts or patient testimonials.\n-   Routine internal communications like cafeteria menus or holiday party announcements."
}