{
  "main_persona": "Administrator",
  "sub_persona": "IT Systems Administrator",
  "details": "#### Primary Objective:\nRetrieve technical specifications, configuration guides, troubleshooting procedures, and security protocols to effectively manage and maintain IT systems and networks.\n\n#### Core Information to Retrieve:\n-   **Hardware Specifications:** Server model numbers (e.g., \"Dell PowerEdge R740\"), component part numbers, network device models (e.g., \"Cisco Catalyst 9300\"), technical data sheets.\n-   **Software & OS Information:** Software names (\"VMware vSphere\", \"Windows Server 2022\", \"Active Directory\"), version numbers, patch notes, release information, license keys.\n-   **Configuration & Setup Guides:** Phrases like \"how to configure,\" \"setup instructions,\" \"installation guide,\" \"best practices,\" \"deployment steps.\"\n-   **Network Details:** IP addresses, subnet masks, VLAN IDs, firewall rules, port numbers, network diagrams, DNS records.\n-   **Troubleshooting & Error Codes:** Specific error messages, log file examples, knowledge base article numbers (KB), \"troubleshooting guide,\" \"common issues,\" \"error resolution.\"\n-   **Security Protocols:** Vulnerability details (CVE identifiers like \"CVE-2023-XXXX\"), security hardening guides, access control lists (ACLs), audit procedures, compliance checklists (e.g., SOC 2, ISO 27001).\n-   **Scripts & Commands:** Code snippets for PowerShell, Bash, Python; CLI commands for network devices; SQL queries.\n-   **Procedures & Policies:** Standard Operating Procedures (SOPs), backup schedules, disaster recovery plans (DRP), user account creation/deletion policies, maintenance windows.\n-   **Vendor & Support Information:** Technical support contact numbers, service level agreements (SLAs), warranty information, maintenance contracts.\n\n#### Information to Ignore (Noise):\n-   Marketing materials, product brochures, and sales presentations.\n-   Corporate financial reports, budget summaries, and expense reports (unless specifically for IT hardware/software procurement).\n-   Human Resources documents like employee handbooks, performance reviews, or general company policies (e.g., dress code).\n-   Press releases and company-wide newsletters.\n-   Legal contracts and terms of service (unless they specify technical SLAs or support terms).\n-   End-user training guides that don't contain technical configuration details."
}