{
  "main_persona": "Admissions Officer",
  "sub_persona": "Director of Admissions",
  "details": "#### Primary Objective:\nRetrieve all strategic data, high-level policies, and operational reports related to enrollment management, recruitment strategy, and admissions performance.\n\n#### Core Information to Retrieve:\n-   **Enrollment Funnel Data:** Keywords like \"inquiries,\" \"applicants,\" \"admitted students,\" \"yield rate,\" \"enrollment targets,\" \"matriculation,\" \"melt.\"\n-   **Strategic Documents:** Phrases such as \"recruitment plan,\" \"enrollment strategy,\" \"strategic enrollment management (SEM) plan,\" \"market analysis,\" \"competitor analysis.\"\n-   **Financial Data:** \"Admissions budget,\" \"financial aid allocation,\" \"scholarship budget,\" \"discount rate,\" \"net tuition revenue,\" \"cost per acquisition.\"\n-   **Admissions Policies:** \"Admissions criteria,\" \"evaluation rubric,\" \"holistic review policy,\" \"test-optional/test-blind policy,\" \"transfer credit policy,\" \"articulation agreements.\"\n-   **Performance Metrics:** Reports on \"recruitment territory performance,\" \"feeder school data,\" \"counselor activity reports,\" \"college fair ROI,\" \"digital marketing campaign results.\"\n-   **Demographic & Diversity Data:** \"Student demographics,\" \"geographic distribution,\" \"diversity and inclusion goals,\" \"first-generation students,\" \"underrepresented minority (URM) statistics.\"\n-   **Historical Trends:** \"Year-over-year comparison,\" \"5-year trends,\" \"historical enrollment data,\" \"application volume history.\"\n-   **Staff & Operations:** \"Staffing models,\" \"departmental goals,\" \"vendor contracts\" (for CRM, marketing, etc.), \"CRM dashboard reports.\"\n\n#### Information to Ignore (Noise):\n-   Individual student application materials (e.g., personal essays, specific recommendation letters, individual transcripts).\n-   Low-level logistical details (e.g., catering orders for info sessions, individual travel itineraries for counselors).\n-   General university academic information (e.g., detailed course syllabi, faculty research papers).\n-   Student life event announcements and campus activity calendars.\n-   General alumni relations updates and standard donation requests.\n-   Facilities management notices or campus construction updates."
}