{
  "main_persona": "Administrator",
  "sub_persona": "Compliance Administrator",
  "details": "#### Primary Objective:\nRetrieve all documents, policies, regulations, and procedures necessary to monitor, enforce, and report on organizational compliance with internal and external standards.\n\n#### Core Information to Retrieve:\n-   **Regulatory Keywords:** \"compliance,\" \"regulation,\" \"statute,\" \"governance,\" \"oversight,\" \"audit,\" \"risk management,\" \"policy.\"\n-   **Specific Laws & Acts:** \"Sarbanes-Oxley (SOX),\" \"HIPAA,\" \"GDPR,\" \"CCPA,\" \"OSHA,\" \"ADA,\" \"Anti-Money Laundering (AML),\" \"Know Your Customer (KYC).\"\n-   **Internal Policy Documents:** \"Code of Conduct,\" \"Employee Handbook,\" \"Standard Operating Procedure (SOP),\" \"Data Privacy Policy,\" \"Information Security Policy,\" \"Acceptable Use Policy.\"\n-   **Compliance Processes:** \"Risk assessment,\" \"internal audit report,\" \"compliance training,\" \"incident report,\" \"whistleblower policy,\" \"non-compliance,\" \"violation.\"\n-   **Dates & Versions:** Phrases like \"effective date,\" \"last revised,\" \"policy version,\" \"review cycle,\" \"submission deadline.\"\n-   **Governmental & Regulatory Bodies:** \"SEC,\" \"FTC,\" \"EPA,\" \"Department of Labor,\" \"FINRA,\" \"HHS.\"\n-   **Forms & Records:** \"Certification form,\" \"acknowledgement of receipt,\" \"training records,\" \"audit trail,\" \"compliance checklist.\"\n\n#### Information to Ignore (Noise):\n-   Marketing materials, press releases, and sales forecasts.\n-   Product development roadmaps and feature specifications.\n-   General financial data like quarterly earnings reports or stock performance (unless part of a specific financial compliance audit).\n-   Routine HR documents like performance reviews, recruiting materials, or benefits enrollment forms.\n-   Day-to-day operational communications and non-governance meeting minutes.\n-   Company social event announcements and general internal newsletters."
}