{
  "main_persona": "Admissions Officer",
  "sub_persona": "Admissions Coordinator (Operations)",
  "details": "#### Primary Objective:\nRetrieve all procedural, logistical, and technical information required to manage the student application lifecycle from submission to enrollment.\n\n#### Core Information to Retrieve:\n-   **Application Logistics:** Deadlines (Early Decision, Early Action, Regular Decision, Transfer), application fee amounts, fee waiver policies and codes.\n-   **Systems & Platforms:** Names of specific CRM/SIS software (e.g., \"Slate,\" \"Banner,\" \"Salesforce,\" \"PeopleSoft\"), mentions of \"Common Application,\" \"Coalition Application,\" \"application portal.\"\n-   **Document Processing:** Phrases like \"document imaging,\" \"transcript processing,\" \"data entry,\" \"file completion,\" \"document matching,\" \"application verification.\"\n-   **Required Materials:** Checklists and specifications for \"official transcript,\" \"letter of recommendation,\" \"school report,\" \"standardized test scores,\" \"English proficiency test\" (TOEFL, IELTS).\n-   **Operational Timelines:** \"Admissions cycle calendar,\" \"processing schedule,\" \"decision release date,\" \"enrollment deposit deadline,\" \"waitlist notification date.\"\n-   **Standardized Communications:** Templates or drafts for automated emails (\"application received,\" \"application incomplete,\" \"decision rendered\").\n-   **Data & Reporting:** Keywords like \"applicant pool,\" \"enrollment funnel,\" \"yield rate,\" \"incomplete applications report,\" \"daily processing statistics,\" and mentions of FERPA regulations.\n-   **Internal Procedures:** Contact lists for Registrar, Financial Aid, or IT; instructions for escalating technical issues; workflow charts.\n\n#### Information to Ignore (Noise):\n-   The qualitative content of student essays, personal statements, or letters of recommendation (the focus is on their presence/completeness, not their content).\n-   High-level recruitment strategy, marketing campaign analysis, or travel schedules for recruiters.\n-   Specific academic course descriptions, faculty research, or departmental news.\n-   General student life information (e.g., housing selection details, dining plans, student club events).\n-   Alumni engagement reports and fundraising materials.\n-   Broad university financial statements or budget allocations outside of the admissions office."
}