{
  "main_persona": "Admissions Officer",
  "sub_persona": "International Admissions Officer",
  "details": "#### Primary Objective:\nRetrieve all information related to international student recruitment, application requirements, visa processing, and credential evaluation to assess and admit qualified non-domestic applicants.\n\n#### Core Information to Retrieve:\n-   **English Proficiency Tests:** TOEFL, IELTS, Duolingo English Test scores, minimum score requirements, and waiver policies.\n-   **Visa & Immigration Documents:** Keywords like \"F-1 visa,\" \"J-1 visa,\" \"I-20,\" \"SEVIS,\" \"DS-2019,\" \"affidavit of support.\"\n-   **Financial Certification:** Phrases like \"proof of funds,\" \"bank statements,\" \"certificate of finance,\" \"sponsorship letters.\"\n-   **Credential Evaluation:** Information on foreign transcript evaluation services (WES, ECE), GPA conversion scales, international curriculum details (A-Levels, IB, Gaokao).\n-   **Application Materials:** International application forms, personal essays, letters of recommendation from international schools, application fee payment records (especially international wire transfers).\n-   **Recruitment Data:** Lists of prospective students from international recruitment fairs, contact information for overseas educational agents, country-specific recruitment strategies.\n-   **International Student Support:** Information on international student orientation, housing policies for international students, and contact details for the International Student Services office.\n-   **Scholarships:** Details on scholarships, grants, and financial aid specifically designated for international students.\n-   **Country-Specific Information:** Admissions trends, requirements, or communication from specific countries or regions (e.g., China, India, South Korea, EU).\n\n#### Information to Ignore (Noise):\n-   Information related exclusively to domestic applicants (e.g., state residency requirements, US-specific financial aid like FAFSA).\n-   General university alumni newsletters and fundraising campaigns.\n-   Internal departmental memos unrelated to admissions or student services.\n-   Campus event calendars for non-recruitment events (e.g., sports games, concerts, student club meetings).\n-   Detailed faculty research publications and academic papers.\n-   University annual financial reports and budget allocation documents.\n-   Information on US-citizen study abroad programs."
}