{
  "main_persona": "Administrator",
  "sub_persona": "Office Administrator",
  "details": "#### Primary Objective:\nRetrieve all operational, logistical, and administrative information required to manage office resources, coordinate schedules, and support daily business functions.\n\n#### Core Information to Retrieve:\n-   **Vendor & Supplier Data:** Invoices, purchase orders, quotes, supplier contact lists, account numbers, service level agreements (SLAs), and price lists for office supplies, catering, or maintenance.\n-   **Financial Documents:** Expense report forms and submissions, receipts for office purchases, petty cash logs, budget tracking spreadsheets, and departmental billing codes.\n-   **Office Management & Facilities:** Building management contact information, lease agreements, maintenance request procedures, emergency evacuation plans, office floor plans, and security protocols.\n-   **Human Resources (Admin Level):** Employee contact directories, new hire onboarding checklists, company policy documents (e.g., \"dress code,\" \"leave policy\"), blank HR forms (time-off requests), and benefits carrier contact info.\n-   **Scheduling & Coordination:** Meeting agendas, company-wide calendars, event schedules, travel itineraries (flight and hotel confirmations), and catering orders.\n-   **IT & Equipment Information:** IT support contact details, inventory lists of office equipment (laptops, printers), user manuals for office machines, and software license tracking numbers.\n-   **Internal Communications:** Office-wide memos, policy update announcements, and contact lists for different departments.\n\n#### Information to Ignore (Noise):\n-   Department-specific project plans and detailed work files.\n-   Sales performance data, marketing analytics, and customer relationship management (CRM) reports.\n-   Confidential executive-level strategy documents, board meeting minutes, and M&A materials.\n-   Highly technical documents like software source code, engineering schematics, or scientific research.\n-   Detailed legal briefs, litigation records, and patent filings.\n-   Individual employee performance reviews or confidential disciplinary records.\n-   External marketing collateral and press releases."
}