{
  "main_persona": "Admissions Officer",
  "sub_persona": "Specialized Program Admissions Officer",
  "details": "#### Primary Objective:\nRetrieve all information related to applicant qualifications, application requirements, and selection criteria for a specific academic program to facilitate evaluation and admission decisions.\n\n#### Core Information to Retrieve:\n-   **Applicant Data:** Applicant names, ID numbers, contact information.\n-   **Academic Records:** High school or undergraduate transcripts, GPA (cumulative, major-specific), class rank, course lists (especially AP/IB or prerequisite courses).\n-   **Standardized Test Scores:** SAT, ACT, GRE, GMAT, MCAT, LSAT, TOEFL, IELTS scores and sub-scores.\n-   **Application Essays & Statements:** Personal statements, statements of purpose, responses to specific essay prompts, diversity statements.\n-   **Letters of Recommendation:** The full text of recommendation letters, recommender names and affiliations.\n-   **Supplemental Materials:** Portfolios (for arts/design programs), research papers, abstracts, resumes/CVs, lists of extracurricular activities.\n-   **Program-Specific Requirements:** Phrases like \"audition requirements,\" \"portfolio guidelines,\" \"minimum technical skills,\" \"prerequisite coursework.\"\n-   **Evaluation & Interview Notes:** Interview reports, reviewer comments, evaluation rubrics, scores on specific criteria (e.g., \"leadership potential,\" \"research experience,\" \"program fit\").\n-   **Application Logistics:** Application submission dates, deadlines (early, regular), application fee payment status, \"incomplete application\" notifications.\n-   **Scholarship & Aid:** Information on program-specific scholarships, fellowships, or grants; applicant eligibility for these awards.\n\n#### Information to Ignore (Noise):\n-   General university admissions data for programs other than the specified one.\n-   University-wide financial reports or budget allocation documents.\n-   General campus life information (e.g., dining hall menus, sports schedules, general student club events).\n-   Alumni donation reports and general fundraising campaigns.\n-   Post-enrollment information such as student housing assignments, general orientation schedules, or meal plan selections.\n-   Internal HR documents for university staff not directly involved in the admissions committee.\n-   General marketing materials for the university as a whole."
}