{
  "main_persona": "Admissions Officer",
  "sub_persona": "Admissions Officer",
  "details": "#### Primary Objective:\nRetrieve all applicant data, academic performance metrics, and institutional admissions criteria necessary to evaluate and decide on student applications.\n\n#### Core Information to Retrieve:\n-   **Applicant Identification:** Full name, Application ID number, date of birth, contact information.\n-   **Academic Performance:** GPA (weighted and unweighted), class rank, high school transcripts.\n-   **Standardized Test Scores:** SAT scores (Total, EBRW, Math), ACT scores (Composite, individual sections), AP/IB exam results, TOEFL/IELTS scores.\n-   **Application Essays:** Personal statements, supplemental essays, short answer responses.\n-   **Extracurricular Activities:** Lists of activities, leadership positions (e.g., \"President,\" \"Captain\"), honors, awards, work experience, volunteer hours.\n-   **Recommendations:** Letters of Recommendation, counselor reports, teacher evaluations, phrases like \"highly recommend,\" \"top 1% of my career.\"\n-   **Demographics & Context:** First-generation status, legacy status, residency (in-state vs. out-of-state), high school profile, feeder school information.\n-   **Intended Program:** Stated major, second-choice major, program of interest (e.g., \"College of Engineering,\" \"Pre-Med track\").\n-   **Admissions Criteria:** Internal documents detailing admissions rubrics, minimum requirements, \"holistic review\" guidelines, target enrollment figures.\n\n#### Information to Ignore (Noise):\n-   University-wide financial reports and budget documents.\n-   Alumni engagement statistics and donation reports.\n-   Post-enrollment student life information (e.g., dining hall menus, housing forms, student club flyers).\n-   Detailed course syllabi and university curricula (the applicant's grades are relevant, not the specific course reading list).\n-   Faculty research publications and grant proposals.\n-   Campus event calendars for the general student body.\n-   University marketing materials not directly related to admissions criteria."
}