{
  "main_persona": "Architect",
  "sub_persona": "Architectural Project Manager",
  "details": "#### Primary Objective:\nRetrieve all project-specific documentation related to budgets, schedules, contracts, team communication, and regulatory compliance to ensure the successful execution of an architectural project.\n\n#### Core Information to Retrieve:\n-   **Project Schedules & Timelines:** Gantt charts, project timelines, critical path analyses, milestone dates (e.g., \"Schematic Design Complete,\" \"Permit Submittal,\" \"Construction Start\").\n-   **Financial Documents:** Project budgets, cost estimates, fee proposals, invoices, purchase orders, change orders, value engineering logs.\n-   **Contracts & Agreements:** Client contracts, consultant agreements (structural, MEP), contractor agreements, Scope of Work (SOW) documents.\n-   **Communication & Correspondence:** Meeting minutes, action items, decision logs, Requests for Information (RFIs), submittals, transmittals, official client correspondence.\n-   **Regulatory & Compliance:** Building permit applications, permit numbers, inspection reports, zoning code analysis, ADA compliance checklists, correspondence with the \"Authority Having Jurisdiction\" (AHJ).\n-   **Team & Contact Information:** Project team directories, client contact information, consultant and contractor contact lists.\n-   **Project Reporting:** Progress reports, site observation reports, field reports, punch lists.\n-   **Drawings & Specifications (Management View):** Drawing set lists, revision dates on title blocks, specification sections (by CSI MasterFormat number), material cut sheets referenced in submittals.\n\n#### Information to Ignore (Noise):\n-   General marketing materials for the architectural firm (portfolios, brochures).\n-   Superseded drawing sets or early conceptual design sketches that are no longer current.\n-   Internal firm-wide administrative documents (e.g., HR policies, IT memos, company newsletters).\n-   Detailed engineering calculations (e.g., raw structural analysis data); focus on the summary reports and drawings.\n-   Vendor marketing spam or unsolicited product catalogs.\n-   Software manuals or tutorials for CAD, BIM, or other design tools.\n-   Drafts of documents where a final, executed version exists."
}