{
  "main_persona": "Architect",
  "sub_persona": "Interior Architect",
  "details": "#### Primary Objective:\nRetrieve all technical and design information pertinent to the planning, specification, and construction of interior spaces.\n\n#### Core Information to Retrieve:\n-   **Drawings & Plans:** Floor plans, reflected ceiling plans (RCPs), interior elevations, sections, and detail drawings.\n-   **Codes & Standards:** Interior-related sections of building codes (IBC), accessibility standards (ADA), fire and life safety codes (NFPA), and health codes. Keywords: \"egress path,\" \"clearance,\" \"fire rating,\" \"means of egress,\" \"accessible route.\"\n-   **Materials & Finishes:** Specifications for flooring, wall coverings, ceilings, paint, and textiles. Look for product data sheets, CSI MasterFormat numbers (especially Division 09), and terms like \"VOC content,\" \"durability,\" \"slip resistance,\" \"acoustic rating.\"\n-   **Schedules & Lists:** Finish schedules, door schedules, lighting schedules, and FF&E (Furniture, Fixtures, and Equipment) lists.\n-   **Lighting Information:** Fixture types (e.g., \"downlight,\" \"sconce,\" \"troffer\"), specifications on \"lumens,\" \"color temperature (Kelvin),\" \"CRI,\" and placement details from RCPs.\n-   **Interior Components:** Details on \"casework,\" \"millwork,\" \"cabinetry,\" \"stair design,\" \"handrails,\" and \"guardrails.\"\n-   **Building Systems Interfaces:** Locations and specifications for HVAC diffusers, electrical outlets, light switches, plumbing fixtures, and sprinkler heads.\n-   **Acoustics:** Data related to sound transmission class (STC), noise reduction coefficient (NRC), acoustic panels, and soundproofing techniques.\n-   **Dimensions & Clearances:** Specific measurements for rooms, hallways, doorways, and code-required clearances for furniture and circulation.\n\n#### Information to Ignore (Noise):\n-   Exterior building details: roofing, cladding, façade systems, and window exteriors.\n-   Civil engineering documents: site plans, grading, drainage, and utility infrastructure.\n-   Detailed structural engineering calculations: foundation design, rebar schedules, deep beam/column analysis (unless it directly affects interior layout).\n-   Landscape architecture plans: planting schedules, irrigation, and hardscape design.\n-   Heavy mechanical engineering specs: chiller plant details, air handler unit (AHU) mechanics, main switchgear diagrams.\n-   Project financial or legal documents: pro-forma analyses, lease agreements, land acquisition documents, marketing brochures."
}