{
  "main_persona": "Architect",
  "sub_persona": "Sustainable Design Architect",
  "details": "#### Primary Objective:\nRetrieve technical data, material specifications, design strategies, and certification standards related to designing and constructing environmentally sustainable and energy-efficient buildings.\n\n#### Core Information to Retrieve:\n-   **Green Building Certifications:** Keywords like \"LEED,\" \"BREEAM,\" \"Passivhaus,\" \"WELL Building Standard,\" \"Living Building Challenge,\" \"Green Globes,\" and specific criteria or points associated with them (e.g., \"LEED v4.1,\" \"BREEAM credit\").\n-   **Sustainable Materials:** Phrases like \"recycled content,\" \"reclaimed materials,\" \"low-VOC\" (Volatile Organic Compounds), \"bio-based materials,\" \"locally sourced,\" \"cradle-to-cradle.\"\n-   **Material Lifecycles:** Data from \"Life Cycle Assessment\" (LCA), \"Environmental Product Declaration\" (EPD), and \"Health Product Declaration\" (HPD).\n-   **Energy Efficiency:** Terms like \"net-zero energy,\" \"energy modeling,\" \"building envelope performance,\" \"R-value,\" \"U-value,\" \"air tightness,\" \"thermal bridging.\"\n-   **Renewable Energy Systems:** Information on \"photovoltaic (PV) arrays,\" \"geothermal systems,\" \"solar thermal,\" \"building-integrated photovoltaics (BIPV).\"\n-   **Passive Design Strategies:** Concepts such as \"passive solar design,\" \"daylighting,\" \"natural ventilation,\" \"cross-ventilation,\" \"solar orientation,\" \"shading strategies.\"\n-   **Water Conservation:** Keywords like \"rainwater harvesting,\" \"greywater recycling,\" \"blackwater treatment,\" \"low-flow fixtures,\" \"xeriscaping,\" \"permeable paving.\"\n-   **Healthy Buildings:** Information on \"indoor air quality (IAQ),\" \"biophilic design,\" \"non-toxic materials,\" \"natural light.\"\n-   **High-Performance Systems:** Specifications for \"high-efficiency HVAC,\" \"heat recovery ventilation (HRV),\" \"energy recovery ventilator (ERV),\" \"LED lighting.\"\n-   **Site & Ecology:** Data on \"site impact,\" \"heat island effect,\" \"habitat restoration,\" \"green roofs,\" \"living walls.\"\n-   **Codes & Standards:** References to \"ASHRAE 90.1,\" \"International Green Construction Code (IgCC),\" and local energy codes.\n\n#### Information to Ignore (Noise):\n-   Specifications for conventional, non-sustainable building materials (e.g., standard vinyl, untreated virgin timber, high-VOC paints) unless being used in a comparative analysis.\n-   General project financial data like overall budgets or standard pro-formas, unless they specifically analyze the ROI or cost-benefit of sustainable features.\n-   Purely aesthetic or historical architectural analysis that does not relate to sustainable performance or passive design principles.\n-   Standard construction project management documents (e.g., generic meeting minutes, RFIs) that do not address sustainability goals.\n-   Marketing brochures for real estate developments that lack specific technical data or performance metrics.\n-   Detailed structural engineering calculations that have no bearing on material efficiency or embodied carbon."
}