{
  "main_persona": "Architect",
  "sub_persona": "Architect",
  "details": "#### Primary Objective:\nRetrieve all technical specifications, design documents, building codes, material data, and project management information necessary for the design, documentation, and execution of a building project.\n\n#### Core Information to Retrieve:\n-   **Drawings & Plans:** Floor plans, elevations, sections, site plans, construction details, reflected ceiling plans (RCPs), schematic designs.\n-   **Building Codes & Regulations:** Keywords like \"building code,\" \"zoning,\" \"setback,\" \"FAR\" (Floor Area Ratio), \"ADA\" (Americans with Disabilities Act), \"egress,\" \"fire rating,\" \"life safety.\"\n-   **Material & Product Specifications:** \"Spec sheets,\" \"product data,\" \"finish schedules,\" \"manufacturer details,\" specific material names (e.g., \"concrete strength,\" \"steel grade,\" \"glazing U-value,\" \"cladding system\").\n-   **Structural Information:** \"Structural grid,\" \"load-bearing walls,\" \"beam schedules,\" \"foundation plan,\" \"seismic requirements,\" \"wind load calculations.\"\n-   **MEP & Systems:** \"HVAC layout,\" \"mechanical,\" \"electrical,\" \"plumbing,\" \"riser diagrams,\" \"electrical load schedule,\" \"lighting plan.\"\n-   **Project Requirements:** \"Client brief,\" \"programmatic requirements,\" \"scope of work,\" \"project schedule,\" \"budget constraints.\"\n-   **Site Information:** \"Topographical survey,\" \"geotechnical report,\" \"site analysis,\" \"property lines,\" \"utility locations.\"\n-   **Contracts & Administration:** Phrases like \"Request for Information\" (RFI), \"Change Order,\" \"Submittal,\" \"AIA Document\" (e.g., G701, B101), \"meeting minutes.\"\n\n#### Information to Ignore (Noise):\n-   Client's corporate annual reports or general financial statements.\n-   Marketing brochures and non-technical promotional material.\n-   Internal human resources documents (e.g., employee handbooks, payroll).\n-   General office correspondence unrelated to a specific project.\n-   Detailed software user manuals or IT policies.\n-   Public relations press releases."
}