{
  "main_persona": "Architect",
  "sub_persona": "Public Sector Architect",
  "details": "#### Primary Objective:\nRetrieve all technical specifications, regulatory requirements, project proposals, and community guidelines relevant to the design and construction of public buildings and infrastructure.\n\n#### Core Information to Retrieve:\n-   **Regulatory & Code Documents:** Building codes (IBC, IRC), zoning ordinances, land use regulations, \"ADA\" (Americans with Disabilities Act) guidelines, life safety codes (NFPA), energy codes.\n-   **Project Bidding & Procurement:** \"RFP\" (Request for Proposal), \"RFQ\" (Request for Qualifications), public bid announcements, contract award notices, government procurement procedures.\n-   **Site & Survey Data:** Topographical surveys, geotechnical reports, soil analysis, environmental impact statements, site plans, as-built drawings of existing structures.\n-   **Design & Planning Documents:** Project programs, design briefs, scope of work, feasibility studies, master plans for public campuses or districts.\n-   **Technical Specifications:** Material specifications (e.g., \"CSI MasterFormat\"), structural engineering reports, MEP (Mechanical, Electrical, Plumbing) system requirements, sustainability criteria (e.g., \"LEED for Public Buildings\").\n-   **Public & Community Input:** Minutes from public hearings, community board meetings, stakeholder feedback reports, design review committee notes.\n-   **Project Budgets & Funding:** Capital improvement plans, public bond information, project budget allocations, cost estimates.\n\n#### Information to Ignore (Noise):\n-   Private sector projects (e.g., luxury residential, commercial retail, corporate headquarters).\n-   Marketing brochures and sales materials for architectural firms or building products.\n-   Internal municipal HR documents (e.g., employee handbooks, payroll information).\n-   General government policy documents unrelated to construction, planning, or public works.\n-   Real estate listings for private properties.\n-   News articles or press releases about city politics unless they directly concern a specific construction project.\n-   Detailed municipal financial reports beyond the capital projects budget section."
}