{
  "main_persona": "Architect",
  "sub_persona": "Residential Architect",
  "details": "#### Primary Objective:\nRetrieve all technical specifications, design guidelines, building codes, and project-related data necessary for designing and executing residential architecture projects.\n\n#### Core Information to Retrieve:\n-   **Design & Planning:** Floor plans, elevations, sections, site plans, design briefs, \"programmatic requirements,\" \"schematic design.\"\n-   **Codes & Regulations:** \"International Residential Code (IRC),\" local building codes, zoning ordinances, setback requirements, \"energy code,\" fire safety standards, accessibility guidelines (ADA).\n-   **Materials & Products:** Product specifications (\"spec sheets\"), manufacturer names, material types (e.g., \"cross-laminated timber,\" \"ICF,\" \"quartz\"), window and door schedules, finish schedules.\n-   **Structural Information:** Foundation plans, framing diagrams, load calculations, structural engineering reports, soil reports.\n-   **MEP Systems:** HVAC (Heating, Ventilation, Air Conditioning) layouts, plumbing schematics (riser diagrams), electrical plans, lighting fixture specifications.\n-   **Construction Documents:** Construction details, \"wall assembly,\" \"roof detail,\" waterproofing methods, \"shop drawings.\"\n-   **Project Management & Contracts:** \"AIA contracts,\" \"Owner-Architect Agreement,\" \"scope of work,\" project schedules, cost estimates, budgets, \"change orders.\"\n-   **Permitting & Administration:** Building permit applications, inspection reports, meeting minutes, RFIs (Requests for Information).\n\n#### Information to Ignore (Noise):\n-   Information related to commercial, industrial, or institutional architecture (e.g., \"office tower,\" \"retail space,\" \"hospital design,\" \"factory layout\").\n-   Large-scale urban planning documents and transportation infrastructure plans.\n-   Real estate marketing materials, property listings, and sales brochures.\n-   Corporate financial reports, investor relations documents, and stock performance.\n-   General company HR policies, payroll information, or employee handbooks.\n-   Theoretical academic papers on architectural philosophy or history unless directly related to residential styles."
}