{
  "main_persona": "Architect",
  "sub_persona": "Landscape Architect",
  "details": "#### Primary Objective:\nRetrieve all technical specifications, site plans, planting guides, material options, and regulatory requirements necessary for designing and executing landscape architecture projects.\n\n#### Core Information to Retrieve:\n-   **Site Analysis & Survey Data:** Topographic maps, contour lines, property boundaries, easements, geotechnical reports, soil analysis, hydrology reports, and locations of existing utilities (water, gas, electric).\n-   **Grading and Drainage:** Phrases like \"grading plan,\" \"spot elevations,\" \"slope analysis,\" \"drainage patterns,\" \"catch basin,\" \"swale,\" and \"stormwater management.\"\n-   **Planting & Horticulture:** Plant schedules, botanical and common names, planting details, soil specifications, tree preservation plans, and terms like \"native species,\" \"drought tolerant,\" and \"hardiness zone.\"\n-   **Irrigation Systems:** Irrigation plans, head types, drip line specifications, controller locations, and water conservation techniques.\n-   **Hardscape Materials & Construction:** Specifications for pavers, concrete, stone, wood, and metal. Construction details for retaining walls, pathways, patios, decks, and pergolas.\n-   **Site Furnishings & Lighting:** Details on benches, trash receptacles, bike racks, and bollards. Exterior lighting plans, fixture specifications, and photometrics.\n-   **Regulatory & Code Compliance:** ADA (Americans with Disabilities Act) guidelines for accessible routes, zoning ordinances, land use codes, setback requirements, and permitting documents.\n-   **Architectural Plans:** Site plans, building footprints, exterior elevations, and first-floor plans to understand the relationship between the building and the surrounding landscape.\n\n#### Information to Ignore (Noise):\n-   Detailed interior architectural plans (e.g., interior room layouts, finish schedules).\n-   Internal building systems schematics (e.g., HVAC, interior plumbing, electrical wiring diagrams).\n-   Structural engineering details for the main building's frame or foundation (unless directly interfacing with landscape elements).\n-   Marketing materials, sales brochures, or real estate listings.\n-   Financial pro-formas, investor relations documents, and project budgets.\n-   Interior design mood boards and furniture selection."
}