{
  "main_persona": "Art Director",
  "sub_persona": "Experiential Art Director",
  "details": "#### Primary Objective:\nRetrieve all information related to spatial design, fabrication, technology integration, and brand guidelines to conceptualize and execute immersive brand experiences.\n\n#### Core Information to Retrieve:\n-   **Spatial & Environmental Information:** Floor plans, site plans, venue maps, blueprints, CAD files, architectural renderings, dimensions, square footage, ceiling height.\n-   **Brand Identity Assets:** Brand guidelines, style guides, logo usage, color palettes (Pantone, CMYK, HEX), typography, key art.\n-   **Creative & Conceptual Documents:** Creative briefs, mood boards, campaign concepts, target audience descriptions, narrative flow.\n-   **Production & Fabrication Details:** Material specifications (e.g., \"acrylic,\" \"vinyl,\" \"scrim,\" \"plywood\"), fabrication techniques (\"3D printing,\" \"CNC,\" \"laser cutting\"), production timelines, run-of-show.\n-   **Technology Specifications:** AV (audio-visual) lists, projector specs, screen types, lighting plots, DMX channels, interactive technology terms (\"RFID,\" \"motion sensor,\" \"touch screen,\" \"AR/VR\").\n-   **Vendor & Budget Information:** Vendor quotes, supplier contacts, fabricator lists, budget line items for scenic, lighting, and AV.\n-   **Key Phrases:** \"Experiential marketing,\" \"brand activation,\" \"immersive installation,\" \"pop-up,\" \"environmental design,\" \"event flow.\"\n\n#### Information to Ignore (Noise):\n-   Company-wide financial reports, P&L statements, or shareholder information not related to the project budget.\n-   Internal HR documents, employee performance reviews, or general corporate policies.\n-   Post-event sales data or marketing analytics that don't pertain to the creative execution.\n-   Backend server architecture, IT infrastructure documentation, or data security policies.\n-   PR press clippings or media value reports.\n-   Logistical details like catering menus, staff travel itineraries, or non-production-related shipping manifests."
}