{
  "main_persona": "Art Director",
  "sub_persona": "Brand Art Director",
  "details": "#### Primary Objective:\nRetrieve all documents, assets, and guidelines related to the brand's visual identity to direct and maintain a consistent and compelling aesthetic across all marketing and communication materials.\n\n#### Core Information to Retrieve:\n-   **Brand Guidelines & Style Guides:** Documents defining logo usage, color palettes (Pantone, CMYK, RGB, Hex codes), typography (primary/secondary fonts, hierarchy), iconography, and photography/illustration styles.\n-   **Visual Assets:** Specific mentions of logo files, approved image libraries, stock photography licenses, icon sets, and official templates (e.g., for presentations, social media).\n-   **Creative & Project Briefs:** Documents outlining campaign goals, target audience, key messaging, deliverables, and project specifications.\n-   **Conceptual Materials:** Mood boards, storyboards, style scapes, and concept art for past, current, and future projects.\n-   **Layout & Composition:** Grid systems, spacing rules, wireframes, and layout specifications for web, print, and digital media.\n-   **Vendor & Freelancer Information:** Contact details and contracts for photographers, illustrators, creative agencies, and printers.\n-   **Feedback & Approvals:** Notes, comments, and sign-offs on creative work from stakeholders, clients, or legal teams (phrases like \"client feedback,\" \"revisions requested,\" \"final approval\").\n-   **Market Research:** Reports on brand perception, competitor visual analysis, and target audience visual preferences.\n\n#### Information to Ignore (Noise):\n-   Detailed financial reports (e.g., P&L statements, shareholder reports).\n-   Human Resources documents like payroll, employee benefits, or non-creative job descriptions.\n-   Technical IT documentation, server logs, or backend code.\n-   Logistics, supply chain, and non-packaging manufacturing data.\n-   Sales spreadsheets and raw customer data from CRMs.\n-   Internal administrative memos unrelated to creative projects (e.g., office maintenance, company-wide IT updates)."
}