{
  "main_persona": "Art Director",
  "sub_persona": "Packaging Art Director",
  "details": "#### Primary Objective:\nRetrieve all visual guidelines, technical specifications, regulatory requirements, and project assets necessary to design and produce product packaging.\n\n#### Core Information to Retrieve:\n-   **Creative & Design Briefs:** Documents defining project scope, target audience, key messaging, objectives, and mandatories.\n-   **Brand Guidelines:** Keywords like \"brand standards,\" \"style guide,\" \"logo usage,\" \"color palette\" (CMYK, Pantone values), \"typography,\" \"brand voice,\" \"visual identity.\"\n-   **Technical Specifications:** Phrases like \"dieline,\" \"keyline,\" \"print specs,\" \"substrate,\" \"material,\" \"finishing\" (e.g., \"emboss,\" \"deboss,\" \"foil stamp,\" \"spot UV,\" \"matte varnish\").\n-   **Regulatory & Legal Copy:** \"Nutrition facts,\" \"ingredient list,\" \"warning labels,\" \"barcode requirements,\" \"UPC,\" \"QR code placement,\" \"copyright/trademark notices.\"\n-   **Content & Assets:** \"Copy deck,\" \"product name,\" \"tagline,\" \"product descriptions,\" \"logo files\" (EPS, AI), \"product photography,\" \"approved illustrations.\"\n-   **Project Management Details:** \"Production timelines,\" \"press check schedule,\" \"proofing process,\" \"supplier contacts,\" \"printer specifications.\"\n-   **Market Research & Inspiration:** \"Mood boards,\" \"competitive analysis,\" \"packaging trends,\" \"unboxing experience.\"\n\n#### Information to Ignore (Noise):\n-   Corporate financial reports (e.g., quarterly earnings, annual reports).\n-   Human Resources documents (e.g., employee handbooks, benefits information, org charts).\n-   General marketing campaign analytics (e.g., social media metrics, web SEO reports).\n-   Internal IT support documents and policies.\n-   Building maintenance and facility management reports.\n-   Raw material supply chain and logistics documentation not related to print production."
}