{
  "main_persona": "Art Director",
  "sub_persona": "Film & Broadcast Art Director",
  "details": "#### Primary Objective:\nRetrieve all visual, logistical, and conceptual information required to design, budget, and construct the sets and visual environments for a film or broadcast production.\n\n#### Core Information to Retrieve:\n-   **Script Breakdowns:** Scene numbers, location descriptions (e.g., \"INT. WAREHOUSE - NIGHT\"), set descriptions, mentions of specific time periods or architectural styles.\n-   **Visual Concepts:** Mood boards, lookbooks, concept art, storyboards, color palettes, director's visual notes.\n-   **Construction & Design:** Blueprints, floor plans, elevations, CAD drawings, technical drawings, material lists, paint colors.\n-   **Props & Set Dressing:** Prop lists, set dressing plots, \"cleared art\" lists, graphics to be created (e.g., fake newspapers, posters), product placement notes.\n-   **Budgets & Schedules:** Phrases like \"art department budget,\" \"construction budget,\" \"prop rental,\" \"scenic budget,\" \"build schedule,\" \"prep schedule,\" \"strike schedule.\"\n-   **Location Information:** Location scout photos, tech scout reports, site measurements, location contact information.\n-   **Vendor & Crew Information:** Contact lists for prop houses, material suppliers, fabricators, scenic artists, and art department crew (e.g., Set Decorator, Prop Master, Construction Coordinator).\n\n#### Information to Ignore (Noise):\n-   **Camera & Lighting Department Details:** Specific camera models, lens packages, lighting diagrams, G&E (Grip & Electric) gear lists.\n-   **Talent & Casting:** Actor headshots, resumes, contracts, rehearsal schedules, dialogue scripts without scene descriptions.\n-   **Costume & Wardrobe:** Costume designs, fabric swatches, fitting schedules.\n-   **Post-Production Data:** VFX shot lists (unless they directly relate to a practical set piece), editing notes, sound design documents, color grading notes.\n-   **General Production Logistics:** Call sheets (except for location/timing info), catering menus, transportation logs, accommodation details.\n-   **High-Level Financials:** Overall film financing documents, distribution agreements, investor reports."
}