{
  "main_persona": "Art Director",
  "sub_persona": "Gaming Art Director",
  "details": "#### Primary Objective:\nRetrieve all information related to visual style, artistic direction, asset creation pipelines, and team feedback to guide the game's aesthetic and art production process.\n\n#### Core Information to Retrieve:\n-   **Visual Direction & Concepts:** Keywords like \"art bible,\" \"style guide,\" \"mood board,\" \"concept art,\" \"color script,\" \"visual target,\" \"look and feel,\" \"aesthetic,\" \"art direction.\"\n-   **Asset Specifications:** Phrases like \"character design,\" \"environment art,\" \"prop list,\" \"VFX,\" \"UI/UX design,\" \"lighting,\" \"shader.\"\n-   **Technical Art & Pipeline:** Terms such as \"PBR materials,\" \"poly count,\" \"texture budget,\" \"draw calls,\" \"LODs\" (Level of Detail), \"rigging,\" \"animation,\" \"rendering pipeline,\" \"optimization.\"\n-   **Art Production & Management:** Keywords like \"art schedule,\" \"milestones,\" \"art backlog,\" \"scope,\" \"asset list,\" \"outsourcing.\"\n-   **Feedback & Critiques:** Phrases like \"art review,\" \"feedback,\" \"paintover,\" \"notes,\" \"revisions,\" \"approval,\" \"dailies.\"\n-   **Software & Tools:** Names of industry-standard software like \"Unreal Engine,\" \"Unity,\" \"Maya,\" \"Blender,\" \"ZBrush,\" \"Substance Painter,\" \"Photoshop.\"\n-   **Design & Narrative Context:** References in Game Design Documents (GDDs) or narrative outlines that describe characters, locations, or story moments that require visual representation.\n\n#### Information to Ignore (Noise):\n-   Detailed source code (C++, C#) not directly related to graphics, shaders, or rendering.\n-   Server architecture, database schemas, and netcode documentation.\n-   Audio files, music composition notes, and voice acting scripts.\n-   High-level corporate financial reports, sales data, and marketing analytics.\n-   General HR documents, company-wide administrative memos, and office logistics.\n-   Detailed QA bug reports for non-graphical issues (e.g., game logic, server crashes).\n-   Legal contracts and documents, unless they explicitly define art deliverables and IP rights."
}