{
  "main_persona": "Art Director",
  "sub_persona": "Motion Graphics Art Director",
  "details": "#### Primary Objective:\nRetrieve all information pertinent to visual design, animation principles, software workflows, project management, and creative direction specific to motion graphics production.\n\n#### Core Information to Retrieve:\n-   **Creative Briefs & Project Scopes:** \"Project brief,\" \"creative scope,\" \"deliverables,\" \"target audience,\" \"marketing objectives.\"\n-   **Visual Design Principles:** \"Color theory,\" \"typography,\" \"composition,\" \"visual hierarchy,\" \"mood board,\" \"style guide,\" \"brand guidelines.\"\n-   **Motion Graphics Principles:** \"Animation principles,\" \"keyframing,\" \"timing and pacing,\" \"ease in/out,\" \"squash and stretch,\" \"rigging,\" \"character animation,\" \"particle systems.\"\n-   **Software & Tools:** \"Adobe After Effects,\" \"Cinema 4D,\" \"Blender,\" \"Nuke,\" \"Unreal Engine,\" \"Unity,\" \"DaVinci Resolve,\" \"Octane Render,\" \"Redshift,\" \"Figma,\" \"Photoshop,\" \"Illustrator.\"\n-   **Technical Specifications:** \"Video codecs,\" \"resolutions (e.g., 1080p, 4K, 8K),\" \"aspect ratios,\" \"frame rates (e.g., 24fps, 30fps, 60fps),\" \"color spaces (e.g., sRGB, Rec. 709),\" \"file formats (e.g., .mov, .mp4, .exr, .obj, .fbx).\"\n-   **Production Workflow:** \"Storyboarding,\" \"animatic,\" \"pre-visualization,\" \"rendering pipeline,\" \"compositing,\" \"post-production,\" \"client feedback process,\" \"revision cycles.\"\n-   **Team Management & Roles:** \"Animator,\" \"3D artist,\" \"compositor,\" \"editor,\" \"sound designer,\" \"producer,\" \"workflow optimization,\" \"resource allocation.\"\n-   **Legal & Licensing:** \"Stock footage rights,\" \"music licensing,\" \"font licensing,\" \"copyright considerations,\" \"usage rights.\"\n-   **Industry Trends:** \"Motion graphics trends,\" \"visual effects innovations,\" \"XR/VR design,\" \"interactive design.\"\n-   **Budgeting & Timelines:** \"Production schedule,\" \"budget estimates,\" \"resource planning,\" \"project milestones.\"\n\n#### Information to Ignore (Noise):\n-   Static print design layouts and specifications (unless directly related to assets for motion).\n-   Detailed financial reports of non-creative businesses.\n-   Abstract academic papers on unrelated scientific or sociological topics.\n-   Information on unrelated industries (e.g., healthcare regulations, agricultural policy).\n-   Highly technical engineering schematics for physical products.\n-   General human resources policies not specific to creative roles or project-based work.\n-   News articles on general politics or economics without a direct impact on the creative industry."
}