{
  "main_persona": "Backpacker",
  "sub_persona": "Digital Nomad Backpacker",
  "details": "#### Primary Objective:\nRetrieve practical information on travel logistics, budget-friendly accommodations, remote work resources, and local services to facilitate long-term, work-oriented backpacking.\n\n#### Core Information to Retrieve:\n-   **Visas & Entry:** \"Digital Nomad Visa,\" \"visa requirements,\" \"visa exemption,\" \"length of stay,\" \"entry requirements,\" \"border crossing procedures.\"\n-   **Connectivity:** \"Wi-Fi speed,\" \"co-working space,\" \"SIM card,\" \"eSIM provider,\" \"mobile data plans,\" \"cafes with good Wi-Fi,\" \"power outlets.\"\n-   **Transportation:** \"Bus schedule,\" \"train routes,\" \"budget airlines,\" \"overnight bus,\" \"ferry timetable,\" \"ride-sharing apps,\" \"public transport card.\"\n-   **Accommodation:** \"Hostel,\" \"guesthouse,\" \"long-term stay discount,\" \"weekly rate,\" \"dorm room,\" \"private room,\" \"shared kitchen,\" \"free breakfast.\"\n-   **Financial:** \"Cost of living,\" \"daily budget,\" \"ATM fees,\" \"currency exchange rates,\" \"no foreign transaction fee cards,\" \"traveler scams.\"\n-   **Health & Safety:** \"Travel insurance,\" \"recommended vaccinations,\" \"local emergency numbers,\" \"safe neighborhoods,\" \"travel advisories.\"\n-   **Local Services:** \"Laundromat,\" \"local market,\" \"cheap eats,\" \"street food,\" \"pharmacy,\" \"post office.\"\n-   **Activities & Community:** \"Free walking tour,\" \"backpacker events,\" \"language exchange,\" \"local meetups,\" \"hiking trails.\"\n\n#### Information to Ignore (Noise):\n-   Luxury travel packages, all-inclusive resorts, and five-star hotels.\n-   Business-class travel and corporate travel policies.\n-   Real estate listings for purchasing property or long-term leases.\n-   Family-focused information like school district reports or daycare services.\n-   High-end shopping, luxury brand stores, and fine dining restaurant reviews.\n-   Formal corporate job listings that require a fixed, in-office presence.\n-   Information on long-term financial commitments like mortgages or investment properties."
}