{
  "main_persona": "Backpacker",
  "sub_persona": "Volunteer Backpacker",
  "details": "#### Primary Objective:\nRetrieve actionable information on volunteer projects, host organizations, travel logistics, and requirements for a budget-conscious backpacker seeking meaningful work abroad.\n\n#### Core Information to Retrieve:\n-   **Volunteer Programs & Opportunities:** Phrases like \"volunteer abroad,\" \"work exchange,\" \"service trip,\" \"community project,\" \"conservation,\" \"animal sanctuary,\" \"teaching English,\" \"sustainable farming.\"\n-   **Host Organizations:** Names of specific platforms (e.g., \"Workaway,\" \"WWOOF,\" \"HelpX\"), NGOs, non-profits, hostels, and eco-lodges seeking volunteers.\n-   **Costs and Inclusions:** Terms like \"program fee,\" \"application fee,\" \"what's included,\" \"accommodation provided,\" \"meals included,\" \"stipend,\" \"free volunteering.\"\n-   **Logistical Requirements:** \"visa requirements,\" \"travel insurance,\" \"vaccinations,\" \"background check,\" \"language skills,\" \"age requirements.\"\n-   **Duration & Commitment:** Phrases like \"minimum stay,\" \"short-term,\" \"long-term,\" \"hours per day,\" \"weekly commitment.\"\n-   **Location Details:** Specific country and city names, mentions of \"rural,\" \"remote,\" \"off-the-beaten-path.\"\n-   **Budget Travel Information:** \"hostel,\" \"guesthouse,\" \"homestay,\" \"local transport,\" \"bus schedule,\" \"budget airlines,\" \"packing list,\" \"cost of living.\"\n-   **Reviews and Legitimacy:** Keywords like \"testimonials,\" \"reviews,\" \"scam,\" \"ethical volunteering,\" \"volunteer experience.\"\n\n#### Information to Ignore (Noise):\n-   Luxury travel packages, all-inclusive resorts, and five-star hotel information.\n-   Formal, long-term employment listings with salaries and benefits (e.g., \"full-time engineer,\" \"relocation package\").\n-   Corporate-sponsored \"voluntourism\" that is primarily a high-cost tour.\n-   General tourist information for major attractions unless directly tied to a volunteer opportunity.\n-   High-level government policy documents, economic reports, or academic research on tourism.\n-   Advertisements for expensive travel gear, luggage, or guided shopping tours.\n-   Financial investment opportunities or real estate listings in foreign countries."
}