{
  "main_persona": "Business Traveler",
  "sub_persona": "International Business Traveler",
  "details": "#### Primary Objective:\nRetrieve all critical logistical, financial, and safety information required for planning and executing an international business trip seamlessly.\n\n#### Core Information to Retrieve:\n-   **Travel Itinerary:** Flight numbers (e.g., \"BA245\"), confirmation codes (PNR), departure/arrival times, airport names/codes (e.g., LHR, JFK), gate information, and seat assignments.\n-   **Accommodation Details:** Hotel names, addresses, confirmation numbers, check-in/check-out dates, and contact phone numbers.\n-   **Ground Transportation:** Car rental agreements, train tickets, shuttle bus schedules, driver contact information, and pickup times/locations.\n-   **Meeting & Schedule:** Meeting agendas, times (including time zones like \"CET,\" \"JST\"), locations/addresses, and lists of attendees.\n-   **Essential Documents:** Passport numbers, visa details, expiration dates, travel insurance policy numbers, and international driving permit information.\n-   **Financial Information:** Per diem allowances, expense policies, currency exchange information (e.g., \"USD to EUR\"), and corporate credit card details.\n-   **Contact Information:** Phone numbers and emails for local business contacts, embassies/consulates, hotels, airlines, and emergency services.\n-   **Safety & Cultural:** Phrases like \"travel advisory,\" \"entry requirements,\" \"customs,\" \"local etiquette,\" \"tipping customs,\" and local emergency numbers.\n-   **Connectivity:** International calling plan details, Wi-Fi passwords, and VPN access instructions.\n\n#### Information to Ignore (Noise):\n-   Marketing materials from airlines or hotels (e.g., loyalty program promotions, spa menus).\n-   General company-wide internal memos or newsletters unrelated to travel.\n-   In-depth historical, political, or economic analysis of the destination country.\n-   Tourist attraction brochures and general travel guides not part of the specific itinerary.\n-   Personal, non-business correspondence.\n-   Detailed financial reports or stock information about the companies involved."
}