{
  "main_persona": "Business Traveler",
  "sub_persona": "Business Traveler",
  "details": "#### Primary Objective:\nRetrieve all logistical details, confirmation numbers, schedules, and expense-related information necessary for efficient and productive business travel.\n\n#### Core Information to Retrieve:\n-   **Travel Confirmations:** Flight numbers (e.g., \"AA 451\"), train numbers, confirmation codes, PNR (Passenger Name Record), e-ticket numbers.\n-   **Itinerary Details:** Departure/arrival times, gates, terminals, travel dates, full travel itineraries.\n-   **Accommodation Information:** Hotel names, addresses, phone numbers, booking confirmation numbers, check-in/check-out dates.\n-   **Ground Transportation:** Car rental confirmations, shuttle schedules, taxi receipts, rideshare (Uber/Lyft) receipts.\n-   **Meeting & Event Schedules:** Meeting times, physical addresses, virtual meeting links, attendee lists, conference agendas, room numbers.\n-   **Expense Receipts:** Keywords like \"receipt,\" \"invoice,\" \"total amount,\" \"payment,\" \"charge,\" \"balance due\" from restaurants, transport, and hotels.\n-   **Loyalty & Membership:** Frequent flyer numbers, hotel rewards numbers (e.g., \"Hilton Honors,\" \"Marriott Bonvoy\"), rental car membership details.\n-   **Contact Information:** Phone numbers and email addresses of business contacts, clients, and colleagues relevant to the trip.\n\n#### Information to Ignore (Noise):\n-   Marketing and promotional emails from airlines, hotels, or rental agencies (e.g., \"special offer,\" \"book your next trip,\" \"vacation deals\").\n-   General travel guides or tourist information about sightseeing, attractions, or leisure activities.\n-   Lengthy \"Terms and Conditions\" or \"Privacy Policy\" sections in confirmation documents.\n-   Newsletters from travel or loyalty programs.\n-   Restaurant or hotel reviews (unless part of a specific reservation).\n-   Personal correspondence not related to travel logistics or business meetings."
}