{
  "main_persona": "Business Traveler",
  "sub_persona": "Academic/Research Business Traveler",
  "details": "#### Primary Objective:\nRetrieve all logistical, scheduling, and content-related information for academic conferences, research visits, and collaborations, while also gathering data required for expense reporting and reimbursement.\n\n#### Core Information to Retrieve:\n-   **Travel & Accommodation:** Flight itineraries, confirmation numbers (e.g., \"booking reference,\" \"PNR\"), train tickets, hotel booking details, rental car agreements, check-in/check-out times.\n-   **Conference & Meeting Schedules:** Phrases like \"conference agenda,\" \"program schedule,\" \"session track,\" \"panel discussion.\" Specific times, room numbers, and building locations for events.\n-   **Presentation & Research Content:** Details of personal presentations (time, location, title), abstracts of other relevant talks, poster session numbers, names of keynote speakers, and lists of attendees or presenters.\n-   **Financial & Reimbursement:** Receipts, invoices, per diem rates, travel authorization forms, grant numbers, funding codes, and university travel policies. Keywords: \"expense report,\" \"reimbursement,\" \"receipt for,\" \"invoice.\"\n-   **Networking & Collaboration:** Contact information for other researchers (email, institution), scheduled meeting times, agendas for collaborative meetings, networking reception details.\n-   **Logistical Details:** Registration confirmation emails, QR codes for badges, Wi-Fi passwords, shuttle bus schedules, campus or venue maps.\n\n#### Information to Ignore (Noise):\n-   Full-text research papers and lengthy academic articles (abstracts are okay).\n-   General tourist information, city guides, or restaurant advertisements (unless it is a receipt for reimbursement).\n-   Promotional materials and marketing brochures from conference sponsors or vendors.\n-   Unrelated university administrative documents (e.g., general faculty meeting minutes, student policy changes).\n-   Personal, non-trip-related financial documents (e.g., bank statements, pay stubs).\n-   Calls for papers or submission guidelines for future conferences."
}