{
  "main_persona": "Business Owner",
  "sub_persona": "Real Estate Investor / Developer",
  "details": "#### Primary Objective:\nRetrieve all actionable data related to property acquisition, development potential, financial viability, regulatory compliance, and market analysis to identify and execute profitable real estate ventures.\n\n#### Core Information to Retrieve:\n-   **Financial Metrics & Analysis:** \"Pro forma,\" \"Net Operating Income (NOI),\" \"Capitalization Rate\" (or \"Cap Rate\"), \"Internal Rate of Return (IRR),\" \"Cash on Cash Return,\" \"Debt Service Coverage Ratio (DSCR),\" \"Loan-to-Value (LTV).\"\n-   **Property & Transaction Documents:** \"Purchase and Sale Agreement (PSA),\" \"Letter of Intent (LOI),\" \"Title Report,\" \"Deed,\" \"Lease Agreement,\" \"Rent Roll,\" \"Tenant Roster.\"\n-   **Valuation & Market Data:** \"Appraisal,\" \"Comparable Sales\" (or \"Comps\"), \"Market Analysis,\" \"Vacancy Rate,\" \"Absorption Rate,\" \"Demographics,\" \"Traffic Counts,\" \"Rental Rates.\"\n-   **Zoning & Entitlements:** \"Zoning code,\" \"Land use designation,\" \"Permitted use,\" \"Variance,\" \"Conditional use permit,\" \"Entitlements,\" \"Easements,\" \"Covenants.\"\n-   **Development & Construction:** \"Site plan,\" \"Architectural drawings,\" \"Blueprints,\" \"Survey,\" \"Topographical map,\" \"Construction budget,\" \"Hard costs,\" \"Soft costs,\" \"Request for Proposal (RFP).\"\n-   **Due Diligence Reports:** \"Phase I Environmental Site Assessment (ESA),\" \"Property Condition Assessment (PCA),\" \"Geotechnical report,\" \"Feasibility study.\"\n-   **Property Identifiers:** Property addresses, \"Assessor's Parcel Number (APN),\" \"Lot number,\" \"Block number.\"\n-   **Key Phrases:** \"Value-add opportunity,\" \"Distressed asset,\" \"Off-market,\" \"Development potential,\" \"For sale,\" \"Available land.\"\n\n#### Information to Ignore (Noise):\n-   Individual residential tenant correspondence or personal information (beyond what's on a rent roll).\n-   Marketing materials for unrelated services (e.g., office supplies, corporate catering).\n-   Internal administrative documents of other firms (e.g., HR policies, holiday schedules).\n-   Low-level operational details like utility invoices or routine maintenance work orders unless summarized in an operating statement.\n-   General news or articles not directly related to real estate, finance, or local economic development.\n-   Highly technical engineering specifications for non-structural components (e.g., HVAC model numbers, IT network schematics).\n-   Press releases or marketing brochures that lack concrete financial data or property specifications."
}