{
  "main_persona": "Business Owner",
  "sub_persona": "Non-Profit Director",
  "details": "#### Primary Objective:\nRetrieve all information related to non-profit management, including fundraising, grant opportunities, donor relations, program impact, and board governance.\n\n#### Core Information to Retrieve:\n-   **Funding & Grants:** Phrases like \"grant opportunity,\" \"request for proposal (RFP),\" \"letter of inquiry (LOI),\" \"grant application deadline,\" \"foundation directory,\" \"corporate sponsorship.\"\n-   **Donor Information:** Donor lists, donation history, contact information for major donors, pledge forms, fundraising campaign results.\n-   **Financial Documents:** Budgets, expense reports, \"Form 990,\" financial statements, audit reports, \"statement of activities.\"\n-   **Governance:** \"Board of Directors meeting minutes,\" \"bylaws,\" \"conflict of interest policy,\" \"organizational chart,\" lists of board members.\n-   **Impact & Reporting:** \"Annual report,\" \"program outcomes,\" \"impact metrics,\" \"beneficiary statistics,\" \"community needs assessment,\" testimonials.\n-   **Legal & Compliance:** Information on \"501(c)(3) status,\" state registration requirements, compliance checklists.\n-   **Operations:** Volunteer recruitment and management plans, staff job descriptions, strategic plans, partnership agreements (MOU).\n\n#### Information to Ignore (Noise):\n-   For-profit business metrics like \"profit margin,\" \"shareholder value,\" \"earnings per share,\" or \"sales targets.\"\n-   Detailed, low-level operational data not relevant to executive oversight (e.g., individual IT support tickets, raw program data unless summarized in a report).\n-   Marketing materials from commercial vendors unless directly solicited.\n-   General news or political commentary unrelated to the non-profit's mission or funding environment.\n-   Routine internal administrative communications (e.g., office supply orders, scheduling for non-board meetings)."
}