{
  "main_persona": "Business Owner",
  "sub_persona": "Service-Based Business Owner (e.g., Agency, Consultancy)",
  "details": "#### Primary Objective:\nRetrieve all business-critical information related to client management, project execution, financial performance, and operational efficiency for a service-based company.\n\n#### Core Information to Retrieve:\n-   **Client & Sales Documents:** Contracts, Master Service Agreements (MSAs), Statements of Work (SOWs), proposals, quotes, and estimates.\n-   **Financial Data:** Invoices (sent and received), purchase orders, expense reports, Profit & Loss (P&L) statements, bank statements, and tax forms (W-9, 1099).\n-   **Project Management Information:** Project plans, timelines, deliverable lists, milestone trackers, meeting minutes, and status reports.\n-   **Key Phrases:** \"Scope of work,\" \"change order,\" \"accounts receivable,\" \"accounts payable,\" \"net profit,\" \"project budget,\" \"client approval.\"\n-   **Contact Information:** Client names, emails, phone numbers; subcontractor or freelancer contact details.\n-   **Legal & HR Documents:** Employee/contractor agreements, Non-Disclosure Agreements (NDAs), insurance policies (Liability, E&O), company handbooks, and resumes of key personnel.\n-   **Operational Details:** Software license agreements, subscription renewal dates, office lease agreements, and vendor contracts.\n-   **Strategic Documents:** Business plans, marketing strategies, competitor analysis, and case studies.\n\n#### Information to Ignore (Noise):\n-   Day-to-day internal communications from client companies not directly related to a project.\n-   Marketing brochures and unsolicited sales pitches from potential vendors.\n-   Superseded contract drafts or old, non-executed proposal versions.\n-   Low-level technical data like server logs or system error reports unless directly relevant to a client project.\n-   General industry news articles or market research reports not commissioned by the company.\n-   Employee's personal documents or non-work-related communications.\n-   Raw data files from analytics or testing unless summarized in a report."
}