{
  "main_persona": "Business Traveler",
  "sub_persona": "Field Service Business Traveler",
  "details": "#### Primary Objective:\nRetrieve all logistical, technical, and site-specific information required to travel to a client location and successfully complete a service or installation task.\n\n#### Core Information to Retrieve:\n-   **Travel Logistics:** Flight itineraries (confirmation numbers, flight numbers, times), hotel reservations (addresses, confirmation numbers), rental car bookings, train schedules.\n-   **Client & Site Information:** Client name, site address, GPS coordinates, on-site contact person (name, phone number, email), site access procedures, gate codes.\n-   **Work Orders & Service Tickets:** Job numbers, work order details, scope of work (SOW), task checklists, service level agreements (SLAs).\n-   **Technical Documentation:** Equipment manuals, installation guides, technical schematics, wiring diagrams, troubleshooting flowcharts, product specifications.\n-   **Part & Tool Lists:** Required part numbers, lists of necessary tools, equipment serial numbers, inventory lists.\n-   **Safety Procedures:** Site-specific safety protocols, Personal Protective Equipment (PPE) requirements, lockout/tagout (LOTO) procedures, safety data sheets (SDS).\n-   **Expense & Reporting:** Per diem rates, expense reporting policies, contact information for travel support or finance.\n-   **Previous History:** Notes from previous service calls to the same site, client service history, known issues.\n\n#### Information to Ignore (Noise):\n-   Company-wide financial reports, stock performance, or investor relations documents.\n-   Marketing materials, sales brochures, and product press releases.\n-   Human Resources documents like company-wide benefit plans, holiday party announcements, or org charts for unrelated departments.\n-   R&D documents for products not yet released.\n-   Internal company newsletters about employee promotions or general corporate news.\n-   Legal contracts or master service agreements (unless a specific clause is referenced in the work order)."
}