{
  "main_persona": "Business Traveler",
  "sub_persona": "Government/Diplomatic Traveler",
  "details": "#### Primary Objective:\nRetrieve all logistical, security, and mission-critical information necessary for the execution of official government or diplomatic travel.\n\n#### Core Information to Retrieve:\n-   **Travel Logistics:** Itineraries, flight numbers (e.g., \"UA 123\"), train tickets, hotel confirmations, ground transportation arrangements, booking reference numbers.\n-   **Security & Safety:** Phrases like \"security briefing,\" \"threat assessment,\" \"risk level,\" \"travel advisory,\" \"safe haven,\" \"evacuation plan,\" \"personnel recovery.\"\n-   **Official Contacts:** Embassy and consulate phone numbers, addresses, Regional Security Officer (RSO) contact, Control Officer details, foreign ministry contacts.\n-   **Mission Details:** \"Meeting agenda,\" \"briefing book,\" \"talking points,\" \"mission objectives,\" \"scope of work.\"\n-   **Diplomatic Protocol:** \"Order of precedence,\" \"forms of address,\" \"gift policy,\" official dress codes, cultural etiquette guides.\n-   **Official Documentation:** Visa requirements, passport information, \"country clearance\" cables, diplomatic notes, letters of invitation.\n-   **Personnel Information:** Biographies or \"bios\" of key foreign and domestic officials, lists of attendees.\n-   **Financial & Administrative:** \"Per diem rates,\" travel authorization numbers, expense reporting guidelines, travel voucher procedures.\n-   **Health & Medical:** Vaccination requirements, approved clinics or hospitals, emergency medical procedures, health alerts from CDC or WHO.\n\n#### Information to Ignore (Noise):\n-   General tourist information, sightseeing guides, and public restaurant reviews.\n-   Commercial advertisements, marketing materials, and hotel loyalty program details.\n-   Unrelated domestic government memos or general agency-wide announcements.\n-   Public news articles or media reports unless they are part of a specific press summary briefing.\n-   University research papers or academic studies not directly related to the mission topic.\n-   Internal financial reports of the host country's private companies.\n-   Social media feeds or informal event listings."
}