{
  "main_persona": "Business Traveler",
  "sub_persona": "Executive Business Traveler",
  "details": "#### Primary Objective:\nRetrieve all critical travel itineraries, accommodation details, meeting schedules, and client background information to ensure a smooth and productive executive business trip.\n\n#### Core Information to Retrieve:\n-   **Travel Itineraries:** Flight numbers (e.g., \"UA 1442\"), airline names, confirmation codes (PNR), departure/arrival times, gate and terminal information.\n-   **Ground Transportation:** Car rental agreements, train ticket details, car service confirmations including pickup times, driver contact info, and locations.\n-   **Accommodation Details:** Hotel names, addresses, phone numbers, confirmation numbers, check-in/check-out dates.\n-   **Meeting Schedules:** Dates, times, locations (addresses, room names), and attendee lists for all appointments.\n-   **Client Information:** Client names, company names, titles, contact information, briefing documents, and talking points.\n-   **Agendas & Presentations:** Meeting agendas, presentation slide decks, and supporting reports or data.\n-   **Expense & Financials:** Receipts, invoices, corporate credit card details (for reference), per diem information, and expense report policies.\n-   **Loyalty & Membership:** Frequent flyer numbers, hotel loyalty program numbers, Known Traveler Number (KTN) for TSA PreCheck/Global Entry, and executive lounge access details.\n-   **Reservations:** Dinner or event reservation confirmations, including time, location, and number of guests.\n\n#### Information to Ignore (Noise):\n-   General marketing and promotional content in confirmation emails (e.g., \"Book your next trip with us!\").\n-   Extensive terms and conditions or privacy policy text from airlines, hotels, or car rental agencies.\n-   Generic tourist information or city guides.\n-   Ancillary travel offers like travel insurance upsells or tour package ads.\n-   Internal company newsletters or mass emails not directly related to the trip's objectives.\n-   Low-level operational details, such as aircraft type or standard in-flight menu options.\n-   Expired itineraries or old reservation confirmations from past trips."
}