{
  "main_persona": "Business Traveler",
  "sub_persona": "Project-Based Business Traveler",
  "details": "#### Primary Objective:\nRetrieve all information pertinent to managing travel logistics, project-specific details, and maintaining productivity while on business trips for project-based work.\n\n#### Core Information to Retrieve:\n-   **Travel Itineraries:** Flight details (flight numbers, departure/arrival times, gates, terminals), hotel reservations (confirmation numbers, addresses, check-in/out times), car rental bookings, ground transportation options (taxi, ride-share, public transit maps).\n-   **Expense Management:** Receipts (digital/scanned), company expense policies, per diem rates, expense report forms, reimbursement procedures, corporate credit card statements.\n-   **Project Documentation:** Meeting schedules, agendas, client contact information, project briefs, presentation materials, statement of work (SOW), project deliverables, team member contact details (especially local team), access credentials for project systems.\n-   **Communication & Connectivity:** Wi-Fi network details and passwords, VPN access instructions, video conferencing links, meeting dial-in numbers, roaming information, local SIM card options.\n-   **Destination Specifics:** Local transportation guides, recommended business dining options, local emergency contacts, currency exchange rates (if international), local customs and etiquette guidelines.\n-   **Company Policies:** Travel policies, security protocols for international travel, preferred vendor lists (airlines, hotels), corporate discount codes.\n-   **Safety & Emergency:** Travel advisories, embassy/consulate information, emergency contact numbers for medical assistance or security, insurance details.\n-   **Productivity Tools:** Access to company shared drives, remote desktop instructions, software licenses needed for project work on the go.\n\n#### Information to Ignore (Noise):\n-   Leisure travel advertisements or vacation packages.\n-   General news articles unrelated to travel advisories or global business context.\n-   Marketing emails or newsletters for non-business-related products.\n-   Highly academic research papers or publications not directly related to the project domain.\n-   Personal finance advice or investment reports.\n-   Local entertainment listings (e.g., concerts, sports events) unless specifically for client entertainment.\n-   Internal company memos unrelated to travel, expenses, or projects.\n-   Detailed HR policy documents not pertaining to travel or work performance."
}