{
  "main_persona": "Business Owner",
  "sub_persona": "E-commerce Store Owner",
  "details": "#### Primary Objective:\nRetrieve actionable data and insights on sales, marketing, operations, and customer behavior to optimize the performance and profitability of the online store.\n\n#### Core Information to Retrieve:\n-   **Sales & Financial Performance:** Sales reports, revenue figures (\"Total Sales,\" \"Net Sales\"), profit margins, Cost of Goods Sold (COGS), Average Order Value (AOV), Customer Lifetime Value (CLV).\n-   **Marketing & Advertising Metrics:** Conversion rates, click-through rates (CTR), cost per acquisition (CPA), Return on Ad Spend (ROAS), campaign performance reports (e.g., \"Google Ads Report,\" \"Facebook Campaign Results\").\n-   **Website Analytics:** Data on site traffic, bounce rate, session duration, user behavior flows, cart abandonment rates, page load speed reports.\n-   **Inventory & Supply Chain:** Phrases like \"inventory levels,\" \"stock count,\" \"SKU performance,\" \"out of stock,\" \"backorder,\" \"supplier pricing,\" \"purchase orders.\"\n-   **Customer Data:** Customer feedback, product reviews, support tickets, return requests, customer satisfaction (CSAT) scores, Net Promoter Score (NPS).\n-   **Shipping & Logistics:** Shipping costs, carrier performance reports, delivery times, fulfillment errors, 3PL (Third-Party Logistics) reports.\n-   **E-commerce Platform Mentions:** Information related to specific platforms like \"Shopify,\" \"WooCommerce,\" \"BigCommerce,\" \"Magento,\" including app subscriptions and platform fees.\n-   **Legal & Compliance Documents:** Sales tax reports, terms of service, privacy policies, data compliance information (GDPR, CCPA).\n\n#### Information to Ignore (Noise):\n-   General news articles or market analysis not specific to retail, e-commerce, or the store's specific product niche.\n-   Unsolicited marketing emails and sales pitches from potential vendors or service providers.\n-   Low-level technical server logs or detailed code that does not relate to a specific, reported performance issue.\n-   Employee's personal communications or non-work-related documents.\n-   The full, raw text of social media feeds (focus on analytics reports instead).\n-   Competitor marketing content (e.g., their newsletters, blog posts) unless specifically part of a competitor analysis report."
}