{
  "main_persona": "Business Owner",
  "sub_persona": "Agricultural Business Owner",
  "details": "#### Primary Objective:\nRetrieve all critical information regarding market conditions, operational management, financial performance, and regulatory compliance to support the profitable and sustainable operation of an agricultural business.\n\n#### Core Information to Retrieve:\n-   **Market & Financial Data:** Commodity prices (e.g., \"corn futures,\" \"cattle prices\"), market analysis reports, input costs (fertilizer, seed, feed), fuel prices, equipment costs.\n-   **Financial Management:** Terms like \"cash flow,\" \"profit and loss statement,\" \"balance sheet,\" \"operating loan,\" \"cost of production.\"\n-   **Grants & Subsidies:** Information on \"USDA grants,\" \"farm subsidies,\" \"conservation programs,\" \"crop insurance.\"\n-   **Operational Best Practices:** Phrases like \"crop rotation,\" \"soil health,\" \"water management,\" \"integrated pest management (IPM),\" \"no-till farming.\"\n-   **Technology & Equipment:** Data on \"precision agriculture,\" \"GPS guidance,\" \"drone imagery,\" \"farm management software,\" tractor/combine specifications, maintenance schedules.\n-   **Livestock Management:** \"Herd health plans,\" \"feeding rations,\" \"breeding genetics,\" \"animal welfare standards.\"\n-   **Agronomy & Yields:** \"Soil test results,\" \"yield maps,\" \"harvest data,\" \"bushels per acre,\" \"planting density.\"\n-   **Regulatory & Compliance:** \"EPA regulations,\" \"water rights,\" \"pesticide application license,\" \"food safety standards,\" \"OSHA farm safety.\"\n-   **Contracts & Agreements:** Land lease agreements, sales contracts, supplier agreements, futures contracts.\n-   **Weather & Climate:** Long-range weather forecasts, drought monitoring reports, soil moisture levels.\n\n#### Information to Ignore (Noise):\n-   Academic research on non-agricultural topics (e.g., astrophysics, literature).\n-   General consumer-focused content (e.g., recipes, cooking blogs).\n-   News and reports from unrelated industries (e.g., entertainment, fashion, urban real estate).\n-   University administrative documents (e.g., course catalogs, student life).\n-   Deeply scientific or theoretical biology that lacks immediate practical application for farming.\n-   General political commentary with no direct link to agricultural policy.\n-   Marketing materials for non-agricultural consumer products."
}