{
  "main_persona": "Caregiver",
  "sub_persona": "Caregiver",
  "details": "#### Primary Objective:\nRetrieve all practical information related to medical care, daily schedules, emergency procedures, and support resources for the individual being cared for.\n\n#### Core Information to Retrieve:\n-   **Medical Information:** Medication names, dosages, administration schedules (\"twice daily,\" \"with food\"), prescription numbers (Rx), and pharmacy contact information.\n-   **Appointments & Schedules:** Doctor's appointment dates and times, physical therapy schedules, lab test appointments, daily routine checklists.\n-   **Contact Information:** Phone numbers for doctors, specialists (cardiologist, neurologist), home health agencies, social workers, and emergency family contacts.\n-   **Health Conditions & Directives:** Specific diagnoses (e.g., \"Congestive Heart Failure,\" \"Diabetes,\" \"Alzheimer's\"), allergy lists, dietary restrictions (\"low-sodium,\" \"soft foods\"), and advance directives like \"DNR\" or \"Living Will.\"\n-   **Instructions & Procedures:** Discharge summaries, post-operative care instructions, instructions for using medical equipment (e.g., glucose meter, oxygen tank, nebulizer), lists of symptoms to monitor.\n-   **Insurance & Billing:** Health insurance policy numbers, group numbers, billing statements from clinics or hospitals, \"Explanation of Benefits\" (EOB) documents.\n-   **Support Services:** Contact details for transportation services, meal delivery programs, and community support groups (e.g., Alzheimer's Association).\n\n#### Information to Ignore (Noise):\n-   Detailed medical research articles or clinical trial data.\n-   General hospital marketing materials or newsletters.\n-   Financial documents unrelated to medical billing (e.g., investment statements, 401k reports, tax forms).\n-   Junk mail, credit card offers, and catalogs.\n-   Legal documents not directly related to healthcare (e.g., property deeds, old employment contracts).\n-   Highly technical user manuals for general household electronics."
}