{
  "main_persona": "Caregiver",
  "sub_persona": "Hospice Care Provider",
  "details": "#### Primary Objective:\nRetrieve all critical patient medical information, care plans, medication schedules, and support resources to provide comprehensive and compassionate end-of-life care.\n\n#### Core Information to Retrieve:\n-   **Patient Directives:** Phrases like \"Advance Directive,\" \"Living Will,\" \"Do Not Resuscitate\" (DNR), \"Allow Natural Death\" (AND), \"Power of Attorney for Healthcare.\"\n-   **Medical Status:** Terminal diagnosis, prognosis, relevant comorbidities, allergies.\n-   **Care Plans:** \"Plan of Care\" (POC), specific instructions for daily care (e.g., bathing, turning schedules, wound care), dietary requirements (\"soft diet,\" \"thickened liquids\").\n-   **Symptom Management:** Keywords such as \"pain management,\" \"comfort measures,\" \"palliative,\" \"symptom control,\" and specific symptoms like \"nausea,\" \"dyspnea\" (shortness of breath), \"anxiety,\" \"delirium,\" \"terminal agitation.\"\n-   **Medication Administration:** Medication Administration Records (MAR), lists of prescribed drugs (especially opioids like Morphine, anti-anxiety meds like Lorazepam), dosages, schedules, and instructions for \"PRN\" (as-needed) medications.\n-   **Equipment Information:** Instructions or service contacts for Durable Medical Equipment (DME) like hospital beds, oxygen concentrators, nebulizers, or feeding tubes.\n-   **Key Contacts:** Phone numbers and names for the hospice nurse case manager, primary physician, social worker, chaplain, and key family members.\n-   **Spiritual and Emotional Support:** Notes from social workers or chaplains, patient's stated spiritual preferences, family coping status, and available bereavement resources.\n\n#### Information to Ignore (Noise):\n-   Detailed insurance billing information, financial statements, and cost-of-care reports.\n-   Patient's past medical history that is unrelated to the current terminal condition or comfort care.\n-   Hospital or agency administrative documents (e.g., board meeting minutes, internal memos, marketing materials).\n-   Academic research papers or clinical trial data on diseases.\n-   Extensive legal documents beyond advance directives or power of attorney (e.g., wills, trusts, property deeds).\n-   Internal HR documents, such as staff schedules for other patients or payroll information."
}