{
  "main_persona": "Caregiver",
  "sub_persona": "Home Health Nurse",
  "details": "#### Primary Objective:\nRetrieve all patient-specific medical data, care instructions, medication schedules, and emergency contacts to deliver comprehensive and safe in-home nursing care.\n\n#### Core Information to Retrieve:\n-   **Patient Medical Records:** \"Plan of Care\" (POC), \"Medication Administration Record\" (MAR), physician's orders, discharge summaries, clinical notes, progress notes.\n-   **Diagnoses & Conditions:** Lists of current and past medical diagnoses, chronic conditions (e.g., \"Diabetes Mellitus Type 2,\" \"Congestive Heart Failure,\" \"COPD\").\n-   **Allergies:** Specific allergies to medications (e.g., \"penicillin\"), food, or environmental factors.\n-   **Medication Details:** Drug names, dosages (e.g., \"mg,\" \"mL\"), frequency (\"daily,\" \"BID,\" \"PRN\"), and route of administration (\"PO,\" \"IM,\" \"IV,\" \"topical\").\n-   **Vital Signs:** Logs or charts for blood pressure (BP), heart rate (HR), temperature (T), respiratory rate (RR), oxygen saturation (SpO2), blood glucose levels.\n-   **Specific Care Instructions:** Wound care protocols, physical therapy exercises, dietary restrictions (e.g., \"low sodium diet,\" \"thickened liquids\"), fluid restrictions.\n-   **Contact Information:** Phone numbers for the Primary Care Physician (PCP), specialists (cardiologist, nephrologist, etc.), pharmacy, durable medical equipment (DME) supplier, and family/emergency contacts.\n-   **Legal Directives:** \"Advance Directive,\" \"Living Will,\" \"DNR\" (Do Not Resuscitate), \"Healthcare Proxy,\" \"Power of Attorney for Healthcare.\"\n-   **Schedules:** Upcoming doctor/therapy appointments, medication administration times, lab work appointments.\n-   **Insurance Information:** Insurance provider name (e.g., \"Medicare,\" \"Aetna\"), policy numbers, group numbers.\n\n#### Information to Ignore (Noise):\n-   Patient's personal financial documents (bank statements, tax returns, investment portfolios).\n-   Non-medical household bills (utilities, cable, phone).\n-   Junk mail, catalogs, magazines, and newspapers.\n-   Personal correspondence, greeting cards, and family photos.\n-   Home and appliance user manuals.\n-   Legal documents unrelated to healthcare (e.g., property deeds, wills, vehicle titles).\n-   Cookbooks and recipes that do not pertain to a prescribed medical diet.\n-   General news articles or non-medical research papers."
}