{
  "main_persona": "Caregiver",
  "sub_persona": "Respite Caregiver",
  "details": "#### Primary Objective:\nRetrieve all essential information regarding the care recipient's daily routines, medical needs, emergency procedures, and personal preferences to ensure a safe and smooth temporary care period.\n\n#### Core Information to Retrieve:\n-   **Medical & Emergency Information:** Medication schedules (drug name, dosage, time), list of allergies, doctor's contact information, emergency contact list, health insurance details (member ID), symptoms to watch for, and procedures for specific conditions (e.g., \"seizure protocol,\" \"how to use epi-pen\").\n-   **Daily Schedules & Routines:** Meal times, approved foods/drinks, dietary restrictions, nap/bedtime schedule, bath time routine, school or therapy appointment times.\n-   **Contact Lists:** Phone numbers for the primary caregiver, nearby relatives, neighbors, poison control, and the recipient's primary doctor/pediatrician.\n-   **Personal Preferences & Comfort:** Lists of favorite toys, books, TV shows, or activities; information on what soothes the person; notes on triggers or things that cause distress (e.g., \"hates loud noises,\" \"afraid of dogs\").\n-   **Communication Guides:** Notes on how the individual communicates (verbal, non-verbal, device), key words or signs they use, and strategies for understanding their needs.\n-   **Household & Safety Rules:** Location of the first-aid kit, fire escape plan, rules about screen time, areas of the house that are off-limits, wifi password.\n\n#### Information to Ignore (Noise):\n-   Long-term financial documents (e.g., wills, trusts, bank statements, power of attorney).\n-   The care recipient's extensive, historical medical records (focus should be on current, actionable information).\n-   Primary caregiver's personal documents (e.g., their own medical info, work emails, personal correspondence).\n-   General household bills (e.g., utilities, mortgage, credit card statements).\n-   Complex medical research articles or clinical trial data.\n-   Insurance policy documents beyond the primary contact/ID card."
}