{
  "main_persona": "Caregiver",
  "sub_persona": "Assisted Living Facility Caregiver",
  "details": "#### Primary Objective:\nRetrieve specific resident care plans, facility protocols, and daily schedules to ensure safe, compliant, and effective support for all residents.\n\n#### Core Information to Retrieve:\n-   **Resident Care Plans:** Individualized care plans, service plans, Activities of Daily Living (ADL) checklists.\n-   **Medical Information:** Medication Administration Records (MARs), medication schedules, allergies, dietary restrictions (e.g., \"low sodium,\" \"pureed,\" \"diabetic diet\"), specific diagnoses (\"dementia,\" \"diabetes,\" \"CHF\"), \"fall risk\" status.\n-   **Schedules & Routines:** Daily activity schedules, meal times, bathing schedules, toileting assistance schedules, therapy appointments (PT/OT).\n-   **Safety & Emergency Protocols:** \"Incident report\" forms, emergency procedures, evacuation plans, \"fall protocol,\" \"choking procedure,\" resident wandering alerts.\n-   **Staff Communication:** Shift change reports, communication logs, caregiver notes, nurse's notes, specific resident instructions for the shift.\n-   **Contact Information:** Resident family/emergency contacts, on-call nurse phone numbers, doctor's office numbers.\n-   **Policies & Compliance:** Phrases like \"resident rights,\" \"infection control,\" \"HIPAA,\" \"privacy policy,\" \"code of conduct.\"\n\n#### Information to Ignore (Noise):\n-   Facility financial reports, billing records, and insurance claim information.\n-   Marketing materials, brochures, and pricing structures for prospective residents.\n-   Corporate-level administrative documents and investor relations materials.\n-   Human Resources documents like payroll, staff recruiting, or job descriptions for non-caregiving roles.\n-   Building maintenance schedules, architectural plans, and vendor contracts (e.g., for food supply, landscaping).\n-   General industry news or research papers not pertaining to a specific resident's condition."
}