{
  "main_persona": "Caregiver",
  "sub_persona": "Childcare Provider",
  "details": "#### Primary Objective:\nRetrieve all critical information related to child safety, daily schedules, developmental activities, and parent communication to ensure a safe and enriching environment.\n\n#### Core Information to Retrieve:\n-   **Child-Specific Data:** Child's name, date of birth, allergies (food, environmental, medication), medical conditions, dietary restrictions.\n-   **Emergency Information:** Parent/guardian contact numbers, emergency contacts, pediatrician's name and phone number, phrases like \"emergency procedure,\" \"fire drill,\" \"first aid.\"\n-   **Medical & Health:** Medication names, dosage instructions, administration times, permission-to-administer forms, illness policies (e.g., \"must be fever-free for 24 hours\").\n-   **Schedules & Routines:** Daily schedules (nap, snack, meal, play times), feeding schedules for infants, potty training plans.\n-   **Activities & Curriculum:** Lesson plans, activity instructions (e.g., \"circle time,\" \"arts and crafts\"), age-appropriate games, songs, developmental milestone charts.\n-   **Permissions & Policies:** Authorized pickup lists, permission slips (photos, field trips), behavior management policies, late pickup policies.\n-   **Logistics & Supplies:** Diapering procedures, lists of required supplies (diapers, wipes, change of clothes), menus.\n\n#### Information to Ignore (Noise):\n-   Detailed financial documents of the childcare center (e.g., annual budgets, profit and loss statements).\n-   Marketing and promotional materials for the center.\n-   Parents' personal financial information (e.g., bank account numbers on payment forms).\n-   High-level administrative documents, such as staff payroll or building lease agreements.\n-   Vendor catalogs and invoices for non-childcare items (e.g., office equipment).\n-   Lengthy academic research papers on child psychology unless they are summarized as practical tips."
}