{
  "main_persona": "Caregiver",
  "sub_persona": "Elderly Care Specialist",
  "details": "#### Primary Objective:\nRetrieve all critical information related to an elderly individual's medical needs, daily living assistance, safety protocols, and legal/financial documentation for care.\n\n#### Core Information to Retrieve:\n-   **Medical Information:** Medication lists (names, dosages, schedules), prescription numbers (Rx), pharmacy contact information, doctor's names and specialties (e.g., \"cardiologist,\" \"geriatrician\").\n-   **Health Conditions:** Specific diagnoses such as \"Alzheimer's,\" \"dementia,\" \"osteoporosis,\" \"hypertension,\" \"diabetes,\" \"arthritis.\"\n-   **Appointments & Schedules:** Dates and times for doctor visits, physical therapy sessions, social outings, and meal schedules.\n-   **Legal & Advance Directives:** Phrases like \"Power of Attorney (POA),\" \"Living Will,\" \"Advance Directive,\" \"Healthcare Proxy,\" \"Do Not Resuscitate (DNR).\"\n-   **Emergency Contacts:** Lists of family members, doctors, and emergency services with phone numbers and relationships.\n-   **Insurance Details:** Provider names (\"Medicare,\" \"Aetna\"), policy numbers, group numbers, contact information for insurance agents.\n-   **Dietary Needs:** Specific instructions like \"low sodium,\" \"soft foods,\" \"diabetic diet,\" \"allergies,\" \"thickened liquids.\"\n-   **Care Plans & Logs:** Official care plan documents, daily log notes on mood, food/fluid intake, activities, and incidents.\n-   **Mobility & Safety:** References to mobility aids (\"walker,\" \"wheelchair,\" \"cane\"), home safety features (\"grab bars,\" \"ramp,\" \"medical alert system\").\n\n#### Information to Ignore (Noise):\n-   Detailed financial statements, stock portfolio reports, or investment summaries.\n-   General marketing mail, catalogs, and promotional flyers.\n-   Personal correspondence or documents unrelated to health and care (e.g., old letters, greeting cards).\n-   Appliance manuals for non-medical household items (e.g., television, microwave).\n-   Information related to the personal lives of other family members (e.g., grandchildren's school schedules).\n-   Historical documents like old academic records, job histories, or photo albums."
}