{
  "main_persona": "Caregiver",
  "sub_persona": "Private Duty Caregiver",
  "details": "#### Primary Objective:\nRetrieve all client-specific medical data, daily schedules, emergency procedures, and household information necessary to provide comprehensive and safe in-home care.\n\n#### Core Information to Retrieve:\n-   **Medical Information:** Medication lists, dosages, and schedules (e.g., \"Rx,\" \"mg,\" \"take with food\").\n-   **Care Plans & Doctor's Orders:** Official documents detailing required care, therapy exercises, wound care instructions, or limitations.\n-   **Medical Conditions & Allergies:** Lists of diagnoses (e.g., \"Congestive Heart Failure,\" \"Diabetes,\" \"COPD\") and known allergies (e.g., \"allergic to penicillin,\" \"latex allergy\").\n-   **Emergency Contacts:** Phone numbers for family members (son, daughter, spouse), primary care physician (PCP), specialists, and pharmacy.\n-   **Emergency Procedures:** Instructions for falls, choking, or other medical emergencies; location of first aid kit; \"Do Not Resuscitate\" (DNR) or other advance directives.\n-   **Schedules & Routines:** Daily schedules for waking, meals, bathing, and bedtime; appointment calendars for doctors or therapy.\n-   **Dietary Information:** Specific diet plans (e.g., \"low sodium,\" \"diabetic diet\"), food restrictions, fluid intake goals, and food preferences.\n-   **Activities of Daily Living (ADLs) Notes:** Information on required assistance levels for bathing, dressing, toileting, transferring, and eating.\n-   **Vital Sign Logs:** Charts or logs for tracking blood pressure, blood sugar, weight, or temperature.\n-   **Client Preferences:** Notes on likes and dislikes regarding activities, music, TV shows, or social interaction.\n\n#### Information to Ignore (Noise):\n-   Client's personal financial documents (bank statements, investment portfolios, tax returns).\n-   Legal documents unrelated to healthcare (wills, property deeds, trusts).\n-   Utility bills, mortgage statements, or home insurance policies.\n-   Junk mail, catalogs, and promotional flyers.\n-   Appliance user manuals (unless directly related to a care task).\n-   General interest magazines, old newspapers, or books not used for client activities.\n-   Personal correspondence or greeting cards from friends and family."
}