{
  "main_persona": "Compliance Officer",
  "sub_persona": "Environmental, Social, and Governance (ESG) Compliance Officer",
  "details": "#### Primary Objective:\nRetrieve all documents, regulations, reporting frameworks, and risk assessments pertaining to environmental, social, and governance (ESG) standards to ensure organizational compliance and mitigate risk.\n\n#### Core Information to Retrieve:\n-   **Regulatory & Framework Keywords:** \"GRI,\" \"SASB,\" \"TCFD\" (Task Force on Climate-related Financial Disclosures), \"SEC climate disclosure,\" \"CSRD\" (Corporate Sustainability Reporting Directive), \"SFDR\" (Sustainable Finance Disclosure Regulation), \"UN Global Compact,\" \"ISO 14001,\" \"ISO 26000.\"\n-   **Environmental Data & Policies:**\n    -   Phrases: \"greenhouse gas emissions,\" \"carbon footprint,\" \"Scope 1, 2, 3 emissions,\" \"water usage,\" \"waste management,\" \"recycling rates,\" \"climate risk,\" \"biodiversity loss,\" \"environmental impact assessment.\"\n    -   Metrics: Kilowatt-hours (kWh) consumed, metric tons of CO2e, water withdrawal volumes, hazardous waste tonnage.\n    -   Policies: \"Environmental Policy,\" \"Sustainability Report,\" \"Climate Transition Plan.\"\n-   **Social Data & Policies:**\n    -   Phrases: \"diversity and inclusion,\" \"pay equity,\" \"gender pay gap,\" \"employee health and safety,\" \"lost time injury rate,\" \"labor practices,\" \"human rights,\" \"supply chain labor standards,\" \"community engagement.\"\n    -   Metrics: Employee turnover, diversity statistics (% women in management), safety incident reports, supplier audit results.\n    -   Policies: \"Code of Conduct,\" \"Human Rights Policy,\" \"Supplier Code of Conduct,\" \"Whistleblower Policy.\"\n-   **Governance Data & Policies:**\n    -   Phrases: \"board independence,\" \"executive compensation,\" \"shareholder rights,\" \"business ethics,\" \"anti-corruption,\" \"anti-bribery,\" \"data privacy,\" \"risk management framework,\" \"internal controls.\"\n    -   Metrics: Board diversity data, executive-to-worker pay ratio, number of reported ethics violations.\n    -   Policies: \"Board of Directors Charter,\" \"Audit Committee Report,\" \"Anti-Bribery Policy,\" \"Cybersecurity Policy.\"\n-   **Compliance & Risk Terminology:** \"Compliance audit,\" \"risk assessment,\" \"materiality assessment,\" \"due diligence,\" \"non-compliance,\" \"regulatory penalty,\" \"stakeholder engagement,\" \"greenwashing.\"\n\n#### Information to Ignore (Noise):\n-   General marketing materials, product advertisements, and sales brochures.\n-   Routine financial reports (e.g., quarterly earnings reports) unless they specifically mention ESG investments, costs, or risks.\n-   Individual employee records, performance reviews, or payroll information (focus on aggregated data instead).\n-   General IT support tickets and routine internal operational communications.\n-   Press releases about product launches or personnel changes that do not have a direct ESG implication.\n-   Technical engineering schematics or source code.\n-   Company social event planning documents."
}