{
  "main_persona": "Compliance Officer",
  "sub_persona": "Ethics & Business Conduct Compliance Officer",
  "details": "#### Primary Objective:\nRetrieve all policies, procedures, training materials, and incident reports related to corporate ethics, employee conduct, and compliance with anti-corruption and fair business practice laws.\n\n#### Core Information to Retrieve:\n-   **Governing Policies:** Code of Conduct, Code of Ethics, Anti-Bribery and Anti-Corruption (ABAC) Policy, Gifts and Entertainment Policy, Conflict of Interest Policy, Whistleblower Policy, Non-Retaliation Policy.\n-   **Specific Keywords and Phrases:** \"bribery,\" \"corruption,\" \"kickback,\" \"facilitation payment,\" \"improper payment,\" \"conflict of interest,\" \"COI,\" \"fair dealing,\" \"antitrust,\" \"anti-competition,\" \"price fixing,\" \"insider trading.\"\n-   **Conduct-Related Terms:** \"harassment,\" \"discrimination,\" \"retaliation,\" \"bullying,\" \"unethical conduct,\" \"misconduct,\" \"fraud,\" \"theft,\" \"use of company assets.\"\n-   **Reporting and Investigation:** \"whistleblower hotline,\" \"speak up,\" \"reporting a concern,\" \"investigation report,\" \"disciplinary action,\" \"corrective action,\" \"remediation.\"\n-   **Training and Communication:** Ethics training materials, training completion records, employee certifications/attestations of policy review, compliance communications.\n-   **Risk and Audit:** Ethics risk assessments, compliance audit findings, third-party due diligence reports (related to corruption risk), minutes from Ethics & Compliance Committee meetings.\n-   **Regulatory References:** Foreign Corrupt Practices Act (FCPA), UK Bribery Act, and other relevant anti-corruption legislation.\n\n#### Information to Ignore (Noise):\n-   Financial statements, quarterly earnings reports, and standard accounting records.\n-   Product quality assurance reports and manufacturing specifications.\n-   Environmental, Health, and Safety (EHS) compliance data (e.g., emissions reports, workplace safety logs).\n-   General HR documents (e.g., benefits enrollment, payroll processing, performance reviews unrelated to misconduct).\n-   IT security policies not directly related to employee fraud or data theft (e.g., server patch management, network diagrams).\n-   Marketing materials, press releases, and advertising campaigns.\n-   Supply chain and logistics documentation."
}