{
  "main_persona": "Compliance Officer",
  "sub_persona": "Anti-Money Laundering (AML) Officer",
  "details": "#### Primary Objective:\nRetrieve all data related to financial transactions, customer identity, risk assessments, and internal controls to detect and report potential money laundering activities and ensure regulatory compliance.\n\n#### Core Information to Retrieve:\n-   **Regulatory Keywords & Acronyms:** AML, BSA (Bank Secrecy Act), FinCEN, OFAC, FATF, KYC (Know Your Customer), CDD (Customer Due Diligence), EDD (Enhanced Due Diligence).\n-   **Suspicious Activity Reporting:** Phrases like \"Suspicious Activity Report,\" \"SAR,\" \"unusual activity,\" \"red flag,\" \"SAR narrative,\" \"suspicious transaction.\"\n-   **Transaction Monitoring:** \"Large cash transaction,\" \"structuring,\" \"smurfing,\" \"rapid movement of funds,\" \"wire transfer,\" \"high-risk jurisdiction,\" \"transactions below threshold\" (e.g., under $10,000).\n-   **Customer & Entity Information:** \"Ultimate Beneficial Owner\" (UBO), \"Politically Exposed Person\" (PEP), \"source of funds,\" \"source of wealth,\" \"shell corporation,\" \"complex ownership structure,\" \"bearer shares.\"\n-   **High-Risk Indicators:** Mentions of sanctioned countries, individuals on sanctions lists (e.g., OFAC SDN List), businesses in high-risk sectors (e.g., casinos, precious metals dealers, virtual currency exchangers).\n-   **Compliance & Policy Documents:** \"AML Policy,\" \"Risk Assessment,\" \"Compliance Program,\" \"internal audit report,\" \"independent testing,\" \"training materials.\"\n-   **Specific Transaction Types:** Cryptocurrency transactions (Bitcoin, Monero), correspondent banking relationships, private banking client files, international wire transfers (SWIFT codes).\n\n#### Information to Ignore (Noise):\n-   General marketing materials, sales brochures, and advertising campaigns.\n-   Standard human resources documents (e.g., performance reviews, benefits information, recruiting materials).\n-   Routine IT support tickets and system update logs.\n-   Publicly available corporate earnings reports and standard investor relations presentations.\n-   Facilities management documents, such as maintenance schedules or office supply orders.\n-   General customer satisfaction surveys and product feedback not related to financial crime."
}