{
  "main_persona": "Compliance Officer",
  "sub_persona": "Financial Services Compliance Officer",
  "details": "#### Primary Objective:\nRetrieve all information pertaining to financial regulations, compliance policies, risk management protocols, and potential legal liabilities to ensure the organization adheres to all applicable laws and standards.\n\n#### Core Information to Retrieve:\n-   **Regulatory Bodies and Acts:** SEC (Securities and Exchange Commission), FINRA (Financial Industry Regulatory Authority), OCC (Office of the Comptroller of the Currency), CFPB (Consumer Financial Protection Bureau), FinCEN (Financial Crimes Enforcement Network), Bank Secrecy Act (BSA), USA PATRIOT Act, Dodd-Frank Act, Sarbanes-Oxley (SOX), Graham-Leach-Bliley Act (GLBA).\n-   **Anti-Money Laundering (AML) & Counter-Terrorism Financing (CTF):** Keywords like \"AML,\" \"KYC\" (Know Your Customer), \"CDD\" (Customer Due Diligence), \"EDD\" (Enhanced Due Diligence), \"SAR\" (Suspicious Activity Report), \"CTR\" (Currency Transaction Report), \"money laundering,\" \"terrorist financing,\" \"politically exposed person\" (PEP).\n-   **Risk & Control:** Phrases like \"risk assessment,\" \"risk mitigation,\" \"internal controls,\" \"audit findings,\" \"compliance testing,\" \"monitoring,\" \"surveillance,\" \"reputational risk,\" \"operational risk.\"\n-   **Ethics and Conduct:** \"Code of conduct,\" \"ethics policy,\" \"conflict of interest,\" \"insider trading,\" \"market abuse,\" \"market manipulation,\" \"anti-bribery,\" \"anti-corruption,\" \"gifts and entertainment policy.\"\n-   **Consumer Protection:** \"UDAAP\" (Unfair, Deceptive, or Abusive Acts or Practices), \"fair lending,\" \"consumer complaints,\" \"truth in lending,\" \"privacy notice.\"\n-   **Documentation and Reporting:** \"Compliance manual,\" \"policy update,\" \"regulatory filing,\" \"training materials,\" \"attestation,\" \"incident report,\" \"breach notification.\"\n-   **Specific Violations:** \"Fine,\" \"penalty,\" \"enforcement action,\" \"cease and desist,\" \"consent order,\" \"investigation.\"\n\n#### Information to Ignore (Noise):\n-   General marketing materials and advertising campaigns.\n-   Standard sales performance reports and leaderboards.\n-   Routine HR documents (e.g., vacation requests, benefits enrollment, non-compliance-related performance reviews).\n-   Day-to-day IT support tickets and server maintenance logs.\n-   High-level corporate financial results like quarterly earnings reports or stock price analysis.\n-   Logistical and administrative communications (e.g., office supply orders, meeting catering).\n-   Press releases about product launches or general corporate news."
}