{
  "main_persona": "Compliance Officer",
  "sub_persona": "Compliance Consultant",
  "details": "#### Primary Objective:\nRetrieve all documents pertaining to legal statutes, industry regulations, internal policies, risk assessments, and audit reports to evaluate and ensure an organization's adherence to legal and ethical standards.\n\n#### Core Information to Retrieve:\n-   **Regulatory Text & Legal Codes:** Phrases like \"Code of Federal Regulations (CFR),\" \"regulation,\" \"statute,\" \"ordinance,\" \"legal requirement,\" \"compliance framework,\" and specific law names (e.g., \"Sarbanes-Oxley Act,\" \"HIPAA,\" \"GDPR,\" \"CCPA\").\n-   **Internal Policies & Procedures:** Documents titled \"Code of Conduct,\" \"Ethics Policy,\" \"Anti-Bribery Policy,\" \"Whistleblower Policy,\" \"Data Governance,\" \"Information Security Standard,\" \"Standard Operating Procedure (SOP).\"\n-   **Risk & Control Documentation:** Keywords like \"risk assessment,\" \"risk register,\" \"control framework,\" \"gap analysis,\" \"compliance risk,\" \"mitigation plan,\" \"internal controls.\"\n-   **Audit & Investigation Reports:** Phrases like \"internal audit report,\" \"third-party audit,\" \"compliance review,\" \"regulatory examination,\" \"corrective action plan,\" \"remediation,\" \"investigation findings.\"\n-   **Compliance Training & Communication:** Materials labeled \"compliance training,\" \"employee attestation,\" \"policy certification,\" \"compliance handbook,\" \"ethics communication.\"\n-   **Reporting & Filings:** Regulatory filing documents, board meeting minutes (specifically sections on risk or compliance), \"incident reports,\" \"data breach notifications,\" \"suspicious activity report (SAR).\"\n-   **Regulatory Body Names:** Acronyms and names of regulatory agencies like SEC, FINRA, FTC, FDA, EPA, OSHA, CFPB.\n\n#### Information to Ignore (Noise):\n-   Marketing materials, press releases, and product brochures.\n-   General sales reports and customer testimonials.\n-   Routine HR documents like performance reviews, job postings, or event planning.\n-   Detailed financial data unrelated to regulatory reporting (e.g., daily expense reports, departmental budgets).\n-   Technical product specifications or source code unless directly related to a security or privacy regulation.\n-   Operational logistics such as shipping schedules or routine facilities requests."
}