{
  "main_persona": "Compliance Officer",
  "sub_persona": "IT Security Compliance Officer",
  "details": "#### Primary Objective:\nRetrieve all documents, policies, audit reports, and technical evidence related to IT security frameworks, regulations, and internal controls to assess and ensure organizational compliance.\n\n#### Core Information to Retrieve:\n-   **Regulatory & Framework Names:** \"GDPR,\" \"HIPAA,\" \"PCI DSS,\" \"SOX\" (specifically sections 302, 404), \"ISO 27001,\" \"NIST Cybersecurity Framework,\" \"SOC 2,\" \"CCPA,\" \"CPRA.\"\n-   **Compliance & Audit Terminology:** \"Audit report,\" \"compliance assessment,\" \"risk assessment,\" \"gap analysis,\" \"penetration test,\" \"vulnerability scan,\" \"statement of applicability (SoA).\"\n-   **Policy & Procedure Documents:** \"Information Security Policy,\" \"Acceptable Use Policy,\" \"Incident Response Plan,\" \"Disaster Recovery Plan,\" \"Data Classification Policy,\" \"Access Control Policy,\" \"Vendor Risk Management.\"\n-   **Technical Control Concepts:** \"Encryption,\" \"access control,\" \"user access review,\" \"least privilege,\" \"network segmentation,\" \"firewall configuration,\" \"multi-factor authentication (MFA),\" \"patch management.\"\n-   **Data & Privacy Terms:** \"Data Protection Impact Assessment (DPIA),\" \"personally identifiable information (PII),\" \"protected health information (PHI),\" \"data subject rights,\" \"data breach notification.\"\n-   **Evidence of Compliance:** \"Audit logs,\" \"SIEM reports,\" \"change management records,\" \"security awareness training completion rates,\" \"corrective action plans.\"\n\n#### Information to Ignore (Noise):\n-   Marketing materials for IT products or services.\n-   Raw software source code, developer commit logs, or build scripts.\n-   Routine IT helpdesk tickets (e.g., password resets, printer issues).\n-   General financial reports or statements that do not pertain to IT controls.\n-   Non-IT compliance documents (e.g., environmental regulations, HR policies on workplace conduct).\n-   Raw system performance metrics (CPU, memory usage) unless part of a security incident report."
}