{
  "main_persona": "Consultant",
  "sub_persona": "Compliance/Regulatory Consultant",
  "details": "#### Primary Objective:\nRetrieve all information concerning legal obligations, industry standards, regulatory requirements, and compliance procedures to assess and advise on an organization's adherence to applicable laws.\n\n#### Core Information to Retrieve:\n-   **Regulatory Keywords:** \"Compliance,\" \"regulation,\" \"statute,\" \"law,\" \"guidance,\" \"act,\" \"ordinance,\" \"directive,\" \"mandate.\"\n-   **Agency & Body Names:** Specific agency acronyms (e.g., \"SEC,\" \"FDA,\" \"EPA,\" \"OSHA,\" \"FTC,\" \"DOJ\") and general terms (\"commission,\" \"authority,\" \"department,\" \"agency,\" \"board\").\n-   **Specific Legislation & Standards:** Names of acts and regulations (e.g., \"Sarbanes-Oxley,\" \"GDPR,\" \"HIPAA,\" \"CCPA,\" \"Bank Secrecy Act,\" \"ISO 27001\").\n-   **Compliance Actions & Concepts:** \"Risk assessment,\" \"internal controls,\" \"audit,\" \"due diligence,\" \"code of conduct,\" \"ethics policy,\" \"data privacy,\" \"record retention,\" \"reporting requirement.\"\n-   **Enforcement & Penalties:** \"Violation,\" \"enforcement action,\" \"penalty,\" \"fine,\" \"sanction,\" \"consent decree,\" \"litigation,\" \"non-compliance.\"\n-   **Key Roles & Committees:** \"Chief Compliance Officer,\" \"Data Protection Officer,\" \"Audit Committee,\" \"Ethics Board.\"\n-   **Dates & Deadlines:** \"Effective date,\" \"compliance deadline,\" \"filing deadline,\" \"comment period,\" \"reporting period.\"\n-   **Document Types:** \"Policy manual,\" \"regulatory filing,\" \"compliance report,\" \"audit findings,\" \"legal opinion.\"\n\n#### Information to Ignore (Noise):\n-   Marketing materials, product advertisements, and sales brochures.\n-   General company press releases and news about non-regulatory achievements.\n-   Internal communications about social events, employee personal news, or general project updates.\n-   Detailed technical schematics or engineering specifications unless directly cited in a regulatory context.\n-   Routine financial documents like individual invoices, expense reports, or departmental budgets (unless part of a formal audit or filing).\n-   Customer service scripts and general customer feedback."
}