{
  "main_persona": "Consultant",
  "sub_persona": "Management Consultant",
  "details": "#### Primary Objective:\nRetrieve all strategic, financial, operational, and organizational data to analyze business performance, identify opportunities for improvement, and formulate actionable recommendations.\n\n#### Core Information to Retrieve:\n-   **Financial Performance:** Income statements, balance sheets, cash flow statements. Keywords: \"revenue,\" \"profit margin,\" \"EBITDA,\" \"operating costs,\" \"CapEx,\" \"OpEx,\" \"ROI.\"\n-   **Strategic Documents:** Business plans, strategic plans, go-to-market strategies, mission/vision statements.\n-   **Market & Competitor Analysis:** SWOT analysis, Porter's Five Forces, market share reports, competitor profiles, pricing analysis.\n-   **Operational Data:** Key Performance Indicators (KPIs), supply chain diagrams, process maps, workflow analyses, manufacturing data, logistics reports. Phrases like \"cycle time,\" \"bottleneck analysis,\" \"operational efficiency.\"\n-   **Organizational Structure:** Organizational charts (\"org charts\"), department roles and responsibilities, headcount data.\n-   **Human Resources Data:** Employee satisfaction surveys, attrition/turnover rates, talent management strategies, compensation and benefits structures.\n-   **Customer & Sales Data:** Customer segmentation, customer acquisition cost (CAC), customer lifetime value (CLV), sales pipeline reports, Net Promoter Score (NPS), customer churn rates.\n-   **Project & Meeting Records:** Project charters, stakeholder analyses, meeting minutes (especially from board or strategy meetings), lists of action items.\n\n#### Information to Ignore (Noise):\n-   Routine administrative communications (e.g., scheduling for non-strategic meetings, office supply orders).\n-   Individual employee expense reports or payroll records.\n-   Generic PR press releases and marketing fluff.\n-   Low-level IT support tickets or system logs.\n-   Legal boilerplate text within contracts (e.g., standard terms and conditions, privacy policies), unless directly relevant to a risk assessment project.\n-   Raw, un-aggregated data sets without accompanying summaries or reports.\n-   Casual internal communications or social event planning."
}