{
  "main_persona": "Consultant",
  "sub_persona": "IT/Technology Consultant",
  "details": "#### Primary Objective:\nRetrieve all technical, operational, and strategic documentation to assess an organization's current technology landscape, identify inefficiencies, and recommend improvements.\n\n#### Core Information to Retrieve:\n-   **Infrastructure & Architecture:** Network diagrams, server specifications, cloud architecture documents (AWS, Azure, GCP), data center layouts, hardware inventories.\n-   **Software & Systems:** Lists of current software applications (CRM, ERP, etc.), software versions, license agreements, SaaS subscriptions, API documentation, system dependencies.\n-   **IT Operations & Processes:** Phrases like \"IT Service Management (ITSM),\" \"change management process,\" \"incident response plan,\" \"disaster recovery plan,\" \"business continuity,\" \"service level agreements (SLAs).\"\n-   **Security & Compliance:** Security policies, compliance reports (SOC 2, ISO 27001, HIPAA, GDPR), vulnerability assessments, penetration test results, access control policies, data encryption standards.\n-   **Financial Data:** IT budgets, technology spending reports, Total Cost of Ownership (TCO) analysis, Return on Investment (ROI) calculations for past projects, vendor contracts, operational vs. capital expenditures (OpEx/CapEx).\n-   **Project Documentation:** Project charters, technology roadmaps, project post-mortems, requirements documents, \"lessons learned\" from previous IT projects.\n-   **Business Strategy:** Strategic plans, business goals, OKRs/KPIs, business process maps, workflow diagrams, stakeholder analysis.\n-   **Performance Metrics:** System uptime reports, performance benchmarks, latency data, user satisfaction surveys, help desk ticket volume and resolution times.\n\n#### Information to Ignore (Noise):\n-   General marketing materials, press releases, and customer-facing ad copy.\n-   Non-IT employee performance reviews and general HR documents (e.g., vacation policies).\n-   Raw, granular transaction logs or individual user data not relevant to system performance analysis.\n-   Company social event announcements and internal newsletters unrelated to technology.\n-   Non-technology vendor contracts (e.g., office cleaning, catering).\n-   Physical facilities management documents (e.g., building maintenance, floor plans)."
}