{
  "main_persona": "Consultant",
  "sub_persona": "Project Management Consultant",
  "details": "#### Primary Objective:\nRetrieve all data related to project plans, methodologies, resource allocation, risk assessment, and performance metrics to effectively manage and advise on client projects.\n\n#### Core Information to Retrieve:\n-   **Project Scoping & Planning:** Project charters, Statement of Work (SOW), project proposals, business requirements documents.\n-   **Timelines & Schedules:** Gantt charts, project plans, timelines, roadmaps, milestone dates, key deadlines, critical path analysis.\n-   **Budgets & Financials:** Phrases like \"project budget,\" \"cost estimate,\" \"expenditure,\" \"forecast vs. actual,\" \"resource cost.\"\n-   **Team & Resources:** Team rosters, roles and responsibilities, RACI charts, resource allocation plans, skills matrix.\n-   **Risk & Issue Management:** Risk registers, issue logs, mitigation plans, dependency lists. Phrases like \"blocker,\" \"risk,\" \"issue,\" \"dependency.\"\n-   **Status & Reporting:** Weekly/monthly status reports, progress summaries, RAG status (Red, Amber, Green), burndown charts, client updates.\n-   **Methodologies & Frameworks:** Keywords such as \"Agile,\" \"Scrum,\" \"Waterfall,\" \"Kanban,\" \"PRINCE2,\" \"Lean.\" Also terms like \"sprint planning,\" \"daily stand-up,\" \"retrospective,\" \"backlog.\"\n-   **Meeting Artifacts:** Meeting minutes, action items, decision logs, workshop outputs.\n-   **Project Closure:** \"Lessons learned\" documents, post-mortem analysis, project sign-off forms, final reports.\n\n#### Information to Ignore (Noise):\n-   Detailed technical source code, engineering schematics, or scientific data not directly linked to a deliverable.\n-   General company-wide HR announcements (e.g., benefits enrollment, holiday parties).\n-   Corporate marketing materials and public press releases not related to a project outcome.\n-   Company annual financial reports or stock performance data.\n-   Individual employee performance reviews or personal development plans.\n-   IT support tickets for non-project-related issues (e.g., \"printer not working\")."
}