{
  "main_persona": "Consultant",
  "sub_persona": "Operations Consultant",
  "details": "#### Primary Objective:\nRetrieve all data related to a company's internal processes, operational performance metrics, resource allocation, and supply chain management to identify opportunities for improvement and optimization.\n\n#### Core Information to Retrieve:\n-   **Process Documentation:** Phrases like \"Standard Operating Procedure (SOP),\" \"business process map,\" \"workflow diagram,\" \"value stream map,\" \"flowchart.\"\n-   **Performance Metrics (KPIs):** \"Key Performance Indicators,\" \"dashboard,\" \"metrics,\" and specific terms like \"cycle time,\" \"lead time,\" \"throughput,\" \"uptime/downtime,\" \"defect rate,\" \"First Pass Yield (FPY),\" \"Overall Equipment Effectiveness (OEE),\" \"cost per unit,\" \"inventory turnover,\" \"On-Time In-Full (OTIF).\"\n-   **Financial Data (Operational):** \"Operating Expenses (OpEx),\" \"Cost of Goods Sold (COGS),\" \"budget variance,\" \"cost analysis,\" \"Return on Investment (ROI)\" for operational projects.\n-   **Supply Chain & Logistics:** \"Supply chain,\" \"procurement,\" \"sourcing,\" \"inventory levels,\" \"warehouse layout,\" \"logistics,\" \"shipping data,\" \"demand forecast,\" \"supplier performance.\"\n-   **Resource & Capacity Planning:** \"Staffing levels,\" \"organizational chart,\" \"org chart,\" \"roles and responsibilities,\" \"shift schedules,\" \"capacity utilization,\" \"production schedule.\"\n-   **Improvement Methodologies:** Keywords like \"Lean Manufacturing,\" \"Six Sigma,\" \"Kaizen,\" \"Continuous Improvement,\" \"Root Cause Analysis,\" \"5S,\" \"Just-in-Time (JIT).\"\n-   **Operational Issues:** \"Bottleneck,\" \"customer complaints,\" \"quality control report,\" \"incident report,\" \"safety report,\" \"waste analysis.\"\n-   **Technology Systems:** Names of systems like \"ERP,\" \"SAP,\" \"Oracle,\" \"WMS\" (Warehouse Management System), \"MES\" (Manufacturing Execution System).\n\n#### Information to Ignore (Noise):\n-   Detailed marketing and sales campaign materials (e.g., ad copy, creative briefs, brand guidelines).\n-   High-level corporate communications (e.g., press releases, shareholder letters, annual reports).\n-   General Human Resources documents (e.g., employee handbooks, benefits descriptions, holiday party plans).\n-   Non-operational legal documents (e.g., patent filings, intellectual property disputes, corporate litigation).\n-   Detailed IT infrastructure information (e.g., server configurations, source code, cybersecurity policies).\n-   Board of Directors meeting minutes, unless they specifically address operational strategy or performance."
}