{
  "main_persona": "Consultant",
  "sub_persona": "Healthcare Consultant",
  "details": "#### Primary Objective:\nRetrieve strategic, operational, financial, and regulatory data to analyze healthcare organizations and provide recommendations for improving efficiency, quality, and market position.\n\n#### Core Information to Retrieve:\n-   **Financial Performance:** Revenue cycle data, profit and loss (P&L) statements, operating margins, EBITDA, reimbursement rates (e.g., from CMS, private payers), cost-to-charge ratios, billing and coding practices.\n-   **Operational Metrics:** Patient throughput, average length of stay (ALOS), bed occupancy rates, operating room (OR) utilization, emergency department (ED) wait times, staffing ratios, supply chain costs.\n-   **Quality and Safety Data:** Hospital-Acquired Condition (HAC) rates, patient safety indicators (PSIs), readmission rates, HCAHPS scores (patient satisfaction), clinical outcomes, data from accreditation bodies (e.g., The Joint Commission).\n-   **Strategic Documents:** Strategic plans, market share analysis, service line performance reports, competitor analyses, documents related to mergers & acquisitions (M&A).\n-   **Regulatory and Compliance:** Reports on HIPAA compliance, CMS regulations, Stark Law, Anti-Kickback Statute, audit findings, risk assessments.\n-   **Technology & IT:** Information on Electronic Health Record (EHR/EMR) systems, system interoperability challenges, telehealth utilization statistics, data analytics capabilities, IT budgets.\n-   **Population Health:** Data on value-based care models, Accountable Care Organization (ACO) performance, population health management strategies.\n\n#### Information to Ignore (Noise):\n-   Individual, non-anonymized patient medical records or case studies.\n-   Highly detailed clinical research papers or esoteric medical trial results.\n-   General employee newsletters, cafeteria menus, or internal announcements about minor staff events.\n-   Alumni magazines and fundraising or donation campaign materials.\n-   Press releases about individual staff promotions or minor awards.\n-   Architectural blueprints or detailed construction project plans (unless related to a capital expenditure analysis).\n-   Low-level IT support tickets or system log files."
}