{
  "main_persona": "Contract Manager",
  "sub_persona": "Vendor Contract Manager",
  "details": "#### Primary Objective:\nRetrieve all actionable terms, obligations, performance metrics, and financial details from vendor contracts to monitor compliance, manage risk, and oversee the entire contract lifecycle.\n\n#### Core Information to Retrieve:\n-   **Contractual Parties:** Legal names of the vendor, supplier, and client entities.\n-   **Key Dates:** \"Effective Date,\" \"Commencement Date,\" \"Expiration Date,\" \"Renewal Date,\" \"Notice Period.\"\n-   **Scope & Deliverables:** \"Statement of Work (SOW),\" \"Scope of Services,\" \"Deliverables,\" \"Specifications,\" \"Bill of Materials (BOM).\"\n-   **Financial Terms:** \"Pricing,\" \"Payment Schedule,\" \"Fees,\" \"Discounts,\" \"Rebates,\" \"Invoicing Procedures,\" \"Net 30/60/90,\" \"Late Payment Penalties.\"\n-   **Performance Clauses:** \"Service Level Agreement (SLA),\" \"Key Performance Indicators (KPIs),\" \"Uptime Guarantees,\" \"Response Times,\" \"Acceptance Criteria.\"\n-   **Liability & Risk:** \"Limitation of Liability,\" \"Indemnification,\" \"Warranty,\" \"Insurance Requirements,\" \"Force Majeure.\"\n-   **Confidentiality & Data Security:** \"Confidential Information,\" \"Non-Disclosure Agreement (NDA),\" \"Data Privacy,\" \"Data Security,\" \"GDPR,\" \"CCPA.\"\n-   **Termination & Renewal:** \"Termination for Cause,\" \"Termination for Convenience,\" \"Auto-renewal clause,\" \"Notice of Non-renewal,\" \"Exit Plan,\" \"Transition Services.\"\n-   **Governance & Compliance:** \"Governing Law,\" \"Jurisdiction,\" \"Dispute Resolution,\" \"Audit Rights,\" \"Compliance with Laws.\"\n-   **Contact Points:** \"Notices,\" \"Point of Contact,\" \"Account Manager,\" official addresses for communication.\n\n#### Information to Ignore (Noise):\n-   Draft versions or redlined documents (look for \"Draft,\" \"Track Changes,\" \"Internal Review\").\n-   Vendor marketing materials, brochures, or case studies attached as non-binding appendices.\n-   Internal emails or meeting minutes discussing the negotiation process.\n-   Boilerplate sections with no operational impact, such as \"Recitals\" or \"Whereas\" clauses.\n-   General corporate information about the vendor (e.g., their annual reports) unless directly referenced in the contract.\n-   Non-executed signature pages or unsigned contract copies."
}