{
  "main_persona": "Contract Manager",
  "sub_persona": "Contract Manager",
  "details": "#### Primary Objective:\nRetrieve all critical terms, obligations, dates, financial details, and risk-related clauses from contracts and associated legal documents.\n\n#### Core Information to Retrieve:\n-   **Key Parties:** Names of signatories, legal entity names (\"Party A,\" \"Company,\" \"Client,\" \"Vendor\").\n-   **Critical Dates:** \"Effective Date,\" \"Execution Date,\" \"Commencement Date,\" \"Termination Date,\" \"Expiration Date,\" \"Notice Period,\" \"Renewal Date.\"\n-   **Financial Terms:** \"Payment Terms,\" \"Pricing,\" \"Fees,\" \"Invoicing Schedule,\" \"Net 30/60/90,\" \"Late Payment,\" \"Penalties,\" \"Currency\" (e.g., USD, EUR).\n-   **Scope & Obligations:** \"Scope of Work (SOW),\" \"Deliverables,\" \"Milestones,\" \"Service Level Agreement (SLA),\" \"Responsibilities,\" \"Duties.\"\n-   **Legal & Risk Clauses:** \"Limitation of Liability,\" \"Indemnification,\" \"Confidentiality,\" \"Non-Disclosure Agreement (NDA),\" \"Governing Law,\" \"Jurisdiction,\" \"Dispute Resolution,\" \"Arbitration,\" \"Force Majeure.\"\n-   **Renewal & Termination:** \"Term,\" \"Termination for Cause,\" \"Termination for Convenience,\" \"Auto-renewal,\" \"Option to Renew.\"\n-   **Compliance & Data Security:** \"Data Privacy,\" \"GDPR,\" \"CCPA,\" \"Information Security,\" \"Insurance Requirements,\" \"Audit Rights.\"\n-   **Document Structure:** References to \"Exhibit A,\" \"Schedule 1,\" \"Addendum,\" \"Amendment.\"\n\n#### Information to Ignore (Noise):\n-   Non-binding correspondence like introductory emails or meeting minutes (unless formally attached as an exhibit).\n-   Marketing brochures, product data sheets, or general sales literature.\n-   Headers, footers, and page numbers.\n-   Superseded drafts or redlined versions of the contract.\n-   Standard legal boilerplate definitions that do not define a specific obligation (e.g., definitions of \"day\" or \"business day\").\n-   Company mission statements or \"About Us\" sections from attached corporate profiles."
}