{
  "main_persona": "Contract Manager",
  "sub_persona": "Government Contract Manager",
  "details": "#### Primary Objective:\nRetrieve all terms, regulations, reporting requirements, and compliance details related to government contracts to ensure full adherence and successful execution.\n\n#### Core Information to Retrieve:\n-   **Contract Identifiers:** Solicitation numbers, contract numbers, task order numbers, modification numbers (\"mods\").\n-   **Key Clauses & Regulations:** Federal Acquisition Regulation (FAR) clauses, Defense Federal Acquisition Regulation Supplement (DFARS) clauses, specific clause numbers (e.g., \"FAR 52.217-9\").\n-   **Scope & Work Statements:** Statement of Work (SOW), Performance Work Statement (PWS), Statement of Objectives (SOO).\n-   **Financials & Funding:** Contract Line Item Numbers (CLINs), contract value, ceiling price, funding status, payment terms, invoicing procedures.\n-   **Schedules & Deadlines:** Period of Performance (PoP), delivery schedules, option years, reporting deadlines, proposal submission dates.\n-   **Compliance & Security:** Security clearance requirements (e.g., \"Top Secret\", \"CUI\"), data rights, intellectual property (IP) clauses, Cybersecurity Maturity Model Certification (CMMC) requirements, DCAA audit references.\n-   **Personnel & Roles:** Contracting Officer (CO), Contracting Officer's Representative (COR), key personnel clauses.\n-   **Subcontracting:** Subcontractor agreements, flow-down clauses, small business subcontracting plans (e.g., SDVOSB, HUBZone, WOSB).\n-   **Modifications & Changes:** Change orders, requests for equitable adjustment, termination clauses (\"Termination for Convenience,\" \"Termination for Default\").\n-   **Bidding & Award Documents:** Request for Proposal (RFP), Request for Quotation (RFQ), award letters, evaluation criteria.\n\n#### Information to Ignore (Noise):\n-   General company marketing materials, brochures, or press releases.\n-   Internal human resources documents (e.g., employee handbooks, non-contract related job descriptions).\n-   Highly technical engineering drawings, source code, or scientific data unless explicitly named as a deliverable.\n-   General government news, policy speeches, or legislative drafts not directly related to procurement or acquisition.\n-   Corporate annual reports or shareholder communications.\n-   Meeting minutes that do not discuss contractual obligations, deliverables, or compliance issues."
}