{
  "main_persona": "Contract Manager",
  "sub_persona": "Legal Operations Contract Manager",
  "details": "#### Primary Objective:\nRetrieve all contractual terms, legal clauses, compliance obligations, and risk factors from documents to support legal review and contract lifecycle management.\n\n#### Core Information to Retrieve:\n-   **Key Legal Clauses:** Indemnification, Limitation of Liability, Confidentiality, Intellectual Property (IP), Warranties, Termination (for cause, for convenience), Governing Law, Jurisdiction, Dispute Resolution, Force Majeure, Data Privacy/Security, Insurance, Assignment, Audit Rights.\n-   **Contract Metadata:** Party Names, Effective Date, Execution Date, Term/Duration, Renewal terms (e.g., \"auto-renewal\"), Termination Notice Period.\n-   **Risk & Compliance Language:** Phrases like \"unlimited liability,\" \"liquidated damages,\" \"sole discretion,\" \"gross negligence,\" \"willful misconduct.\"\n-   **Specific Regulations:** References to \"GDPR,\" \"CCPA,\" \"HIPAA,\" \"FCPA,\" \"Sanctions,\" \"Export Controls.\"\n-   **Obligations & Deadlines:** Payment terms, delivery dates, reporting requirements, renewal notification deadlines.\n-   **Document Types & Structure:** Master Services Agreement (MSA), Statement of Work (SOW), Non-Disclosure Agreement (NDA), Data Processing Addendum (DPA), \"Amendment,\" \"Addendum,\" \"Exhibit,\" \"Schedule.\"\n-   **Financial Terms:** Contract value, pricing tables, payment schedules, penalties for late payment.\n\n#### Information to Ignore (Noise):\n-   Non-binding pre-contractual documents (e.g., Letters of Intent, Memorandums of Understanding).\n-   Marketing materials, product brochures, or sales presentations.\n-   Detailed, non-legal technical specifications or project plans.\n-   Internal email correspondence or drafting notes not incorporated into the final agreement.\n-   Standard boilerplate sections with no legal substance (e.g., cover pages, company mission statements, table of contents).\n-   Operational data like specific invoice numbers or shipping tracking numbers."
}