{
  "main_persona": "Contractor",
  "sub_persona": "Specialty Trade Contractor",
  "details": "#### Primary Objective:\nRetrieve all technical specifications, project requirements, schedules, and safety protocols directly related to a specific construction trade to facilitate accurate bidding and project execution.\n\n#### Core Information to Retrieve:\n-   **Scope of Work:** Phrases like \"Scope of Work,\" \"Description of Work,\" \"Summary of Work,\" and specific trade sections (e.g., \"Section 26 05 00 - Common Work Results for Electrical,\" \"Section 22 00 00 - Plumbing\").\n-   **Technical Specifications:** CSI MasterFormat numbers (e.g., Division 22, 23, 26), material requirements, \"approved manufacturer list,\" \"performance criteria,\" \"product data,\" \"submittal requirements.\"\n-   **Drawings & Plans:** Sheet numbers corresponding to a specific trade (e.g., \"E-\" for Electrical, \"P-\" for Plumbing, \"M-\" for Mechanical), \"details,\" \"schedules\" (e.g., panel schedules, equipment schedules), \"riser diagrams,\" \"floor plans,\" \"layouts.\"\n-   **Project Schedules:** \"Construction schedule,\" \"project milestones,\" \"Gantt chart,\" \"phasing plan,\" \"start date,\" \"completion date,\" \"lead time.\"\n-   **Safety & Logistics:** \"Site Safety Plan,\" \"OSHA,\" \"Personal Protective Equipment (PPE),\" \"Job Safety Analysis (JSA),\" \"site logistics plan,\" \"laydown area,\" \"staging area.\"\n-   **Project Communication:** \"Request for Information (RFI),\" \"submittal log,\" \"shop drawing,\" \"addendum,\" \"change order,\" \"bulletin.\"\n-   **Contact Information:** Names, roles, and contact details for \"General Contractor,\" \"Project Manager,\" \"Superintendent,\" \"Architect,\" \"Engineer.\"\n-   **Contractual Terms:** \"Payment schedule,\" \"schedule of values,\" \"retainage,\" \"insurance requirements,\" \"bonding requirements,\" \"liquidated damages.\"\n\n#### Information to Ignore (Noise):\n-   Specifications and drawings for unrelated trades (e.g., a plumber ignoring landscaping, painting, or Division 26 electrical plans).\n-   High-level project financing documents, developer pro-formas, or bank loan agreements.\n-   Architectural design narratives, design intent philosophy, or conceptual renderings.\n-   Real estate marketing brochures or leasing information for the completed project.\n-   Owner's internal corporate communications or annual reports.\n-   Detailed legal documentation regarding land acquisition, zoning variances, or environmental impact studies not directly affecting the scope of work.\n-   Furniture, Fixtures, and Equipment (FF&E) schedules unless directly related to the trade's scope."
}