{
  "main_persona": "Contract Manager",
  "sub_persona": "Service Level Agreement (SLA) Manager",
  "details": "#### Primary Objective:\nRetrieve all clauses, metrics, and definitions related to service performance, obligations, remedies, and reporting as defined within contracts and Service Level Agreements.\n\n#### Core Information to Retrieve:\n-   **Core SLA Terminology:** \"Service Level Agreement,\" \"SLA,\" \"Service Level,\" \"Service Level Objective,\" \"SLO,\" \"Key Performance Indicator,\" \"KPI,\" \"Service Level Target.\"\n-   **Performance Metrics:**\n    -   **Availability:** \"Uptime,\" \"downtime,\" \"availability percentage,\" \"scheduled maintenance,\" \"maintenance window.\"\n    -   **Response Times:** \"Response time,\" \"resolution time,\" \"acknowledgement time,\" \"Mean Time to Repair (MTTR),\" \"Mean Time Between Failures (MTBF).\"\n    -   **Quality & Accuracy:** \"Error rate,\" \"defect density,\" \"customer satisfaction (CSAT),\" \"first contact resolution (FCR).\"\n    -   **Capacity:** \"Concurrent users,\" \"transactions per second,\" \"throughput,\" \"latency.\"\n-   **Consequences & Remedies:**\n    -   **Penalties:** \"Service credits,\" \"fee at risk,\" \"penalty,\" \"liquidated damages,\" \"failure to perform.\"\n    -   **Rewards:** \"Earn-back,\" \"incentive,\" \"bonus,\" \"performance bonus.\"\n    -   **Termination:** \"Termination for cause,\" \"material breach,\" \"chronic failure.\"\n-   **Governance & Reporting:**\n    -   **Reporting:** \"Reporting period,\" \"monthly report,\" \"quarterly business review (QBR),\" \"dashboard,\" \"performance report.\"\n    -   **Measurement:** \"Measurement period,\" \"monitoring tools,\" \"calculation formula,\" \"source of truth.\"\n    -   **Escalation:** \"Escalation procedure,\" \"escalation path,\" \"points of contact,\" \"severity levels (Sev 1, Sev 2).\"\n-   **Scope & Exclusions:** \"Scope of services,\" \"in-scope,\" \"out-of-scope,\" \"exclusions,\" \"dependencies,\" \"force majeure,\" \"excusable downtime.\"\n\n#### Information to Ignore (Noise):\n-   General legal boilerplate (e.g., \"Governing Law,\" \"Confidentiality,\" \"Indemnification,\" \"Assignment\").\n-   Detailed financial information not related to service credits or penalties (e.g., overall contract value, payment schedules, invoicing procedures).\n-   Company mission statements, marketing materials, or press releases.\n-   Human Resources policies, employee lists, or internal job descriptions.\n-   Hardware/software technical specifications unless directly tied to a performance metric.\n-   Standard document metadata such as signature pages, tables of contents, and revision histories (unless tracking SLA changes)."
}