{
  "main_persona": "Contractor",
  "sub_persona": "Project Management Contractor",
  "details": "#### Primary Objective:\nRetrieve all information related to project schedules, budgets, resource allocation, risk management, and stakeholder communications to effectively manage a project from inception to completion.\n\n#### Core Information to Retrieve:\n-   **Project Plans & Scope:** Keywords like \"Scope of Work (SOW),\" \"Project Charter,\" \"Statement of Work,\" \"Deliverables,\" \"Exclusions,\" \"Project Objectives.\"\n-   **Schedules & Timelines:** Gantt charts, project timelines, phrases like \"critical path,\" \"milestone,\" \"deadline,\" \"project phase,\" \"start/end date,\" \"duration.\"\n-   **Budgets & Financials:** Cost estimates, budget breakdowns, line items, cost codes, phrases like \"Bill of Materials (BOM),\" \"Change Order,\" \"Request for Quote (RFQ),\" \"Invoice,\" \"Payment Schedule.\"\n-   **Contracts & Agreements:** Subcontractor agreements, vendor contracts, client contracts, Service Level Agreements (SLAs), terms and conditions.\n-   **Resource Management:** \"Resource Allocation,\" \"Staffing Plan,\" \"Subcontractor List,\" \"Vendor List,\" contact information for team members and suppliers.\n-   **Communication & Reporting:** \"Meeting Minutes,\" \"Status Report,\" \"Progress Report,\" \"Action Items,\" \"RFI\" (Request for Information), \"Submittal Log,\" stakeholder contact lists.\n-   **Risk & Compliance:** \"Risk Register,\" \"Risk Assessment,\" \"Contingency Plan,\" \"Safety Plan,\" \"Permit,\" \"Inspection Report,\" \"OSHA requirements.\"\n-   **Technical Specifications:** Blueprints, schematics, material specification sheets, technical requirements that define deliverables.\n\n#### Information to Ignore (Noise):\n-   Company-wide marketing materials, press releases, or brand guidelines.\n-   Parent company's annual financial reports or stock performance.\n-   Human Resources documents unrelated to the project team (e.g., corporate benefits enrollment, company-wide holiday party invitations).\n-   Deeply technical engineering calculations or raw scientific data that doesn't pertain to a final specification or requirement.\n-   Archived projects that have no bearing on the current one.\n-   General industry news or articles not directly related to a project's execution."
}