{
  "main_persona": "Contractor",
  "sub_persona": "Healthcare Consultant Contractor",
  "details": "#### Primary Objective:\nRetrieve all business, financial, operational, and regulatory information pertinent to advising healthcare organizations on strategy, compliance, and performance improvement.\n\n#### Core Information to Retrieve:\n-   **Financial Data:** Terms like \"revenue cycle,\" \"reimbursement rates,\" \"billing codes\" (ICD-10, CPT), \"EBITDA,\" \"operating margin,\" \"cost-benefit analysis,\" profit and loss statements, budgets.\n-   **Operational Metrics:** Phrases like \"patient throughput,\" \"bed occupancy rates,\" \"average length of stay\" (LOS), \"staffing ratios,\" \"supply chain costs,\" \"operational efficiency.\"\n-   **Regulatory & Compliance:** Keywords such as \"HIPAA,\" \"Stark Law,\" \"Anti-Kickback,\" \"CMS regulations,\" \"JCAHO\" (The Joint Commission), \"HCAHPS scores,\" \"Meaningful Use,\" \"MACRA/MIPS.\"\n-   **Strategic Documents:** Strategic plans, SWOT analyses, market share reports, competitive analysis, service line expansion plans, merger & acquisition (M&A) proposals.\n-   **Contracts & Agreements:** Statements of Work (SOW), consultant agreements, vendor contracts, Service Level Agreements (SLAs), partnership agreements.\n-   **Technology Information:** Details on Electronic Health Record (EHR/EMR) systems, health IT infrastructure, telehealth services, data analytics platforms, interoperability challenges.\n-   **Organizational Structure:** Organizational charts, committee meeting minutes, board reports, lists of key stakeholders and decision-makers.\n\n#### Information to Ignore (Noise):\n-   Individual, de-identified patient medical records or clinical case notes.\n-   Detailed clinical trial results or basic scientific research papers.\n-   Low-level internal communications (e.g., departmental holiday schedules, cafeteria menus).\n-   General marketing materials intended for patients (e.g., service brochures, wellness tips).\n-   Routine facility maintenance reports and work orders.\n-   Individual employee performance reviews or payroll information."
}