{
  "main_persona": "Contract Manager",
  "sub_persona": "Sales Contract Manager",
  "details": "#### Primary Objective:\nRetrieve all critical terms, obligations, financial data, and risk factors from sales-related contracts to facilitate effective management, ensure compliance, and protect company interests.\n\n#### Core Information to Retrieve:\n-   **Key Parties:** \"Customer Name,\" \"Client Name,\" \"Buyer,\" \"Vendor,\" legal entity names, addresses.\n-   **Contract Identifiers:** \"Contract Number,\" \"Agreement ID,\" \"Purchase Order (PO) Number,\" \"Master Service Agreement (MSA),\" \"Statement of Work (SOW).\"\n-   **Critical Dates:** \"Effective Date,\" \"Execution Date,\" \"Start Date,\" \"End Date,\" \"Term Length,\" \"Renewal Date,\" \"Notice Period for Termination.\"\n-   **Financial Terms:** \"Pricing,\" \"Fees,\" \"Payment Terms\" (e.g., Net 30, Net 60), \"Payment Schedule,\" \"Total Contract Value (TCV),\" \"Annual Recurring Revenue (ARR),\" \"Discounts,\" \"Rebates,\" \"Taxes,\" \"Currency.\"\n-   **Scope & Deliverables:** \"Scope of Work,\" \"Deliverables,\" \"Product List,\" \"Service Level Agreement (SLA),\" \"Specifications,\" \"Quantity,\" \"Milestones.\"\n-   **Obligations & Responsibilities:** Phrases like \"Company shall,\" \"Customer shall,\" \"warrants,\" \"guarantees,\" \"responsibilities of.\"\n-   **Risk & Liability Clauses:** \"Limitation of Liability,\" \"Indemnification,\" \"Confidentiality,\" \"Data Protection,\" \"Intellectual Property Rights,\" \"Force Majeure,\" \"Warranty.\"\n-   **Termination & Renewal:** \"Termination for Cause,\" \"Termination for Convenience,\" \"Auto-renewal,\" \"Cancellation Policy,\" \"Exit Plan.\"\n-   **Legal & Governance:** \"Governing Law,\" \"Jurisdiction,\" \"Dispute Resolution,\" \"Arbitration Clause.\"\n-   **Signatures:** Names of signatories, titles, and signature dates.\n\n#### Information to Ignore (Noise):\n-   Internal emails, drafts, or negotiation commentary not part of the final executed document.\n-   Marketing brochures, sales presentations, or product datasheets.\n-   Procurement or vendor contracts where the company is the buyer.\n-   Human Resources documents like employment agreements or offer letters.\n-   Company-wide financial reports (e.g., quarterly earnings, balance sheets).\n-   Non-binding documents like Letters of Intent (LOI) or Memorandums of Understanding (MOU).\n-   Highly technical engineering schematics or source code.\n-   Standard boilerplate text in document headers/footers (e.g., page numbers, confidential watermarks)."
}