{
  "main_persona": "Contractor",
  "sub_persona": "Freelance Creative Contractor",
  "details": "#### Primary Objective:\nRetrieve all information pertinent to project acquisition, contract management, payment terms, creative brief details, and client communication for freelance creative work.\n\n#### Core Information to Retrieve:\n-   **Project Details:** Creative briefs, project scopes, campaign objectives, target audience demographics, brand guidelines, mood boards, concept descriptions, client requirements, deliverables lists, revision policies.\n-   **Contractual & Legal:** Service agreements, master service agreements (MSAs), statements of work (SOWs), non-disclosure agreements (NDAs), intellectual property clauses (copyright, licensing), indemnity clauses, termination clauses, dispute resolution procedures, terms and conditions.\n-   **Financial & Payment:** Invoicing procedures, payment schedules, net payment terms (e.g., Net 30), late payment penalties, project budgets, hourly rates, fixed-fee structures, expense reimbursement policies, tax forms (e.g., W-9, 1099-NEC information).\n-   **Communication & Collaboration:** Client feedback processes, preferred communication channels (e.g., Slack, email), meeting schedules, project management tool information (e.g., Asana, Trello), contact information for client stakeholders.\n-   **Workflow & Deadlines:** Project timelines, milestones, deliverable formats (e.g., specific file types, resolution requirements), asset delivery instructions, software requirements, proofing processes.\n-   **Business & Marketing:** Proposal requests, request for quotes (RFQs), marketing material guidelines, portfolio submission instructions, testimonials, case study requirements.\n-   **Industry Standards:** Best practices for creative fields (e.g., graphic design, web development, copywriting, video production), software version requirements, standard file naming conventions.\n\n#### Information to Ignore (Noise):\n-   Internal corporate HR policies for full-time employees.\n-   Employee benefits packages (e.g., 401k, health insurance).\n-   Company-wide financial reports not directly related to a specific project budget.\n-   Detailed internal company organizational charts or non-client-facing meeting minutes.\n-   Highly technical engineering specifications for non-creative products.\n-   Large-scale manufacturing processes or supply chain logistics.\n-   Academic research papers unrelated to creative trends or business operations."
}