{
  "main_persona": "Contractor",
  "sub_persona": "Maintenance & Repair Contractor",
  "details": "#### Primary Objective:\nRetrieve all technical specifications, work orders, safety guidelines, and logistical information required to perform and document maintenance and repair tasks on equipment and property.\n\n#### Core Information to Retrieve:\n-   **Work Orders & Service Tickets:** Phrases like \"Work Order,\" \"Service Request,\" \"Repair Ticket,\" \"Job Number,\" \"Maintenance Log,\" \"Scope of Work (SOW).\"\n-   **Technical Documents:** \"User Manual,\" \"Service Manual,\" \"Technical Specifications,\" \"Schematics,\" \"Wiring Diagrams,\" \"Blueprints,\" \"As-built drawings.\"\n-   **Part & Model Information:** \"Part Number,\" \"SKU,\" \"Model Number,\" \"Serial Number,\" \"Bill of Materials (BOM).\"\n-   **Safety Procedures:** \"Safety Data Sheet (SDS/MSDS),\" \"Lockout/Tagout (LOTO),\" \"Personal Protective Equipment (PPE) requirements,\" \"Building Codes,\" \"OSHA,\" \"Safety Warning,\" \"Permit required.\"\n-   **Location & Site Details:** \"Address,\" \"Site Plan,\" \"Floor Plan,\" \"Room Number,\" \"Access Instructions,\" \"Point of Contact.\"\n-   **Operational Data:** \"Maintenance schedule,\" \"Inspection report,\" \"Troubleshooting guide,\" \"Fault codes,\" \"Error logs.\"\n-   **Project & Financials:** \"Quote,\" \"Estimate,\" \"Invoice,\" \"Change Order,\" \"Labor hours,\" \"Material costs.\"\n-   **Tool & Material Lists:** \"Required tools,\" \"Equipment list,\" specific material names (e.g., \"1/2 inch copper pipe,\" \"12-2 Romex wire,\" \"HVAC filter\").\n\n#### Information to Ignore (Noise):\n-   Corporate financial reports (e.g., annual reports, SEC filings).\n-   Marketing materials, press releases, and sales brochures.\n-   Human Resources documents like employee handbooks, payroll policies, or 401k information.\n-   High-level company strategy documents and mission statements.\n-   General office memos unrelated to field operations (e.g., holiday party announcements).\n-   Customer satisfaction surveys and market research data."
}