{
  "main_persona": "Contract Manager",
  "sub_persona": "Construction Contract Manager",
  "details": "#### Primary Objective:\nRetrieve all contractual agreements, project specifications, financial terms, and legal compliance documentation essential for managing construction projects from inception to completion.\n\n#### Core Information to Retrieve:\n-   **Contract Documents:** Full contract texts (e.g., EPC, Lump Sum, Cost-Plus, Design-Build), all schedules, appendices, exhibits, and attachments.\n-   **Contract Clauses:** Specific clauses related to scope of work, payment terms, change orders, dispute resolution, liquidated damages, force majeure, indemnification, warranties, guarantees, bonds, insurance requirements, termination clauses.\n-   **Project Scope & Specifications:** Detailed scope of work, technical specifications, design documents, engineering drawings (references to them, not necessarily the drawings themselves for interpretation).\n-   **Financial Terms:** Payment schedules, progress payments, retainage, billing cycles, cost breakdowns, budget allocations, penalties, incentives, cost escalation clauses.\n-   **Change Management:** Change orders (variations), scope changes, extensions of time requests, change order logs, approval processes for changes.\n-   **Correspondence & Communication:** Official letters, emails, meeting minutes, RFI (Request for Information), submittals, transmittals, notices (e.g., notice to proceed, notice of delay).\n-   **Legal & Regulatory Compliance:** Applicable laws (e.g., building codes, environmental regulations, labor laws), permits, licenses, certifications, health and safety regulations.\n-   **Dispute Resolution:** Arbitration clauses, mediation agreements, litigation procedures, records of claims and counter-claims.\n-   **Risk Management:** Identified risks, mitigation strategies, insurance policies (types, coverage limits), performance bonds, payment bonds.\n-   **Project Schedule & Milestones:** Baseline schedules, revised schedules, critical path, key delivery dates, completion dates.\n-   **Stakeholder Information:** Names and contact details of contracting parties (owner, general contractor, subcontractors, suppliers), project managers, legal counsel.\n-   **Performance Metrics:** Key performance indicators (KPIs) specified in contracts, quality control requirements, acceptance criteria, defect lists, punch lists.\n\n#### Information to Ignore (Noise):\n-   Marketing brochures for construction companies or materials.\n-   General industry news or market analysis not directly impacting contract terms.\n-   Highly detailed engineering calculations or raw survey data (unless referenced as a contractual deliverable).\n-   Internal company HR policies or employee benefit documents unrelated to project personnel.\n-   Abstract academic research papers on construction techniques or materials.\n-   Personal correspondence between project team members unrelated to contractual matters.\n-   Supplier catalogues or price lists unless part of a specific bill of quantities or cost breakdown in a contract."
}