{
  "main_persona": "Contract Manager",
  "sub_persona": "Procurement Contract Manager",
  "details": "#### Primary Objective:\nRetrieve all key terms, obligations, risks, and performance metrics within procurement contracts to ensure supplier compliance and mitigate company risk.\n\n#### Core Information to Retrieve:\n-   **Parties:** Supplier name, vendor name, company name, legal entities.\n-   **Contractual Dates:** \"Effective Date,\" \"Execution Date,\" \"Term,\" \"Expiration Date,\" \"Renewal Date,\" \"Notice Period for renewal/termination.\"\n-   **Financial Terms:** Phrases like \"Pricing,\" \"Fees,\" \"Payment Terms\" (e.g., Net 30, Net 60), \"Invoicing Procedures,\" \"Discounts,\" \"Rebates,\" \"Cost,\" \"Price.\"\n-   **Scope & Deliverables:** \"Scope of Work\" (SOW), \"Statement of Work,\" \"Deliverables,\" \"Specifications,\" \"Service Level Agreement\" (SLA), \"Milestones.\"\n-   **Obligations & Performance:** \"Key Performance Indicators\" (KPIs), \"Acceptance Criteria,\" \"Warranties,\" \"Guarantees,\" \"Reporting Requirements.\"\n-   **Risk & Liability Clauses:** \"Limitation of Liability,\" \"Indemnification,\" \"Indemnity,\" \"Insurance Requirements,\" \"Confidentiality,\" \"Data Security,\" \"Force Majeure.\"\n-   **Compliance & Governance:** \"Governing Law,\" \"Jurisdiction,\" \"Dispute Resolution,\" \"Arbitration Clause,\" \"Compliance with Laws,\" \"Audit Rights.\"\n-   **Termination & Renewal:** \"Termination for Cause,\" \"Termination for Convenience,\" \"Cure Period,\" \"Auto-renewal,\" \"Renewal Option.\"\n-   **Identifiers & Amendments:** \"Contract Number,\" \"Agreement ID,\" \"Purchase Order Number\" (PO #), \"Amendment,\" \"Addendum,\" \"Change Order.\"\n\n#### Information to Ignore (Noise):\n-   Marketing materials, brochures, or press releases from either party.\n-   Internal company emails or meeting minutes not directly constituting a formal contract notice or amendment.\n-   Technical manuals or engineering schematics not explicitly listed as a deliverable.\n-   Company HR documents, employee handbooks, or internal policies.\n-   Sales contracts where the company is the seller, not the buyer.\n-   Superseded drafts or expired versions of contracts.\n-   General financial reports (e.g., quarterly earnings) of either company."
}