{
  "main_persona": "Contract Manager",
  "sub_persona": "Contract Compliance Manager",
  "details": "#### Primary Objective:\nRetrieve all terms, conditions, deadlines, and performance metrics from executed agreements to monitor and enforce contractual compliance.\n\n#### Core Information to Retrieve:\n-   **Obligations & Deliverables:** Phrases like \"shall provide,\" \"must deliver,\" \"agrees to,\" \"scope of work,\" \"SOW,\" \"list of deliverables.\"\n-   **Deadlines & Timelines:** Specific dates, renewal dates, expiration dates, notice periods, and terms like \"within X days of,\" \"no later than,\" \"milestone schedule.\"\n-   **Performance Metrics:** Keywords such as \"Service Level Agreement,\" \"SLA,\" \"Key Performance Indicator,\" \"KPI,\" \"acceptance criteria,\" \"uptime,\" \"response time,\" \"quality standards.\"\n-   **Compliance & Regulatory Clauses:** References to specific laws or regulations (e.g., \"GDPR,\" \"HIPAA,\" \"SOX,\" \"in accordance with applicable law\"), and terms like \"compliance,\" \"audit rights,\" \"inspection.\"\n-   **Reporting Requirements:** Clauses detailing requirements for \"reports,\" \"certifications,\" \"notices,\" \"record keeping,\" and \"documentation.\"\n-   **Consequences of Non-Compliance:** Terms defining \"breach,\" \"default,\" \"cure period,\" \"penalty,\" \"liquidated damages,\" \"termination for cause,\" \"remedies.\"\n-   **Key Risk & Liability Clauses:** Sections titled \"Indemnification,\" \"Limitation of Liability,\" \"Insurance,\" \"Confidentiality,\" \"Data Security.\"\n-   **Payment & Invoicing Conditions:** Phrases linking payment to performance, such as \"upon successful completion,\" \"subject to acceptance of,\" \"invoice requirements.\"\n\n#### Information to Ignore (Noise):\n-   Pre-contractual documents like \"Letter of Intent (LOI),\" \"Memorandum of Understanding (MOU),\" initial \"proposals,\" or \"quotes\" that are not incorporated into the final contract.\n-   Draft versions of contracts, negotiation history, redlines, and internal comments.\n-   Standard boilerplate clauses that do not contain actionable obligations (e.g., \"Entire Agreement,\" \"Severability,\" \"Headings,\" \"Counterparts\").\n-   Recitals or \"whereas\" clauses that provide background but create no binding obligation.\n-   Marketing materials, pitch decks, or sales brochures.\n-   Internal financial analysis, profit margin calculations, or budget approval forms associated with the contract."
}