{
  "main_persona": "Contract Manager",
  "sub_persona": "Grants Contract Manager",
  "details": "#### Primary Objective:\nRetrieve all information pertaining to the lifecycle, compliance, financial management, and legal aspects of grant agreements and related contracts.\n\n#### Core Information to Retrieve:\n-   **Grant Agreement Details:** \"Grant agreement,\" \"award notice,\" \"cooperative agreement,\" \"sub-award,\" \"prime recipient,\" \"subrecipient,\" \"grantee,\" \"grantor,\" \"terms and conditions,\" \"award period,\" \"effective date,\" \"termination clause.\"\n-   **Financial & Budgetary Data:** \"Budget,\" \"expenditures,\" \"allowable costs,\" \"unallowable costs,\" \"cost share,\" \"matching funds,\" \"indirect costs,\" \"direct costs,\" \"payment schedule,\" \"invoicing,\" \"financial reporting,\" \"audit requirements,\" \"closeout financial report.\"\n-   **Compliance & Regulations:** \"Uniform Guidance (2 CFR Part 200),\" \"OMB Circulars,\" \"federal regulations,\" \"state regulations,\" \"agency guidelines,\" \"compliance checks,\" \"reporting requirements,\" \"ethical guidelines,\" \"data privacy,\" \"intellectual property rights.\"\n-   **Contractual Clauses & Terms:** \"Scope of work,\" \"deliverables,\" \"milestones,\" \"performance metrics,\" \"amendments,\" \"modifications,\" \"indemnification,\" \"liability,\" \"dispute resolution,\" \"governing law,\" \"force majeure,\" \"confidentiality,\" \"assignment.\"\n-   **Reporting & Documentation:** \"Progress reports,\" \"technical reports,\" \"financial reports,\" \"audit reports,\" \"closeout documentation,\" \"project narratives,\" \"performance plans.\"\n-   **Risk Management:** \"Risk assessment,\" \"mitigation strategies,\" \"compliance risks,\" \"financial risks,\" \"reputational risks.\"\n-   **Proposal & Application Materials:** Grant proposals, budget justifications, letters of intent, certifications, representations.\n-   **Stakeholder Information:** Contact details for grantor representatives, subrecipients, principal investigators, and project managers.\n\n#### Information to Ignore (Noise):\n-   General marketing brochures for non-grant-funded services or products.\n-   Public relations announcements unrelated to specific grant awards or outcomes.\n-   Detailed technical specifications or research data from projects not directly linked to grant deliverables.\n-   Internal HR policies or employee performance reviews not impacting grant personnel.\n-   General financial statements or investment portfolios of the organization, unless directly linked to grant-specific audits.\n-   Construction plans or facility management documents unrelated to grant-funded infrastructure projects.\n-   Non-contractual internal departmental meeting minutes or general administrative memos."
}