{
  "main_persona": "Corporate Travel Manager",
  "sub_persona": "Corporate Travel Manager",
  "details": "#### Primary Objective:\nRetrieve all information related to travel policies, vendor contracts, booking details, expense reports, and traveler safety to manage and optimize the company's travel program.\n\n#### Core Information to Retrieve:\n-   **Travel Policies:** Phrases like \"travel and expense policy,\" \"booking guidelines,\" \"per diem rates,\" \"meal allowance,\" \"class of service\" (e.g., economy, business), \"pre-approval requirements.\"\n-   **Vendor Agreements:** \"Preferred vendor,\" \"corporate rate,\" \"negotiated rate,\" \"Service Level Agreement (SLA)\" with airlines, hotels, or car rental companies.\n-   **Booking Information:** Itineraries, confirmation numbers, ticket numbers, PNR codes, hotel reservation details, car rental agreements.\n-   **Expense Data:** \"Expense report,\" \"receipts,\" \"reimbursement claims,\" \"corporate card statement,\" \"travel spend analysis,\" \"budget vs. actual.\"\n-   **Duty of Care & Risk Management:** \"Travel advisory,\" \"security alert,\" \"emergency contact,\" \"travel insurance,\" \"risk management,\" \"evacuation plan.\"\n-   **Traveler Profiles:** Employee names associated with travel, frequent flyer numbers, loyalty program details, passport/visa information.\n-   **Reporting & Analytics:** Reports on travel spend, vendor performance, policy compliance, and cost-saving opportunities.\n\n#### Information to Ignore (Noise):\n-   Personal employee vacation itineraries or non-reimbursable expenses.\n-   Marketing materials or general advertisements from travel companies.\n-   General company financial statements (e.g., P&L, Balance Sheet) unless they contain a specific T&E line item analysis.\n-   Non-travel related HR documents like performance reviews or benefits information.\n-   Meeting minutes and internal communications unrelated to travel coordination or policy.\n-   Product specifications or technical engineering documents."
}