{
  "main_persona": "Corporate Travel Manager",
  "sub_persona": "Strategic Travel & Sourcing Manager",
  "details": "#### Primary Objective:\nRetrieve all strategic information related to travel vendor sourcing, contract negotiations, policy compliance, and cost analysis to manage and optimize the corporate travel program.\n\n#### Core Information to Retrieve:\n-   **Vendor & Sourcing Documents:** \"Request for Proposal\" (RFP), \"Service Level Agreement\" (SLA), \"Master Service Agreement\" (MSA), \"Preferred Supplier\" lists, and vendor contracts with airlines, hotels, car rental agencies, and Travel Management Companies (TMCs).\n-   **Financial & Cost Data:** \"Travel spend analysis,\" \"budget vs. actual\" reports, \"cost savings\" reports, \"average ticket price\" (ATP), \"average daily rate\" (ADR) for hotels, ancillary fee reports, and data on \"leakage\" or out-of-policy spend.\n-   **Negotiation Terms:** Phrases like \"negotiated rates,\" \"corporate discount,\" \"volume-based pricing,\" \"soft dollar funds,\" \"rebates,\" \"commission,\" \"net fare.\"\n-   **Travel Policy Content:** \"Travel and Expense Policy\" documents, \"duty of care\" protocols, \"risk management\" procedures, booking channel rules, \"class of service\" rules (e.g., economy, business), and pre-trip approval workflows.\n-   **Performance Metrics:** \"Quarterly Business Review\" (QBR) documents, vendor performance data, Key Performance Indicators (KPIs), online booking tool (OBT) adoption rates, and traveler satisfaction scores.\n-   **Industry & Technology Terms:** \"New Distribution Capability\" (NDC), \"Global Distribution System\" (GDS), \"Sustainable Aviation Fuel\" (SAF), \"sustainability\" metrics, travel industry benchmarks, and information on expense management platforms (e.g., Concur, Expensify).\n-   **Supplier Contact Information:** Account manager names, contact details, and escalation points for key suppliers.\n\n#### Information to Ignore (Noise):\n-   Individual employee expense reports and line-item receipts (e.g., a single meal or taxi receipt). The focus is on aggregate data, not individual transactions.\n-   Specific, low-level travel itineraries for non-executive employees.\n-   Marketing brochures, product catalogs, and sales materials from non-travel vendors.\n-   Internal HR documents such as performance reviews, payroll records, or non-travel-related employee complaints.\n-   Corporate financial statements, investor relations reports, and stock performance data.\n-   Technical IT documentation unrelated to the booking tool or expense platform.\n-   Facilities management documents like office leases or utility bills."
}