{
  "main_persona": "Corporate Travel Manager",
  "sub_persona": "Global Corporate Travel Manager",
  "details": "#### Primary Objective:\nRetrieve all information related to travel policies, vendor contracts, risk management, and booking procedures to effectively manage the company's global travel program.\n\n#### Core Information to Retrieve:\n-   **Travel & Expense (T&E) Policies:** Documents defining rules for airfare class, hotel star ratings, meal per diems, ground transportation, and expense reporting. Look for phrases like \"travel policy,\" \"T&E guidelines,\" \"expense reimbursement,\" \"per diem rates.\"\n-   **Vendor Contracts & Agreements:** Contracts, service level agreements (SLAs), and pricing sheets with airlines, hotels, car rental agencies, and Travel Management Companies (TMCs). Search for corporate account numbers, negotiated rates, and terms like \"preferred supplier,\" \"corporate rate,\" \"master agreement.\"\n-   **Global Risk & Safety:** Travel advisories, security alerts, duty of care protocols, and emergency evacuation plans. Keywords include \"duty of care,\" \"risk management,\" \"travel security,\" \"visa requirements,\" \"passport information,\" \"medical assistance.\"\n-   **Booking & Approval Processes:** Information on how to use online booking tools (e.g., Concur, Egencia), contact details for travel agents, and documentation of approval workflows.\n-   **Financial Data & Reporting:** Travel spend reports, budget vs. actual analyses, vendor invoices, and cost-saving initiative reports. Look for \"travel spend,\" \"T&E budget,\" \"invoice,\" \"reconciliation.\"\n-   **Traveler Communications:** Pre-trip approval emails, travel itineraries, policy update announcements, and traveler support contact lists.\n-   **Sustainability Metrics:** Data and reports related to the carbon footprint of business travel, sustainable aviation fuel (SAF) programs, and eco-friendly hotel partnerships.\n\n#### Information to Ignore (Noise):\n-   Individual employee expense reports, except as part of an aggregated data set.\n-   Tourist guides, leisure travel promotions, or general marketing materials from vendors.\n-   Non-travel related corporate policies (e.g., IT usage, HR performance reviews).\n-   General company financial statements not specific to travel and entertainment spend.\n-   Internal meeting minutes for departments unrelated to travel operations.\n-   Personal employee information beyond what is required for a traveler profile (e.g., name, contact, passport number)."
}