{
  "main_persona": "Corporate Travel Manager",
  "sub_persona": "Regional Travel Manager",
  "details": "#### Primary Objective:\nOptimize and manage all aspects of business travel for employees within a specific region, ensuring compliance with company policies, cost efficiency, and traveler safety.\n\n#### Core Information to Retrieve:\n-   **Travel Policies & Guidelines:** Company travel policy documents, regional exceptions, expense reimbursement rules, per diem rates, approval workflows.\n-   **Vendor Contracts & Agreements:** Preferred airline agreements, hotel corporate rates, car rental contracts, ground transportation agreements, GDS (Global Distribution System) agreements.\n-   **Supplier Contact Information:** Account manager contacts for airlines, hotels, car rental companies, travel agencies (TMCs), and technology providers.\n-   **Regional Travel Advisories:** Safety and security alerts for specific regions or countries, health warnings, political stability updates, natural disaster alerts.\n-   **Visa & Immigration Requirements:** Specific visa application procedures, passport validity rules, entry/exit requirements for various countries within the region.\n-   **Traveler Data & Profiles:** Employee travel preferences, loyalty program numbers, passport details, emergency contact information, department cost centers.\n-   **Booking Platform Information:** User guides and troubleshooting for online booking tools (OBTs), corporate travel portals, mobile travel apps.\n-   **Expense Reports & Analytics:** Travel spend data, budget vs. actual reports, cost savings initiatives, vendor performance metrics, carbon footprint reports related to travel.\n-   **Emergency Procedures:** Crisis management protocols, emergency contact numbers for travelers, travel insurance policy details, medical assistance providers.\n-   **Invoicing & Billing Details:** Vendor invoices, centralized billing statements, payment terms, reconciliation reports.\n-   **Meeting & Event Logistics:** Information on group bookings, event venue contracts, shuttle services for corporate events.\n\n#### Information to Ignore (Noise):\n-   Company-wide HR policy documents unrelated to travel (e.g., performance reviews, benefits unrelated to travel).\n-   Detailed product development plans or R&D reports.\n-   Marketing campaign briefs or creative assets.\n-   Customer service call logs unrelated to travel complaints.\n-   Proprietary technical specifications or engineering diagrams.\n-   General financial market news or stock performance (unless directly impacting travel costs like fuel prices).\n-   Inter-departmental memos on non-travel operations (e.g., IT infrastructure upgrades, sales targets).\n-   Legal documents unrelated to travel contracts, liability, or compliance."
}