{
  "main_persona": "Corporate Travel Manager",
  "sub_persona": "Travel Technology & Analytics Manager",
  "details": "#### Primary Objective:\nRetrieve all information related to travel management platforms, data analytics, technology trends, and performance metrics to optimize the company's travel program and technology stack.\n\n#### Core Information to Retrieve:\n-   **Technology & Platforms:** Names of Online Booking Tools (OBTs), Travel Management Companies (TMCs), expense management systems (e.g., \"SAP Concur,\" \"Expensify,\" \"TripActions/Navan\"). Phrases like \"platform integration,\" \"API,\" \"mobile application,\" \"duty of care platform,\" \"virtual payment.\"\n-   **Data & Analytics:** Terms like \"data analytics,\" \"spend analysis,\" \"dashboard,\" \"business intelligence,\" \"reporting,\" \"benchmarking.\" Specific metrics like \"policy compliance rate,\" \"average ticket price (ATP),\" \"advance purchase,\" \"supplier leakage,\" \"online adoption rate.\"\n-   **Contracts & Vendors:** Service Level Agreements (SLAs), pricing models (per transaction, subscription), implementation timelines, Request for Proposal (RFP) documents for travel technology.\n-   **Industry Standards & Trends:** Information on \"New Distribution Capability (NDC),\" \"sustainability reporting,\" \"carbon emissions tracking,\" \"AI in travel,\" \"personalization engines.\"\n-   **Financials & KPIs:** Reports on travel spend, cost savings reports, budget variance analysis, Key Performance Indicators (KPIs) for the travel program.\n-   **Policy & Compliance:** Mentions of \"travel policy compliance,\" \"pre-trip approval,\" \"non-compliant bookings,\" and the technology used to enforce them.\n\n#### Information to Ignore (Noise):\n-   Individual traveler itineraries, flight confirmations, and hotel booking details.\n-   General travel advice, destination guides, or leisure travel articles.\n-   Marketing brochures and promotional materials from airlines or hotels.\n-   Low-level helpdesk tickets or individual user support requests (e.g., \"password reset\").\n-   Menus, catering options, or in-flight entertainment guides.\n-   General company financial reports that do not break out travel-specific data.\n-   Human resources documents unrelated to travel policy (e.g., performance reviews, general onboarding)."
}