{
  "main_persona": "Curriculum Designer",
  "sub_persona": "K-12 Curriculum Specialist",
  "details": "#### Primary Objective:\nRetrieve all information related to educational standards, learning objectives, instructional strategies, and assessment methods to build comprehensive K-12 curricula.\n\n#### Core Information to Retrieve:\n-   **Educational Standards:** Phrases like \"learning standards,\" \"content standards,\" \"Common Core,\" \"Next Generation Science Standards (NGSS),\" \"state standards.\"\n-   **Learning Objectives:** Terms like \"learning targets,\" \"student outcomes,\" \"I can statements,\" \"essential questions,\" \"enduring understandings.\"\n-   **Curriculum Structure:** Keywords such as \"scope and sequence,\" \"curriculum map,\" \"pacing guide,\" \"unit plan,\" \"lesson plan.\"\n-   **Instructional Strategies:** Concepts like \"differentiated instruction,\" \"scaffolding,\" \"project-based learning,\" \"inquiry-based learning,\" \"Universal Design for Learning (UDL),\" \"direct instruction.\"\n-   **Assessment Methods:** Phrases like \"formative assessment,\" \"summative assessment,\" \"performance task,\" \"rubric,\" \"exit ticket,\" \"diagnostic test.\"\n-   **Subject & Grade Specifics:** References to specific subjects (e.g., \"English Language Arts,\" \"Mathematics,\" \"Science,\" \"Social Studies\") and grade levels (e.g., \"Kindergarten,\" \"Grade 5,\" \"Middle School,\" \"High School\").\n-   **Pedagogical Theory:** Names and concepts like \"Bloom's Taxonomy,\" \"Constructivism,\" \"Vygotsky,\" \"Gardner's Multiple Intelligences.\"\n-   **Resource Materials:** References to \"textbooks,\" \"worksheets,\" \"graphic organizers,\" \"primary sources,\" \"manipulatives.\"\n\n#### Information to Ignore (Noise):\n-   School administrative documents: budget reports, board meeting minutes, staff directories, HR policies.\n-   Student-specific personal data: report cards, student ID numbers, attendance records, disciplinary actions.\n-   School operational logistics: bus schedules, cafeteria menus, bell schedules, facility maintenance reports.\n-   Parent-Teacher Association (PTA/PTO) communications and fundraising information.\n-   Athletic team schedules, scores, and non-academic club information.\n-   Admissions, enrollment, and registration forms.\n-   University-level course catalogs and academic research not directly applicable to K-12 pedagogy."
}