{
  "main_persona": "Curriculum Designer",
  "sub_persona": "Adult Basic Education Curriculum Developer",
  "details": "#### Primary Objective:\nRetrieve all relevant educational standards, instructional materials, teaching methodologies, and assessment tools needed to develop effective foundational curricula for adult learners.\n\n#### Core Information to Retrieve:\n-   **Educational Standards & Frameworks:** \"College and Career Readiness Standards\" (CCRS), \"National Reporting System\" (NRS), \"CASAS Competencies,\" \"TABE,\" \"Workforce Innovation and Opportunity Act\" (WIOA), \"ESL proficiency levels,\" \"digital literacy framework.\"\n-   **Instructional Methodologies:** Phrases like \"andragogy,\" \"adult learning theory,\" \"scaffolding,\" \"differentiated instruction,\" \"contextualized instruction,\" \"project-based learning,\" \"trauma-informed practices.\"\n-   **Core Subject Content:**\n    -   **Literacy:** Leveled reading passages, phonics activities, vocabulary lists, sight words, reading comprehension strategies, functional writing prompts (e.g., writing an email, filling out a form).\n    -   **Numeracy:** Real-world math problems (budgeting, measurement, taxes), basic arithmetic, fractions, percentages, basic algebra concepts.\n-   **High School Equivalency (HSE):** \"GED practice tests,\" \"HiSET prep,\" \"social studies concepts,\" \"basic science principles.\"\n-   **Assessment Tools:** \"Formative assessment,\" \"summative assessment,\" \"rubrics,\" \"portfolio assessment,\" \"placement tests,\" \"skills checklists,\" \"learning objectives.\"\n-   **Life & Work Skills:** \"Soft skills,\" \"employability skills,\" \"digital citizenship,\" \"financial literacy,\" \"health literacy,\" \"career pathways.\"\n\n#### Information to Ignore (Noise):\n-   K-12 specific pedagogical terms (e.g., \"child development,\" \"elementary school lesson plans,\" \"IEP\" unless for context).\n-   Advanced academic content from higher education (e.g., graduate-level syllabi, doctoral research, specialized university courses).\n-   Corporate training materials focused on specific proprietary software or sales techniques.\n-   University administrative documents like budget reports, tenure policies, or strategic plans.\n-   Highly theoretical academic papers not directly applicable to ABE instructional design.\n-   Marketing materials for student recruitment or university branding."
}