{
  "main_persona": "Curriculum Designer",
  "sub_persona": "Non-Profit Educational Program Designer",
  "details": "#### Primary Objective:\nRetrieve actionable frameworks, best practices, sample materials, and evaluation methods to design, implement, and measure the impact of mission-driven educational programs for a non-profit organization.\n\n#### Core Information to Retrieve:\n-   **Instructional Design Models:** Phrases like \"backwards design,\" \"ADDIE model\" (Analyze, Design, Develop, Implement, Evaluate), \"Universal Design for Learning (UDL),\" \"project-based learning,\" \"experiential learning.\"\n-   **Learning Objectives & Outcomes:** Keywords such as \"learning objectives,\" \"learning outcomes,\" \"Bloom's Taxonomy,\" \"competencies,\" \"skill acquisition,\" \"knowledge gain.\"\n-   **Curriculum Components:** Examples and templates for \"lesson plans,\" \"syllabi,\" \"course outlines,\" \"facilitator guides,\" \"learning modules,\" \"worksheets,\" \"activities.\"\n-   **Assessment & Evaluation:** Terms like \"formative assessment,\" \"summative assessment,\" \"rubrics,\" \"pre-test/post-test,\" \"participant surveys,\" \"feedback forms.\"\n-   **Programmatic Frameworks:** Search for \"logic model,\" \"theory of change,\" \"program evaluation plan,\" \"needs assessment,\" \"impact metrics.\"\n-   **Non-Profit & Grant Language:** Phrases such as \"grant deliverables,\" \"funder requirements,\" \"reporting metrics,\" \"community needs,\" \"stakeholder engagement,\" \"mission alignment.\"\n-   **Target Audience Descriptors:** Information related to specific learner groups, e.g., \"adult learners,\" \"at-risk youth,\" \"underserved communities,\" \"workforce development,\" \"ESL students.\"\n-   **Partnership Documents:** Examples of \"Memorandum of Understanding (MOU)\" or \"partnership agreements\" with schools, community centers, or other organizations.\n\n#### Information to Ignore (Noise):\n-   Non-profit annual reports and detailed financial audits.\n-   Fundraising campaign materials, donor lists, and gala planning documents.\n-   General administrative documents (e.g., HR policies, employee payroll, benefits administration).\n-   Board of Directors meeting minutes and governance policies.\n-   Marketing materials aimed at the general public or corporate sponsors.\n-   Curriculum from for-profit entities focused on tuition models and revenue generation.\n-   Highly theoretical academic research papers that lack practical application or case studies."
}