{
  "main_persona": "Curriculum Designer",
  "sub_persona": "Vocational Training Curriculum Developer",
  "details": "#### Primary Objective:\nRetrieve all materials related to industry standards, practical skills, learning objectives, and assessment methods to develop effective vocational training programs.\n\n#### Core Information to Retrieve:\n-   **Industry & Job Requirements:** Job descriptions, competency models, required skill lists, industry standards (e.g., ANSI, ISO), professional certification requirements (e.g., CompTIA A+, ASE, AWS Certified Welder).\n-   **Technical Skills & Procedures:** Phrases like \"how to,\" \"step-by-step guide,\" \"standard operating procedure (SOP),\" \"best practices,\" and specific techniques (e.g., \"MIG welding,\" \"phlebotomy procedure,\" \"troubleshooting circuits\").\n-   **Learning Objectives & Outcomes:** Explicit statements of learning goals, using phrases like \"learning objectives,\" \"student will be able to,\" \"course outcomes,\" \"competencies.\"\n-   **Assessment & Evaluation:** Rubrics, practical exam outlines, hands-on assessment criteria, skill demonstration checklists, capstone project requirements, portfolio examples.\n-   **Safety & Compliance:** Safety protocols (e.g., OSHA guidelines), compliance regulations (e.g., HIPAA for healthcare training), equipment safety warnings, material safety data sheets (MSDS).\n-   **Tools, Equipment, & Software:** Lists of required tools, specific equipment models, necessary software applications (e.g., \"AutoCAD,\" \"QuickBooks,\" \"Adobe Premiere Pro\"), and material lists.\n-   **Curriculum Structure:** Course outlines, syllabi for vocational/technical courses, module descriptions, lesson plans, training schedules.\n-   **Soft Skills Content:** Training modules or content related to \"workplace communication,\" \"teamwork,\" \"problem-solving,\" \"customer service,\" and \"professionalism.\"\n\n#### Information to Ignore (Noise):\n-   Theoretical academic research papers and dissertations outside of applied vocational science.\n-   Curricula for purely academic subjects (e.g., literature, philosophy, history, theoretical mathematics).\n-   General university/college administrative documents (e.g., financial reports, board meeting minutes, strategic plans).\n-   Student life information, campus event flyers, and sports schedules.\n-   Admissions and marketing materials for prospective students.\n-   Alumni newsletters and fundraising campaigns.\n-   General HR policies for faculty and staff (e.g., tenure tracks, benefits)."
}