{
  "main_persona": "Curriculum Designer",
  "sub_persona": "Government & Compliance Training Designer",
  "details": "#### Primary Objective:\nRetrieve all relevant laws, regulations, policies, procedures, and official guidance to serve as source material for designing comprehensive government and compliance training courses.\n\n#### Core Information to Retrieve:\n-   **Legal & Regulatory Text:** Specific laws, statutes, and regulations. Search for phrases like \"Code of Federal Regulations (CFR),\" \"United States Code (U.S.C.),\" \"Public Law,\" \"Executive Order,\" \"Statute,\" \"Directive.\"\n-   **Agency-Specific Policies:** Internal policy documents, handbooks, manuals, and standard operating procedures (SOPs). Look for terms like \"Agency Policy,\" \"Instruction,\" \"Guidance Document,\" \"Standard Operating Procedure,\" \"Employee Handbook.\"\n-   **Compliance Topics:** Key terms related to common government compliance areas:\n    -   **Ethics:** \"Conflict of Interest,\" \"Code of Conduct,\" \"Gift Rule,\" \"Hatch Act,\" \"Anti-Bribery.\"\n    -   **Security:** \"Information Security,\" \"Cybersecurity,\" \"Controlled Unclassified Information (CUI),\" \"OPSEC,\" \"Personnel Security,\" \"Clearance,\" \"Insider Threat.\"\n    -   **Privacy:** \"Privacy Act of 1974,\" \"Personally Identifiable Information (PII),\" \"Data Protection,\" \"Data Breach Response.\"\n    -   **Procurement & Fiscal Law:** \"Federal Acquisition Regulation (FAR),\" \"Contracting,\" \"Appropriations Law,\" \"Anti-Deficiency Act,\" \"Fiscal Law.\"\n    -   **Civil Rights & EEO:** \"Equal Employment Opportunity (EEO),\" \"Anti-Harassment,\" \"Reasonable Accommodation,\" \"Americans with Disabilities Act (ADA),\" \"Title VII.\"\n-   **Enforcement & Auditing:** Documents that provide real-world examples and consequences. Keywords: \"Inspector General Report,\" \"GAO Report,\" \"Lessons Learned,\" \"Case Study,\" \"Enforcement Action,\" \"Audit Findings,\" \"Compliance Audit.\"\n-   **Definitions & Glossaries:** Sections within documents that define key terminology and list acronyms.\n-   **Official Forms & Checklists:** Specific government forms (e.g., \"SF-86,\" \"OF-306\") and official compliance checklists that employees must use.\n\n#### Information to Ignore (Noise):\n-   Press releases, public-facing news articles, and media advisories.\n-   Routine administrative communications like meeting agendas, general newsletters, or office memos.\n-   Public comments or testimony submitted during the rulemaking process.\n-   University research papers or academic theories about governance.\n-   Detailed budget breakdowns, financial statements, or appropriation tables (unless directly used in fiscal law examples).\n-   Specific, individual personnel records or résumés.\n-   Raw, unanalyzed data sets."
}