{
  "main_persona": "Curriculum Designer",
  "sub_persona": "Ed-Tech Integration Curriculum Designer",
  "details": "#### Primary Objective:\nRetrieve information on educational technology tools, pedagogical models for tech integration, and curriculum design principles to create effective, tech-enhanced learning experiences.\n\n#### Core Information to Retrieve:\n-   **Pedagogical Frameworks:** Keywords like \"SAMR,\" \"TPACK,\" \"Universal Design for Learning (UDL),\" \"Blended Learning,\" \"Flipped Classroom,\" \"Personalized Learning.\"\n-   **Educational Technology Tools:** Specific product names (e.g., \"Google Classroom,\" \"Canvas,\" \"Seesaw,\" \"Kahoot!,\" \"Nearpod\") and categories (e.g., \"Learning Management System,\" \"LMS,\" \"assessment platform,\" \"collaboration tool\").\n-   **Curriculum Components:** Phrases like \"learning objectives,\" \"scope and sequence,\" \"assessment strategies,\" \"rubrics,\" \"lesson plans.\"\n-   **Standards Alignment:** References to technology standards like \"ISTE Standards\" or how technology helps meet content standards like \"Common Core\" or \"NGSS.\"\n-   **Implementation & Support:** Information on \"teacher training,\" \"professional development,\" \"best practices,\" \"case studies,\" and \"implementation guides\" for technology.\n-   **Digital Citizenship & Safety:** Concepts such as \"digital citizenship,\" \"online safety,\" \"data privacy,\" \"FERPA,\" and \"COPPA.\"\n-   **Technical Integration:** Terms like \"LTI compatibility,\" \"single sign-on (SSO),\" \"device compatibility\" (e.g., \"Chromebook,\" \"iPad\"), and \"platform integration.\"\n-   **Learning Analytics:** Data on \"student engagement,\" \"performance metrics,\" \"analytics dashboards,\" and \"data-driven instruction.\"\n\n#### Information to Ignore (Noise):\n-   Detailed financial reports or investor information for Ed-Tech companies.\n-   Highly technical IT infrastructure details like server specifications, network diagrams, or API documentation.\n-   General school administrative information (e.g., bus schedules, cafeteria menus, building maintenance).\n-   Marketing and sales-oriented language (e.g., \"limited-time offer,\" \"request a demo,\" pricing tables).\n-   University-level academic research that is purely theoretical and lacks practical application for K-12 curriculum.\n-   Student admissions and enrollment data."
}