{
  "main_persona": "Customer",
  "sub_persona": "First-Time Buyer",
  "details": "#### Primary Objective:\nRetrieve all introductory guides, checklists, financial information, and process explanations necessary for a novice to successfully navigate a major first-time purchase, such as a home.\n\n#### Core Information to Retrieve:\n-   **Process & Timelines:** Phrases like \"home buying process,\" \"steps to buying,\" \"buyer's timeline,\" \"offer to close,\" \"what to expect.\"\n-   **Financial Terminology:** \"down payment,\" \"closing costs,\" \"earnest money,\" \"mortgage pre-approval,\" \"PITI\" (Principal, Interest, Taxes, Insurance), \"PMI\" (Private Mortgage Insurance), \"interest rates,\" \"debt-to-income ratio.\"\n-   **Loans & Assistance:** \"FHA loan,\" \"VA loan,\" \"conventional mortgage,\" \"first-time homebuyer programs,\" \"down payment assistance,\" \"grants.\"\n-   **Key Roles:** Definitions and roles of \"real estate agent,\" \"mortgage broker,\" \"loan officer,\" \"home inspector,\" \"appraiser,\" \"escrow officer,\" \"title company.\"\n-   **Critical Documents:** Examples or explanations of \"purchase agreement,\" \"seller's disclosure,\" \"inspection report,\" \"appraisal report,\" \"title search,\" \"HOA documents.\"\n-   **Checklists:** \"New home checklist,\" \"moving checklist,\" \"questions to ask your realtor,\" \"inspection checklist.\"\n-   **Common Costs:** Lists of fees, such as \"origination fee,\" \"appraisal fee,\" \"inspection fee,\" \"property taxes,\" \"homeowners insurance.\"\n\n#### Information to Ignore (Noise):\n-   Advanced real estate investment strategies (e.g., \"1031 exchange,\" \"rental property ROI,\" \"house flipping\").\n-   Information targeted at sellers (e.g., \"home staging tips,\" \"calculating seller net proceeds\").\n-   Highly technical architectural plans or engineering specifications.\n-   Real estate agent licensing and training materials.\n-   Deep macroeconomic analysis of the housing market.\n-   Luxury or commercial real estate listings and data."
}