{
  "main_persona": "Customer",
  "sub_persona": "Budget-Conscious Buyer",
  "details": "#### Primary Objective:\nRetrieve all information related to pricing, discounts, promotions, product value, and total cost of ownership to identify the most financially advantageous purchasing options.\n\n#### Core Information to Retrieve:\n-   **Pricing & Costs:** Keywords like \"price,\" \"cost,\" \"fee,\" \"total,\" \"MSRP,\" and specific dollar amounts ($).\n-   **Discounts & Promotions:** Phrases like \"sale,\" \"discount,\" \"coupon,\" \"promo code,\" \"rebate,\" \"cash back,\" \"clearance,\" \"bundle deal,\" \"BOGO,\" \"% off,\" \"offer.\"\n-   **Value Propositions:** Terms such as \"best value,\" \"cost-effective,\" \"affordable,\" \"economical,\" \"budget-friendly.\"\n-   **Comparative Information:** Price comparison charts, mentions of competitor pricing, terms like \"vs\" or \"alternative to.\"\n-   **Total Cost of Ownership:** Information on \"warranty,\" \"guarantee,\" \"shipping cost,\" \"installation fee,\" \"maintenance,\" \"energy efficiency,\" \"refill cost,\" \"subscription fees,\" \"long-term.\"\n-   **Payment & Financing:** Details on \"payment plans,\" \"financing,\" \"APR,\" \"interest-free,\" \"layaway.\"\n-   **Condition of Goods:** For non-new items, search for \"used,\" \"refurbished,\" \"pre-owned,\" \"open-box,\" \"like-new.\"\n-   **Return Policies:** Keywords like \"return policy,\" \"money-back guarantee,\" \"refund.\"\n\n#### Information to Ignore (Noise):\n-   Brand history, company mission statements, and other marketing narratives.\n-   Descriptions of luxury, premium, or high-end features not related to core function.\n-   Technical specifications that have no direct bearing on cost, efficiency, or longevity.\n-   Company personnel information, like executive biographies or \"meet the team\" sections.\n-   Press releases or news articles about corporate-level activities (mergers, stock performance).\n-   In-depth legal disclaimers or terms of service, unless they specifically mention fees or charges."
}