{
  "main_persona": "Digital Nomad",
  "sub_persona": "Remote Corporate Employee",
  "details": "#### Primary Objective:\nRetrieve all corporate policies, travel logistics, and technical requirements needed to work effectively and remain compliant while traveling internationally.\n\n#### Core Information to Retrieve:\n-   **Corporate Policies:** Phrases like \"remote work policy,\" \"telecommuting agreement,\" \"work from anywhere,\" \"travel and expense policy,\" \"information security policy,\" \"data handling.\"\n-   **HR & Benefits:** International health insurance coverage details, travel insurance claims process, time-off policies, time zone expectations, and HR/IT support contact information.\n-   **Travel Logistics:** Flight itineraries, booking confirmation numbers, accommodation details (hotels, Airbnbs), visa application status, passport scans, and entry requirements for different countries.\n-   **Financial & Tax Information:** Expense report templates, reimbursement procedures, per diem rates, and documents related to tax residency, \"foreign earned income,\" and double taxation treaties.\n-   **Connectivity & IT:** VPN setup instructions, international data plan information, cybersecurity best practices for public Wi-Fi, and contact details for co-working spaces.\n-   **Work & Team:** Project deadlines, meeting schedules across multiple time zones (e.g., UTC, PST, CET), team contact lists, and reporting structures.\n\n#### Information to Ignore (Noise):\n-   Physical office information such as building access codes, parking permits, or local office event announcements.\n-   Company-wide press releases or news not directly impacting remote employees (e.g., new office openings, local community outreach).\n-   Marketing materials and tourist brochures for attractions.\n-   Detailed corporate financial statements (e.g., quarterly earnings reports).\n-   Internal documents for departments irrelevant to the employee's role (e.g., manufacturing supply chain logistics for a marketing employee).\n-   Local utility bills or home maintenance records from a previous permanent residence."
}