{
  "main_persona": "Digital Nomad",
  "sub_persona": "Virtual Assistant/Online Administrator",
  "details": "#### Primary Objective:\nRetrieve all actionable information related to client tasks, business administration, and travel logistics to efficiently manage a remote administrative business while traveling.\n\n#### Core Information to Retrieve:\n-   **Client & Project Data:** Client names, contact information, project briefs, statements of work (SOW), task lists, meeting minutes, deadlines, and action items.\n-   **Administrative Keywords:** Phrases like \"schedule meeting,\" \"book travel,\" \"data entry,\" \"transcribe,\" \"expense report,\" \"prepare presentation,\" \"manage calendar.\"\n-   **Financial Documents:** Invoices (to send and receive), receipts for expensing, payment confirmations, bank transfer details, and contracts.\n-   **Travel & Logistics:** Flight/train confirmations, accommodation bookings (Airbnb, Booking.com), visa requirements, travel insurance policies, co-working space memberships.\n-   **Communication:** Specific client requests from emails or chat logs (e.g., \"Can you please...\", \"I need you to...\"), meeting invitations, project status updates.\n-   **Tools & Credentials:** Usernames, software licenses, tutorials for platforms like Asana, Trello, Slack, Google Workspace, or specific client software.\n-   **Connectivity Information:** Details on internet providers, eSIM/SIM card information, VPN service details, Wi-Fi passwords.\n\n#### Information to Ignore (Noise):\n-   General marketing newsletters and promotional emails from clients' companies.\n-   Deeply technical or industry-specific content from client documents that is not part of a direct administrative task.\n-   Outdated travel documents (e.g., old flight confirmations, expired visas).\n-   Casual, non-task-oriented conversations from chat logs.\n-   Generic travel blogs or destination guides that are not related to a specific, planned trip.\n-   Client's internal HR documents or company-wide announcements not relevant to the VA's role."
}