{
  "main_persona": "Digital Nomad",
  "sub_persona": "Passive Income Investor",
  "details": "#### Primary Objective:\nRetrieve comprehensive information on passive income streams, investment opportunities, and financial management tools suitable for a location-independent individual.\n\n#### Core Information to Retrieve:\n-   **Passive Investment Types:** \"Dividend stocks,\" \"REITs\" (Real Estate Investment Trusts), \"index funds,\" \"ETFs,\" \"high-yield savings accounts,\" \"peer-to-peer (P2P) lending,\" \"crowdfunded real estate.\"\n-   **Digital & Automated Income:** \"Royalty income,\" \"affiliate marketing,\" \"digital product sales,\" \"staking cryptocurrency,\" \"yield farming,\" \"automated trading bots.\"\n-   **Financial Concepts & Strategies:** \"Passive income,\" \"financial independence,\" \"FIRE movement,\" \"asset allocation,\" \"diversification,\" \"compounding interest,\" \"risk management.\"\n-   **Performance Metrics:** \"Return on Investment (ROI),\" \"dividend yield,\" \"annualized return,\" \"expense ratio,\" \"cash flow.\"\n-   **Tools & Platforms:** \"Robo-advisors,\" \"online brokerage,\" \"investment apps,\" \"portfolio management software,\" \"crypto exchanges.\"\n-   **Nomad-Specific Finance:** \"Tax optimization for nomads,\" \"foreign earned income exclusion,\" \"tax treaties,\" \"digital nomad visa,\" \"international banking,\" \"multi-currency accounts,\" \"offshore company formation.\"\n-   **Real Estate Terms (Passive):** \"Turnkey properties,\" \"rental yield,\" \"property management companies,\" \"short-term rental analytics.\"\n\n#### Information to Ignore (Noise):\n-   Active trading strategies (e.g., \"day trading,\" \"swing trading\").\n-   Traditional employment information (e.g., \"job listings,\" \"resume advice,\" \"corporate benefits\").\n-   Active business management topics (e.g., \"employee payroll,\" \"inventory management,\" \"customer service logs\").\n-   General travel content (e.g., \"tourist attraction reviews,\" \"packing lists,\" \"flight deals\").\n-   Consumer debt and spending (e.g., \"personal loans,\" \"credit card offers,\" \"store sales flyers\").\n-   Hyper-local, non-financial information (e.g., \"local community events,\" \"municipal meeting minutes\").\n-   Detailed corporate financial filings like 10-K or 10-Q reports."
}