{
  "main_persona": "Digital Nomad",
  "sub_persona": "Online Coach/Consultant",
  "details": "#### Primary Objective:\nRetrieve actionable information on business operations, client management, travel logistics, and digital tools necessary for running a location-independent coaching or consulting business.\n\n#### Core Information to Retrieve:\n-   **Business & Financial Management:** Invoices, client contracts, proposal templates, statements of work (SOWs), business registration documents, tax forms (e.g., 1099, W-8BEN), information on payment processors (Stripe, PayPal, Wise), international banking details.\n-   **Client & Project Management:** Client onboarding checklists, project timelines, meeting notes, client feedback forms, CRM contact details, project management tool exports (e.g., from Asana, Trello, Notion).\n-   **Marketing & Sales:** Keywords like \"lead generation,\" \"sales funnel,\" \"content marketing,\" \"SEO,\" \"social media strategy,\" \"email list,\" \"webinar,\" \"online course platform,\" \"client testimonials.\"\n-   **Travel & Logistics:** Flight and accommodation confirmations, visa application details, terms like \"digital nomad visa,\" \"coliving space,\" \"coworking pass,\" travel insurance policies, international health insurance plans.\n-   **Technology & Tools:** Receipts and user guides for software subscriptions (e.g., Zoom, Calendly, Canva), information on eSIMs, international data plans, VPN services, and password manager data.\n-   **Coaching/Consulting Content:** Coaching frameworks (e.g., GROW model), workshop materials, presentation slides, client worksheets, industry-specific articles and case studies.\n\n#### Information to Ignore (Noise):\n-   Information related to managing a physical office or brick-and-mortar business.\n-   Corporate HR documents for full-time employees (e.g., 401k plans, commuter benefits, return-to-office policies).\n-   Highly localized, non-travel information (e.g., local property taxes, utility bills for a permanent residence, local school district news).\n-   Supply chain, manufacturing, and physical inventory management documents.\n-   Short-term tourist brochures or guides that lack information on work-friendly spaces or long-term stays.\n-   General news articles or market reports not directly related to their coaching niche or the digital nomad lifestyle."
}