{
  "main_persona": "Digital Nomad",
  "sub_persona": "Digital Product Developer",
  "details": "#### Primary Objective:\nRetrieve all information related to digital product development, remote business management, and the logistical, legal, and financial aspects of maintaining a nomadic lifestyle.\n\n#### Core Information to Retrieve:\n-   **Product Development & Tech:** \"Software development lifecycle (SDLC),\" \"product roadmap,\" \"user stories,\" \"UX/UI design,\" \"API documentation,\" \"agile methodology,\" \"sprint planning,\" \"version control,\" \"CI/CD,\" \"cloud hosting\" (AWS, Azure, Google Cloud), \"SaaS.\"\n-   **Business & Marketing:** \"Go-to-market strategy,\" \"customer acquisition,\" \"SEO,\" \"content marketing,\" \"pricing models,\" \"subscription revenue,\" \"churn rate,\" \"LTV (Lifetime Value),\" \"CAC (Customer Acquisition Cost).\"\n-   **Contracts & Finance:** Client contracts, Statements of Work (SOW), invoices, payment receipts, wire transfer confirmations, \"Stripe Atlas,\" \"Delaware C Corp,\" \"business bank accounts.\"\n-   **Travel Logistics:** Flight itineraries, visa application forms, passport scans, \"digital nomad visa\" requirements, accommodation bookings (Airbnb, Booking.com), train/bus tickets.\n-   **Remote Work Infrastructure:** Names and reviews of \"co-working spaces,\" \"co-living spaces,\" receipts for membership fees, information on \"VPN services,\" \"internet speed tests,\" \"portable monitors.\"\n-   **Legal & Tax:** Information on \"tax residency,\" \"double taxation treaties,\" international health insurance policies (\"SafetyWing,\" \"World Nomads\"), business registration documents.\n\n#### Information to Ignore (Noise):\n-   Tourist guides and general travel articles that lack logistical details.\n-   Menus from restaurants or receipts for minor daily expenses (e.g., coffee, groceries).\n-   Marketing emails for physical products or local services unrelated to work.\n-   General news and political commentary.\n-   Highly theoretical academic papers on computer science or business.\n-   User manuals for household appliances or other physical goods."
}