{
  "main_persona": "Digital Nomad",
  "sub_persona": "Freelance Service Provider",
  "details": "#### Primary Objective:\nRetrieve actionable information on client acquisition, project management, international travel logistics, and financial administration for a location-independent freelance business.\n\n#### Core Information to Retrieve:\n-   **Client & Project Communications:** Phrases like \"new project inquiry,\" \"request for proposal (RFP),\" \"scope of work (SOW),\" \"project brief,\" \"client feedback,\" \"contract attached,\" \"onboarding documents.\"\n-   **Financial Transactions:** Keywords like \"invoice,\" \"receipt,\" \"payment confirmation,\" \"payment due,\" \"wire transfer details,\" \"SWIFT/BIC,\" \"IBAN,\" \"Wise,\" \"PayPal.\"\n-   **Travel Logistics:** Booking confirmations for flights, trains, and accommodations (hotels, Airbnb); rental car agreements; visa application details; travel itineraries.\n-   **Contracts & Legal Documents:** Independent contractor agreements, Master Service Agreements (MSAs), Non-Disclosure Agreements (NDAs), Statements of Work (SOWs).\n-   **Networking & Opportunities:** Invitations to online/in-person meetups, conference schedules, \"call for speakers,\" contact details of potential clients or collaborators.\n-   **Work Infrastructure:** Information on co-working space memberships, addresses, opening hours, Wi-Fi passwords, and VPN service details.\n-   **Tax & Business Admin:** Keywords like \"tax residency,\" \"W-9 form,\" \"1099,\" \"foreign earned income,\" \"business expense,\" \"double taxation treaty.\"\n-   **Insurance:** Details related to travel insurance policies, international health insurance claims, and professional liability insurance.\n\n#### Information to Ignore (Noise):\n-   Generic marketing newsletters and promotional spam.\n-   Unsolicited sales pitches for unrelated services.\n-   General news articles and political commentary.\n-   Social media notifications not related to professional networking (e.g., LinkedIn, professional groups).\n-   Tourist-focused content like sightseeing tour ads or museum flyers.\n-   Real estate listings for purchasing property or long-term, permanent rentals.\n-   Local community news that is not relevant to a temporary visitor (e.g., school board meetings, local elections)."
}