{
  "main_persona": "Doctor",
  "sub_persona": "Emergency Medicine Physician",
  "details": "#### Primary Objective:\nRetrieve critical, actionable medical information for rapid diagnosis, treatment, and stabilization of patients in acute, life-threatening situations.\n\n#### Core Information to Retrieve:\n-   **Clinical Practice Guidelines & Protocols:** ACLS, ATLS, PALS algorithms, sepsis protocols, stroke protocols, trauma guidelines, management of specific emergencies (e.g., \"anaphylaxis management,\" \"status epilepticus protocol\").\n-   **Drug Information:** Medication dosages (adult and pediatric), contraindications, side effects, drug interactions, infusion rates, antidote information.\n-   **Diagnostic Criteria & Differential Diagnoses:** Specific criteria for conditions (e.g., \"STEMI criteria,\" \"pulmonary embolism diagnosis\"), lists of differential diagnoses for common presentations (e.g., \"causes of chest pain,\" \"altered mental status differential\").\n-   **Laboratory Values & Interpretation:** Normal ranges for common lab tests (CBC, BMP, LFTs, cardiac enzymes, ABGs), critical values, interpretation of abnormal results.\n-   **Imaging Interpretation:** Key findings on X-ray, CT, MRI, ultrasound for emergent conditions (e.g., \"CT head findings stroke,\" \"FAST exam interpretation,\" \"CXR pneumonia signs\").\n-   **Procedure Guides:** Step-by-step instructions for emergent procedures (e.g., \"rapid sequence intubation,\" \"central line insertion steps,\" \"thoracostomy technique,\" \"laceration repair\").\n-   **Toxicology & Overdose Management:** Information on common poisons, specific antidotes, management of drug overdoses, toxidrome identification.\n-   **Trauma Management:** Primary and secondary survey components, burn management, specific injury management protocols (e.g., \"spinal immobilization guidelines\").\n-   **Emergent Conditions:** Pathophysiology, clinical presentation, and immediate management of critical medical conditions (e.g., \"acute myocardial infarction,\" \"septic shock,\" \"diabetic ketoacidosis\").\n-   **Pain Management:** Acute pain protocols, specific analgesic dosages for emergency use.\n-   **Patient Disposition & Follow-up:** Criteria for admission, discharge, transfer protocols for critical patients.\n\n#### Information to Ignore (Noise):\n-   Long-term chronic disease management plans.\n-   Elective surgery scheduling or pre-operative clearances for non-emergent procedures.\n-   Detailed administrative reports (e.g., hospital budgets, marketing plans, HR policies).\n-   Basic science research or theoretical medical studies without direct clinical applicability.\n-   Non-clinical patient education materials (e.g., lifestyle advice, wellness programs).\n-   Billing and coding documentation unrelated to immediate patient care decisions.\n-   Detailed epidemiological studies or public health statistics unless directly impacting acute patient triage or infectious disease control.\n-   Non-medical product advertisements or general news articles."
}