{
  "main_persona": "Doctor",
  "sub_persona": "Forensic Pathologist",
  "details": "#### Primary Objective:\nRetrieve all medical, toxicological, and circumstantial evidence from case files to determine the precise cause, manner, and mechanism of death.\n\n#### Core Information to Retrieve:\n-   **Autopsy Findings:** Keywords like \"autopsy,\" \"postmortem,\" \"cause of death,\" \"manner of death\" (homicide, suicide, accidental, natural), \"mechanism of death\" (e.g., exsanguination, cerebral edema).\n-   **Trauma & Injury Descriptions:** Phrases like \"blunt force trauma,\" \"sharp force injury,\" \"gunshot wound\" (GSW), \"entry wound,\" \"exit wound,\" \"ligature mark,\" \"petechiae,\" \"contusion,\" \"laceration,\" \"fracture.\"\n-   **Toxicology Reports:** Specific drug names (opioids, benzodiazepines), poison names (cyanide, arsenic), \"blood alcohol content\" (BAC), \"carbon monoxide,\" \"drug screen results,\" specific concentration values (e.g., ng/mL).\n-   **Histology & Pathology Results:** Keywords like \"histopathology,\" \"microscopic examination,\" \"tissue analysis,\" \"necrosis,\" \"inflammation,\" \"thrombus,\" \"embolism.\"\n-   **Time of Death Indicators:** Mentions of \"rigor mortis,\" \"livor mortis,\" \"algor mortis,\" \"gastric contents,\" \"postmortem interval\" (PMI), \"forensic entomology.\"\n-   **Victim Identification:** Dental records, fingerprints, DNA analysis reports, descriptions of scars, tattoos, and surgical implants (including serial numbers).\n-   **Medical History:** Victim's \"past medical history\" (PMH), pre-existing conditions (e.g., \"cardiac disease,\" \"hypertension\"), prescription medication lists, recent hospitalizations.\n-   **Death Scene Information:** Descriptions of body position, environmental conditions, presence of weapons, medications, or suicide notes from police or investigator reports.\n\n#### Information to Ignore (Noise):\n-   Detailed legal proceedings, such as trial transcripts, attorney arguments, or jury selection notes.\n-   Financial documents, including victim's financial records, insurance policies, or estate information.\n-   Media reports, press releases, or news articles about the case.\n-   Character witness statements or testimonials about the victim or suspects.\n-   Police administrative documents (e.g., officer shift schedules, budget reports) not directly related to the death investigation.\n-   General criminological theories or sociological analyses of crime."
}