{
  "main_persona": "Doctor",
  "sub_persona": "Hospitalist",
  "details": "#### Primary Objective:\nRetrieve all relevant clinical data, treatment protocols, and diagnostic guidelines to effectively manage acutely ill, hospitalized patients from admission through discharge.\n\n#### Core Information to Retrieve:\n-   **Patient Vitals & Data:** Heart rate, blood pressure, respiratory rate, temperature, oxygen saturation (SpO2), intake and output (I&O) logs.\n-   **Lab Results:** Complete blood count (CBC), basic/comprehensive metabolic panel (BMP/CMP), liver function tests (LFTs), troponins, coagulation panels (PT/INR, PTT), blood cultures, urinalysis, arterial blood gas (ABG).\n-   **Imaging Reports:** \"Impression\" and \"Findings\" sections of X-rays, CT scans, MRIs, and Ultrasounds.\n-   **Medication Information:** Medication Administration Record (MAR), drug names, dosages, frequencies, routes of administration, antibiotic start/stop dates, medication reconciliation lists.\n-   **Clinical Notes & Orders:** History and Physical (H&P), progress notes, SOAP notes, consultant recommendations (e.g., \"Cardiology Consult\"), nursing notes, admission orders, discharge summaries.\n-   **Diagnoses & Conditions:** Common hospital diagnoses like \"Sepsis,\" \"Pneumonia,\" \"Congestive Heart Failure (CHF),\" \"COPD Exacerbation,\" \"Acute Kidney Injury (AKI),\" \"Deep Vein Thrombosis (DVT),\" \"Pulmonary Embolism (PE),\" \"Cellulitis,\" \"CVA/Stroke.\"\n-   **Protocols & Pathways:** \"Sepsis protocol,\" \"Chest Pain Pathway,\" \"VTE prophylaxis guidelines,\" \"glycemic control algorithm,\" \"antibiotic stewardship\" recommendations.\n-   **Code Status & Alerts:** \"DNR/DNI\" (Do Not Resuscitate/Intubate), allergy lists, isolation precautions.\n-   **Discharge Planning:** \"Discharge criteria,\" \"follow-up appointment\" details, \"home health referral,\" \"durable medical equipment\" (DME) orders.\n\n#### Information to Ignore (Noise):\n-   **Billing & Insurance Information:** ICD-10 codes for billing purposes, insurance authorization forms, patient statements, Explanation of Benefits (EOB).\n-   **Hospital Administrative Data:** Hospital-wide financial reports, marketing materials, press releases, board of directors meeting minutes.\n-   **Human Resources Documents:** Staffing schedules, employee benefit information, payroll documents.\n-   **Long-term Outpatient Records:** Routine clinic follow-up notes from years prior, unless directly pertinent to the acute admission.\n-   **General Research Articles:** Academic papers or clinical trial data not directly implemented as a hospital protocol.\n-   **Ancillary Department Logistics:** Cafeteria menus, building maintenance records, IT support tickets."
}