{
  "main_persona": "Doctor",
  "sub_persona": "Psychiatrist",
  "details": "#### Primary Objective:\nRetrieve comprehensive clinical information for the diagnosis, treatment, and management of psychiatric disorders, including pharmacological data, therapeutic modalities, and diagnostic criteria.\n\n#### Core Information to Retrieve:\n-   **Diagnostic Criteria & Disorders:** DSM-5/ICD-10 codes, \"Major Depressive Disorder,\" \"Bipolar Disorder,\" \"Schizophrenia,\" \"Anxiety Disorder,\" \"PTSD,\" \"OCD,\" \"ADHD,\" \"Personality Disorder.\"\n-   **Psychiatric Symptoms:** Phrases like \"suicidal ideation,\" \"auditory hallucinations,\" \"delusions of grandeur,\" \"anhedonia,\" \"panic attack,\" \"compulsions,\" \"mania,\" \"flat affect.\"\n-   **Pharmacology (Medications):**\n    -   **Drug Names:** Sertraline, Fluoxetine, Escitalopram, Aripiprazole, Olanzapine, Quetiapine, Risperidone, Lithium, Valproate, Lamotrigine, Lorazepam, Alprazolam, Methylphenidate, Amphetamine.\n    -   **Drug Classes:** \"SSRI,\" \"SNRI,\" \"MAOI,\" \"TCA,\" \"atypical antipsychotic,\" \"typical antipsychotic,\" \"mood stabilizer,\" \"benzodiazepine,\" \"stimulant.\"\n-   **Treatment Parameters:** \"Dosage,\" \"titration schedule,\" \"black box warning,\" \"side effects,\" \"adverse drug reaction,\" \"drug-drug interactions.\"\n-   **Specific Side Effects:** \"Extrapyramidal symptoms (EPS),\" \"tardive dyskinesia,\" \"serotonin syndrome,\" \"neuroleptic malignant syndrome (NMS),\" \"QTc prolongation.\"\n-   **Therapeutic Modalities:** \"Cognitive Behavioral Therapy (CBT),\" \"Dialectical Behavior Therapy (DBT),\" \"Psychodynamic psychotherapy,\" \"Interpersonal Therapy (IPT),\" \"Electroconvulsive Therapy (ECT),\" \"Transcranial Magnetic Stimulation (TMS).\"\n-   **Clinical Assessment:** \"Mental Status Exam (MSE),\" \"risk assessment,\" \"capacity assessment.\"\n-   **Rating Scales:** \"PHQ-9,\" \"GAD-7,\" \"BDI,\" \"HAM-D,\" \"YMRS,\" \"PANSS.\"\n-   **Lab & Monitoring:** \"Lithium level,\" \"valproic acid level,\" \"CBC,\" \"CMP,\" \"TSH,\" \"EKG,\" \"urine drug screen.\"\n-   **Legal & Ethical Terms:** \"Informed consent,\" \"involuntary commitment,\" \"Form 1,\" \"Section 2,\" \"duty to warn,\" \"HIPAA.\"\n\n#### Information to Ignore (Noise):\n-   Detailed surgical procedures unrelated to psychiatry (e.g., orthopedic surgery, cardiac catheterization).\n-   Hospital administrative memos, departmental budgets, and billing information.\n-   Non-clinical patient information (e.g., cafeteria preferences, visitor logs).\n-   Pharmaceutical company stock performance or marketing reports.\n-   Basic science research that lacks immediate clinical application (e.g., studies on non-human primate social structures).\n-   Medical device manuals for non-psychiatric equipment (e.g., ventilators, dialysis machines)."
}