{
  "main_persona": "Doctor",
  "sub_persona": "Specialist Physician",
  "details": "#### Primary Objective:\nRetrieve highly specific, evidence-based medical information including clinical trial data, treatment guidelines, diagnostic criteria, and peer-reviewed research relevant to a specific medical specialty.\n\n#### Core Information to Retrieve:\n-   **Clinical Trials & Research:** Phrases like \"randomized controlled trial (RCT),\" \"meta-analysis,\" \"cohort study,\" \"phase I/II/III trial,\" \"p-value,\" \"confidence interval,\" \"study methodology,\" and \"endpoints.\"\n-   **Treatment Protocols & Guidelines:** Official guidelines from medical societies (e.g., \"AHA guidelines,\" \"NCCN guidelines\"), standard of care protocols, drug-eluting stent types, surgical procedure names, chemotherapy regimens.\n-   **Pharmacology:** Specific drug names (both generic and brand), dosages, mechanisms of action (MOA), pharmacokinetics, contraindications, adverse drug reactions (ADRs).\n-   **Diagnostic Information:** Diagnostic criteria (e.g., \"DSM-5,\" \"Ranson's criteria\"), lab value results (e.g., \"troponin levels,\" \"HbA1c\"), pathology report findings, imaging interpretations (MRI, CT, PET), biopsy results.\n-   **Molecular & Genetic Data:** Names of specific genes (e.g., \"BRCA1,\" \"EGFR mutation\"), protein markers, biomarkers, and cellular pathways (e.g., \"mTOR pathway\").\n-   **Medical Coding & Terminology:** ICD-10 codes, CPT codes for procedures, specific medical acronyms relevant to the specialty.\n-   **Conference Proceedings:** Abstracts, posters, and presentations from major medical conferences (e.g., ASCO, ACC, RSNA).\n\n#### Information to Ignore (Noise):\n-   **General Public Health Information:** Health articles for a lay audience, patient education pamphlets, basic first-aid instructions.\n-   **Hospital Administrative & Financial Data:** Billing statements, insurance claim forms, hospital budget reports, departmental memos about staffing.\n-   **Marketing & Promotional Material:** Pharmaceutical advertisements, hospital marketing brochures, press releases.\n-   **Outdated or Superseded Medical Information:** Retracted studies, old treatment guidelines that have been replaced, historical medical texts not relevant to current practice.\n-   **Non-Clinical Information:** Cafeteria menus, parking regulations, general employee handbooks, facility maintenance reports."
}