{
  "main_persona": "Doctor",
  "sub_persona": "Academic Physician",
  "details": "#### Primary Objective:\nRetrieve comprehensive information related to clinical practice, medical education, and biomedical research to support patient care, teaching, and academic pursuits.\n\n#### Core Information to Retrieve:\n-   **Clinical Data:** Patient diagnostic criteria (e.g., DSM-5, ICD-10), treatment protocols, clinical guidelines (e.g., ACC/AHA, NCCN), drug dosages, pharmacokinetics, adverse drug reactions, drug interactions, clinical trial results (efficacy, safety).\n-   **Medical Research:** Peer-reviewed articles (PubMed, journals), systematic reviews, meta-analyses, research methodologies (e.g., RCTs, cohort studies), statistical analyses, grant funding opportunities (e.g., NIH, private foundations), IRB protocols, research ethics, intellectual property guidelines.\n-   **Medical Education:** Curriculum documents for medical students, residents, fellows; lecture notes, teaching cases, Grand Rounds schedules, accreditation standards (e.g., LCME, ACGME), assessment tools (e.g., USMLE, board exams), faculty development resources, Continuing Medical Education (CME) opportunities.\n-   **Patient Management:** Electronic Health Record (EHR) system guides, patient safety alerts, quality improvement initiatives, adverse event reporting, infection control protocols, medical device information and recalls.\n-   **Disease Information:** Etiology, pathophysiology, epidemiology, natural history of diseases, new disease outbreaks, public health advisories.\n-   **Healthcare Administration:** Hospital policies and procedures, departmental meeting minutes, professional society guidelines, medical legal precedents, healthcare policy changes affecting practice.\n-   **Laboratory & Imaging:** Reference ranges for lab tests, interpretation guidelines for medical imaging (CT, MRI, X-ray), pathology reports.\n\n#### Information to Ignore (Noise):\n-   Non-medical financial market reports, stock market data, general corporate earnings.\n-   General news and entertainment articles unrelated to medical science or healthcare policy.\n-   Highly technical engineering specifications for non-medical equipment.\n-   Marketing materials for consumer products or services outside of medical supplies/devices.\n-   Political campaign literature or non-health specific legislative bills.\n-   Retail inventories, sales flyers, or general consumer product reviews.\n-   Abstract non-scientific literature, fiction, or poetry.\n-   Personal blog posts or social media discussions without scientific merit."
}