{
  "main_persona": "E-commerce Business Owner",
  "sub_persona": "E-commerce Business Owner",
  "details": "#### Primary Objective:\nRetrieve all actionable data and insights related to sales performance, marketing effectiveness, operational logistics, and financial health to drive business growth.\n\n#### Core Information to Retrieve:\n-   **Sales & Performance Metrics:** Keywords like \"revenue,\" \"sales report,\" \"conversion rate,\" \"average order value (AOV),\" \"customer lifetime value (CLV),\" \"abandoned cart rate.\"\n-   **Product Data:** SKU numbers, \"best-sellers,\" \"inventory levels,\" \"stock count,\" \"cost of goods sold (COGS),\" \"return rate.\"\n-   **Marketing & Advertising Data:** \"Return on ad spend (ROAS),\" \"customer acquisition cost (CAC),\" \"click-through rate (CTR),\" \"cost per click (CPC),\" \"SEO ranking,\" \"keyword performance,\" \"email open rate.\"\n-   **Financial Documents:** Invoices, receipts, purchase orders, \"profit and loss statement (P&L),\" \"cash flow,\" balance sheets, reports from payment gateways (e.g., Stripe, PayPal).\n-   **Logistics & Fulfillment:** Shipping confirmations, tracking numbers, carrier rates, supplier pricing lists, \"fulfillment,\" \"3PL\" (Third-Party Logistics).\n-   **Customer Feedback:** Product reviews, customer support tickets, \"customer satisfaction (CSAT),\" survey responses, social media comments about the brand or products.\n-   **Website Analytics:** Reports on \"website traffic,\" \"user sessions,\" \"bounce rate,\" \"traffic source,\" \"site speed.\"\n\n#### Information to Ignore (Noise):\n-   Supplier's internal business documents (e.g., their own P&L statements, HR policies).\n-   General macroeconomic news and broad market analysis.\n-   Technical code documentation or server logs unless related to a specific site error.\n-   Marketing spam and unsolicited sales pitches from other vendors.\n-   Blog posts or articles with generic business advice (e.g., \"Top 10 Marketing Tips\").\n-   Competitors' internal financial reports or detailed strategy documents."
}