{
  "main_persona": "E-commerce Business Owner",
  "sub_persona": "Subscription Box Business Owner",
  "details": "#### Primary Objective:\nRetrieve all actionable data related to customer lifecycle management, product curation, operational logistics, and financial performance to successfully run and scale a subscription box business.\n\n#### Core Information to Retrieve:\n-   **Subscription Metrics:** Keywords like \"Monthly Recurring Revenue (MRR),\" \"Churn Rate,\" \"Customer Lifetime Value (LTV),\" \"Customer Acquisition Cost (CAC),\" \"Average Revenue Per User (ARPU).\"\n-   **Customer Data:** Customer lists, shipping addresses, subscription start dates, renewal dates, order history, cancellation reasons, customer feedback surveys.\n-   **Supplier & Product Information:** Vendor contact details, wholesale price lists, product catalogs, purchase orders, invoices, shipping lead times, SKU numbers.\n-   **Logistics & Fulfillment:** Shipping provider contracts (e.g., USPS, FedEx, UPS), shipping rates, tracking numbers, 3PL (Third-Party Logistics) agreements, packing slips, warehouse addresses.\n-   **Marketing & Sales:** \"Influencer outreach,\" \"affiliate marketing,\" \"referral program,\" \"social media campaign results,\" \"email marketing stats,\" \"conversion rates,\" \"unboxing.\"\n-   **Financial Reports:** Profit and Loss (P&L) statements, Cost of Goods Sold (COGS) breakdowns, marketing spend reports, revenue summaries, payment processor statements (e.g., Stripe, PayPal).\n-   **Packaging:** \"Packaging quote,\" \"box dimensions,\" \"dunnage,\" \"custom printing,\" \"insert cards.\"\n-   **Software & Platforms:** Mentions of subscription management tools like \"Recharge,\" \"Bold Subscriptions,\" or e-commerce platforms like \"Shopify,\" \"WooCommerce.\"\n\n#### Information to Ignore (Noise):\n-   One-time retail sales data that is not part of a subscription.\n-   Brick-and-mortar store operational data (e.g., retail lease agreements, in-store display plans).\n-   Supplier's internal company news or organizational charts.\n-   Deeply technical IT documents like server architecture diagrams or API documentation (unless directly related to a specific integration problem).\n-   General market news or economic reports not specific to e-commerce, retail, or the box's specific niche (e.g., beauty, food, gaming).\n-   Detailed manufacturing specifications or raw material chemical analysis reports from suppliers.\n-   Employee resumes and detailed HR performance reviews."
}