{
  "main_persona": "E-commerce Business Owner",
  "sub_persona": "B2B E-commerce Owner",
  "details": "#### Primary Objective:\nRetrieve all critical business data related to client relationships, sales performance, supplier management, and operational logistics to optimize B2B sales and fulfillment.\n\n#### Core Information to Retrieve:\n-   **Client & Sales Documents:** Purchase Orders (POs), sales contracts, Master Service Agreements (MSAs), Statements of Work (SOWs).\n-   **Client Information:** Company names, account numbers, contact details for purchasing managers or procurement departments.\n-   **Pricing & Quoting:** Phrases like \"wholesale pricing,\" \"bulk discount,\" \"volume pricing,\" \"tiered pricing,\" \"Request for Quote (RFQ),\" \"Request for Proposal (RFP).\"\n-   **Financial Transactions:** Invoices, credit terms (e.g., \"Net 30,\" \"Net 60\"), payment records, accounts receivable reports, credit memos.\n-   **Logistics & Fulfillment:** Shipping manifests, bills of lading, packing slips, freight carrier details, tracking numbers, warehouse inventory reports.\n-   **Supplier Management:** Supplier contracts, supplier contact information, pricing lists, material specification sheets, Bill of Materials (BOM).\n-   **Product Information:** Product SKUs, technical specification sheets, product catalogs for business clients, inventory levels.\n-   **Compliance & Legal:** Sales tax exemption certificates, reseller permits, industry compliance certifications (e.g., ISO standards), terms of service.\n\n#### Information to Ignore (Noise):\n-   B2C marketing materials (e.g., social media influencer campaigns, individual consumer promotions, flash sale announcements).\n-   Individual customer support inquiries or reviews from non-business entities.\n-   Internal employee administrative documents (e.g., PTO requests, performance reviews, company event planning).\n-   General industry news articles or blog posts that are not specific market analysis reports.\n-   Detailed website analytics on consumer user behavior (e.g., heatmaps for the general public).\n-   Employee expense reports for travel or minor purchases.\n-   Vendor marketing emails that are not direct quotes or contracts."
}