{
  "main_persona": "E-commerce Business Owner",
  "sub_persona": "Niche E-commerce Specialist",
  "details": "#### Primary Objective:\nRetrieve targeted market research, competitor analysis, supplier details, and marketing strategies to gain a competitive advantage and optimize a niche e-commerce operation.\n\n#### Core Information to Retrieve:\n-   **Niche Market Analysis:** Phrases like \"market size,\" \"target audience,\" \"customer demographics,\" \"consumer behavior,\" and \"market trends\" specific to the niche.\n-   **Competitor Intelligence:** Competitor brand names, their product pricing, unique selling propositions (USPs), customer reviews, and marketing channels they utilize.\n-   **Supplier & Sourcing Data:** Manufacturer or wholesaler catalogs, price lists, contact information, and terms like \"Minimum Order Quantity (MOQ),\" \"private label,\" \"white label,\" and \"dropshipping supplier.\"\n-   **Product & Keyword Research:** Data on \"long-tail keywords,\" \"search volume,\" \"keyword difficulty,\" and trending products within the specific niche.\n-   **Niche Marketing Strategies:** Information on \"influencer marketing,\" \"content marketing,\" \"SEO for e-commerce,\" \"social media advertising\" (e.g., Facebook Ads, TikTok Ads) with examples relevant to the niche.\n-   **Financial & Performance Metrics:** Keywords like \"customer acquisition cost (CAC),\" \"customer lifetime value (CLV),\" \"conversion rate optimization (CRO),\" \"average order value (AOV),\" and \"profit margin.\"\n-   **Logistics & Fulfillment:** Information on \"3PL (Third-Party Logistics),\" \"fulfillment centers,\" \"shipping rates,\" and international customs/duties.\n-   **E-commerce Platform/Tools:** Reviews or comparisons of e-commerce platforms (Shopify, BigCommerce, etc.), apps, and marketing automation tools relevant to small-to-medium businesses.\n\n#### Information to Ignore (Noise):\n-   Broad, mass-market retail industry reports and trends (e.g., data on Walmart, Amazon as a whole).\n-   Supplier catalogs and product information for categories outside the specific niche.\n-   Enterprise-level software solutions and logistics systems designed for multinational corporations (e.g., Oracle, SAP).\n-   General business news, stock market analyses, and venture capital funding announcements unrelated to the niche or e-commerce.\n-   Marketing case studies for large, non-niche consumer brands (e.g., Coca-Cola, Nike).\n-   Human resources documents, corporate policy handbooks, and C-suite management theory."
}