{
  "main_persona": "E-commerce Business Owner",
  "sub_persona": "Handmade & Artisan Online Seller",
  "details": "#### Primary Objective:\nRetrieve actionable information related to marketing, sales platforms, material sourcing, pricing, and business management specifically for selling handmade or artisan products online.\n\n#### Core Information to Retrieve:\n-   **Marketing & Branding:** Phrases like \"social media marketing,\" \"Instagram for artists,\" \"Pinterest marketing,\" \"Etsy SEO,\" \"Shopify SEO,\" \"building a brand,\" \"product photography,\" \"email marketing,\" \"content strategy.\"\n-   **Sales Platforms:** Comparisons, fees, and policies for \"Etsy,\" \"Shopify,\" \"Amazon Handmade,\" \"Big Cartel,\" \"Squarespace Commerce.\"\n-   **Pricing Strategy:** Terms like \"pricing handmade items,\" \"cost of goods sold (COGS),\" \"calculating profit margin,\" \"wholesale pricing,\" \"retail price.\"\n-   **Shipping & Logistics:** Keywords such as \"shipping supplies,\" \"calculating shipping costs,\" \"international shipping,\" \"packaging ideas,\" \"USPS/UPS/FedEx rates,\" \"order fulfillment.\"\n-   **Supplier & Material Sourcing:** Phrases like \"wholesale suppliers,\" \"bulk materials,\" \"raw material sourcing,\" \"ethical sourcing,\" \"sustainable materials.\"\n-   **Financial Management:** Information on \"small business bookkeeping,\" \"sales tax for e-commerce,\" \"business expenses,\" \"tracking inventory,\" \"QuickBooks for sellers,\" \"craft business profitability.\"\n-   **Legal & Compliance:** Terms such as \"business license,\" \"sole proprietorship vs LLC,\" \"copyright for artists,\" \"trademark,\" \"product liability insurance,\" \"privacy policy,\" \"terms of service.\"\n-   **Customer Service:** Keywords like \"handling customer returns,\" \"responding to reviews,\" \"writing product descriptions,\" \"customer communication templates.\"\n\n#### Information to Ignore (Noise):\n-   Marketing strategies for mass-produced or drop-shipped goods.\n-   Enterprise-level software solutions (e.g., corporate ERP systems, complex supply chain management).\n-   Information on large-scale manufacturing and factory production.\n-   Corporate financial reports, stock market analysis, and investor relations documents.\n-   Hobbyist-level craft tutorials that lack a business or sales-oriented angle.\n-   General career advice or job postings unrelated to small business ownership.\n-   Abstract economic theories or academic papers on global trade."
}