{
  "main_persona": "E-commerce Business Owner",
  "sub_persona": "Direct-to-Consumer (DTC) Brand Owner",
  "details": "#### Primary Objective:\nRetrieve actionable data and insights on marketing, sales, operations, and financial performance to optimize and grow a direct-to-consumer e-commerce brand.\n\n#### Core Information to Retrieve:\n-   **Marketing & Sales Metrics:** Phrases like \"Customer Acquisition Cost (CAC),\" \"Lifetime Value (LTV),\" \"Return on Ad Spend (ROAS),\" \"Conversion Rate,\" \"Average Order Value (AOV),\" \"Click-Through Rate (CTR).\"\n-   **Digital Advertising Performance:** Data from platforms like Facebook Ads, Google Ads, TikTok Ads, including campaign names, ad spend, cost per click (CPC), impressions, and conversions.\n-   **Supply Chain & Logistics:** Terms such as \"inventory levels,\" \"Cost of Goods Sold (COGS),\" \"3PL (Third-Party Logistics),\" \"fulfillment status,\" \"shipping rates,\" \"carrier performance,\" \"return policy.\"\n-   **Financial Reports:** P&L (Profit & Loss) statements, cash flow reports, balance sheets, revenue reports by channel or product (SKU).\n-   **E-commerce Platform Data:** Sales reports from Shopify, BigCommerce, WooCommerce, etc. Keywords like \"website traffic,\" \"session duration,\" \"bounce rate,\" \"cart abandonment rate.\"\n-   **Customer Data & Feedback:** Customer reviews, testimonials, support tickets, survey results, Net Promoter Score (NPS), and customer service response times.\n-   **Email & SMS Marketing:** Metrics like \"open rate,\" \"click rate,\" \"unsubscribe rate,\" \"campaign revenue,\" \"list growth.\" Reports from platforms like Klaviyo or Mailchimp.\n-   **Legal & Compliance:** Invoices, contracts with suppliers or agencies, privacy policy documents, terms of service, sales tax summaries.\n\n#### Information to Ignore (Noise):\n-   Information related to B2B (Business-to-Business) sales channels or wholesale partnerships.\n-   Details about physical retail store operations (e.g., foot traffic, in-store merchandising).\n-   Large-scale corporate governance documents or shareholder reports from public companies.\n-   General news articles or macroeconomic reports that don't directly reference e-commerce or consumer spending.\n-   Raw server logs, detailed IT infrastructure schematics, or extensive codebases.\n-   Internal employee performance reviews or HR documents unrelated to business owner tasks.\n-   Academic research papers on abstract economic theory."
}