{
  "main_persona": "E-commerce Business Owner",
  "sub_persona": "Private Label Brand Owner",
  "details": "#### Primary Objective:\nRetrieve all actionable information related to product sourcing, manufacturing, branding, online marketing, and logistics to operate and scale a private label e-commerce business.\n\n#### Core Information to Retrieve:\n-   **Sourcing & Manufacturing:** Keywords like \"supplier,\" \"manufacturer,\" \"factory,\" \"Alibaba,\" \"sourcing agent,\" \"private label,\" \"white label,\" \"MOQ\" (Minimum Order Quantity), \"lead time,\" \"quality control,\" \"product inspection.\" Look for supplier quotes, product catalogs, and proforma invoices.\n-   **Logistics & Fulfillment:** Phrases such as \"freight forwarder,\" \"3PL\" (Third-Party Logistics), \"Fulfillment by Amazon (FBA),\" \"shipping costs,\" \"customs clearance,\" \"duties & taxes,\" \"warehousing,\" \"inventory management.\"\n-   **Financials & Performance:** Business-specific financial terms like \"P&L\" (Profit and Loss), \"COGS\" (Cost of Goods Sold), \"landing cost,\" \"profit margin,\" \"cash flow statement,\" \"sales report,\" \"ad spend.\"\n-   **Marketing & Advertising:** Terms like \"PPC\" (Pay-Per-Click), \"Amazon Advertising,\" \"Facebook Ads,\" \"ACOS\" (Advertising Cost of Sale), \"ROAS\" (Return on Ad Spend), \"SEO,\" \"keyword research,\" \"conversion rate,\" \"influencer marketing.\"\n-   **Branding & IP:** Keywords like \"trademark,\" \"brand registry,\" \"logo design,\" \"packaging dielines,\" \"UPC,\" \"barcode,\" \"intellectual property.\"\n-   **E-commerce Platforms:** Platform-specific terms like \"Shopify,\" \"Amazon Seller Central,\" \"ASIN,\" \"SKU,\" \"product listing optimization,\" \"A+ Content.\"\n-   **Legal & Compliance:** Documents and terms related to \"LLC,\" \"incorporation,\" \"business license,\" \"sales tax,\" \"terms of service,\" \"privacy policy,\" \"product liability.\"\n-   **Customer Data:** Information on \"customer reviews,\" \"customer feedback,\" \"return requests,\" \"customer support tickets,\" \"refund policy.\"\n\n#### Information to Ignore (Noise):\n-   Information related to other business models like retail arbitrage, dropshipping non-branded goods, or wholesale reselling.\n-   General, non-e-commerce corporate news (e.g., mergers and acquisitions of unrelated public companies).\n-   Supplier information for products outside the owner's niche.\n-   Personal, non-business financial documents (e.g., personal mortgage statements, non-business credit card statements).\n-   Brick-and-mortar retail specific information (e.g., store leases, point-of-sale hardware manuals).\n-   Highly technical IT documents like server architecture plans or deep-level coding tutorials."
}