{
  "main_persona": "E-commerce Business Owner",
  "sub_persona": "Digital Product Creator",
  "details": "#### Primary Objective:\nRetrieve actionable strategies, technical information, and market data for creating, launching, and scaling an e-commerce business focused on digital products.\n\n#### Core Information to Retrieve:\n-   **Marketing & Sales Funnels:** Phrases like \"lead magnet,\" \"email sequence,\" \"webinar funnel,\" \"sales page optimization,\" \"upsell,\" \"downsell,\" \"tripwire offer,\" and \"conversion rate optimization (CRO).\"\n-   **E-commerce Platforms & Tools:** Names of platforms like \"Gumroad,\" \"Shopify,\" \"Kajabi,\" \"Teachable,\" \"Podia,\" \"SendOwl,\" \"Payhip,\" and payment gateways like \"Stripe\" and \"PayPal.\"\n-   **Digital Marketing Strategies:** Keywords like \"SEO for digital products,\" \"content marketing,\" \"affiliate marketing programs,\" \"social media marketing,\" \"email list building,\" and ad platforms like \"Facebook Ads\" or \"Google Ads.\"\n-   **Product Creation & Delivery:** Terms such as \"online course creation,\" \"ebook formatting,\" \"template design,\" \"software as a service (SaaS),\" \"digital download link,\" \"content licensing,\" and \"Digital Rights Management (DRM).\"\n-   **Pricing Strategies:** Concepts like \"value-based pricing,\" \"subscription model,\" \"recurring revenue,\" \"one-time payment,\" \"payment plans,\" and \"tiered pricing.\"\n-   **Business Metrics & Analytics:** \"Customer Acquisition Cost (CAC),\" \"Customer Lifetime Value (CLV),\" \"Return on Ad Spend (ROAS),\" \"average order value (AOV),\" \"churn rate,\" \"Google Analytics.\"\n-   **Legal & Compliance:** \"Terms of service,\" \"privacy policy,\" \"copyright notices,\" \"trademark registration,\" \"licensing agreements,\" and \"digital sales tax regulations.\"\n-   **Customer Engagement & Support:** Information on \"community building,\" \"customer feedback loops,\" \"testimonial gathering,\" \"refund policies,\" and \"customer support automation.\"\n\n#### Information to Ignore (Noise):\n-   **Physical Product Logistics:** All mentions of \"shipping,\" \"warehousing,\" \"inventory management,\" \"supply chain,\" \"fulfillment,\" \"packaging,\" and \"customs.\"\n-   **Manufacturing & Sourcing:** Terms like \"manufacturing process,\" \"sourcing agents,\" \"material costs,\" \"Alibaba,\" \"dropshipping.\"\n-   **Brick-and-Mortar Retail:** Information related to physical store operations, \"foot traffic,\" \"point-of-sale (POS) hardware,\" commercial leasing.\n-   **Large Corporate Finance:** Investor relations reports, public company financial filings (e.g., 10-K, 10-Q), stock market analysis.\n-   **Irrelevant Business Operations:** Detailed HR policies for large teams, facility management, corporate governance structures.\n-   **Hardware & IT Infrastructure:** Details on server racks, data center management, or physical network infrastructure."
}