{
  "main_persona": "E-commerce Business Owner",
  "sub_persona": "Reseller/Arbitrage E-commerce Owner",
  "details": "#### Primary Objective:\nRetrieve all actionable data related to product sourcing, market pricing, shipping logistics, and financial performance to maximize profitability for a resale and arbitrage business.\n\n#### Core Information to Retrieve:\n-   **Product Identifiers:** UPCs, ASINs, SKUs, ISBNs, model numbers.\n-   **Sourcing Documents:** Purchase orders, supplier invoices, retail receipts, wholesale price lists.\n-   **Financial Metrics:** Phrases like \"Cost of Goods Sold (COGS),\" \"Return on Investment (ROI),\" \"profit margin,\" \"net profit,\" \"sell-through rate.\"\n-   **Pricing Information:** Competitor prices, Manufacturer's Suggested Retail Price (MSRP), clearance/discount tags.\n-   **Marketplace Data:** Sales reports from Amazon, eBay, Poshmark, etc.; order details including \"Order ID,\" \"Sale Price,\" and \"Units Sold.\"\n-   **Fees and Costs:** Lists or tables of \"Amazon FBA fees,\" \"eBay final value fees,\" \"shipping costs,\" \"payment processing fees,\" \"storage fees.\"\n-   **Logistics & Shipping:** Shipping carrier names (USPS, UPS, FedEx), tracking numbers, postage costs, packing slips, bills of lading, information from prep centers.\n-   **Inventory Management:** Inventory reports, stock level lists, product location data (e.g., warehouse bin numbers).\n-   **Supplier & Wholesaler Information:** Catalogs, contact information, terms of sale, bulk pricing tiers.\n\n#### Information to Ignore (Noise):\n-   Product user manuals and detailed operating instructions.\n-   Consumer-facing marketing materials, brochures, and ad copy for the products.\n-   Warranty cards and manufacturer warranty information.\n-   General news articles or press releases about the brands being sold.\n-   Corporate reports (e.g., annual reports, mission statements) from the original manufacturers or retailers.\n-   Detailed technical schematics or manufacturing process documents.\n-   Customer reviews and feedback, unless aggregated in a sales performance report."
}