{
  "main_persona": "Employee",
  "sub_persona": "Entry-Level Professional",
  "details": "#### Primary Objective:\nRetrieve all essential information related to job responsibilities, company policies, team structure, and immediate professional development opportunities to facilitate successful onboarding and daily task execution.\n\n#### Core Information to Retrieve:\n-   **Onboarding Materials:** Phrases like \"new hire checklist,\" \"onboarding schedule,\" \"employee handbook,\" \"welcome packet.\"\n-   **HR & Benefits Information:** Details on health insurance, 401(k), retirement plans, payroll schedule, direct deposit forms.\n-   **Company Policies:** Search for \"PTO policy,\" \"sick leave,\" \"vacation request,\" \"code of conduct,\" \"expense reimbursement,\" \"remote work policy.\"\n-   **Job-Specific Duties:** Job description, lists of responsibilities, Standard Operating Procedures (SOPs), \"how-to\" guides for specific tasks.\n-   **Team & Company Structure:** Organizational charts, team member lists, contact information, reporting structure (\"reports to\").\n-   **Performance & Growth:** Information on \"performance review,\" goal setting, key performance indicators (KPIs), available training modules, mentorship programs, career pathing.\n-   **IT & Systems Access:** Instructions for logging into systems, software tutorials, IT help desk contact information, password reset procedures.\n-   **Meeting Information:** Team meeting agendas, meeting minutes, project status updates, action items.\n\n#### Information to Ignore (Noise):\n-   High-level corporate strategy documents (e.g., five-year plans, market expansion strategies).\n-   Detailed financial statements, investor relations reports, and SEC filings.\n-   Board of Directors meeting minutes and communications.\n-   Complex legal documents, patents, or litigation records.\n-   Senior management compensation details.\n-   In-depth technical or research documents from unrelated departments.\n-   Archived information about long-retired products or completed projects."
}