{
  "main_persona": "Employee",
  "sub_persona": "Contract/Temporary Employee",
  "details": "#### Primary Objective:\nRetrieve all information pertinent to contract terms, project deliverables, payment procedures, and immediate logistical requirements for a temporary work assignment.\n\n#### Core Information to Retrieve:\n-   **Contractual Documents:** \"Statement of Work\" (SOW), \"Master Services Agreement\" (MSA), \"Consulting Agreement,\" \"Non-Disclosure Agreement\" (NDA).\n-   **Project Details:** Project names, project plans, timelines, \"scope of work,\" \"deliverables,\" \"milestones,\" deadlines, technical specifications.\n-   **Financial Information:** \"Invoice submission process,\" \"payment schedule,\" \"hourly rate,\" \"project fee,\" \"expense reimbursement policy,\" \"timesheet,\" contact for \"Accounts Payable.\"\n-   **Key Contacts:** Names, titles, and contact information for the \"Hiring Manager,\" \"Project Manager,\" or primary \"Point of Contact.\"\n-   **Onboarding & Logistics:** Instructions for \"system access,\" \"VPN setup,\" \"email account,\" \"password,\" software licenses, building access, or equipment provisioning.\n-   **Reporting & Communication:** Instructions on status reporting, meeting schedules, required communication channels (e.g., Slack, Teams).\n-   **Compliance & Policies:** \"Code of Conduct,\" \"data security policy,\" \"confidentiality\" rules, intellectual property clauses.\n\n#### Information to Ignore (Noise):\n-   Information on permanent employee benefits (e.g., \"401k,\" \"pension,\" \"health insurance,\" \"stock options,\" \"paid time off\").\n-   Company-wide annual reports, long-term strategic plans, and shareholder information.\n-   Internal job postings for full-time roles and career pathing documents.\n-   Details about employee resource groups (ERGs), company-wide social events, and permanent staff performance review cycles.\n-   Company history, mission statements, and long-term cultural initiatives.\n-   Permanent employee handbooks (unless a specific section is referenced in the contract)."
}