{
  "main_persona": "End User",
  "sub_persona": "Accessibility User",
  "details": "#### Primary Objective:\nRetrieve all information pertaining to accessible features, usability accommodations, support for users with disabilities, and relevant accessibility standards and compliance.\n\n#### Core Information to Retrieve:\n-   **Accessibility Features:** \"screen reader compatibility,\" \"closed captions,\" \"subtitles,\" \"audio descriptions,\" \"keyboard navigation,\" \"voice control,\" \"high contrast mode,\" \"large font options,\" \"text-to-speech,\" \"speech-to-text,\" \"alternative text,\" \"haptic feedback,\" \"adjustable speed.\"\n-   **Assistive Technologies:** Names of specific assistive devices or software (e.g., \"JAWS,\" \"NVDA,\" \"ZoomText,\" \"Dragon NaturallySpeaking,\" \"hearing aids,\" \"braille displays\").\n-   **Accessibility Standards & Compliance:** \"WCAG (Web Content Accessibility Guidelines),\" \"ADA (Americans with Disabilities Act),\" \"Section 508,\" \"EN 301 549,\" \"VPAT (Voluntary Product Accessibility Template),\" \"accessibility statement,\" \"compliance report.\"\n-   **Support & Services:** \"disability services,\" \"accessibility help desk,\" \"accommodation requests,\" \"inclusive support,\" \"sign language interpretation,\" \"live captioning.\"\n-   **Physical Accessibility:** \"wheelchair accessible,\" \"ramps,\" \"elevators,\" \"accessible restrooms,\" \"braille signage,\" \"accessible parking,\" \"service animal policy.\"\n-   **User Interface/Experience (UI/UX) Guidelines:** \"usability for disabled users,\" \"inclusive design principles,\" \"cognitive accessibility,\" \"motor accessibility,\" \"sensory accessibility.\"\n-   **Troubleshooting & Feedback:** \"report an accessibility issue,\" \"feedback on accessibility,\" \"accessibility bugs.\"\n-   **Contact Information:** Specific contacts for accessibility support, disability services offices, or technical assistance related to accessibility.\n\n#### Information to Ignore (Noise):\n-   General marketing materials unrelated to product features or services.\n-   Highly technical backend system architecture or source code.\n-   Financial reports, stock market data, or investor relations documents.\n-   Non-accessibility specific legal documents (e.g., general terms of service, privacy policies unless they contain an accessibility clause).\n-   Internal corporate HR policies not pertaining to disability accommodations.\n-   Unrelated academic research papers or scientific studies.\n-   Content primarily focused on aesthetics without functional implications for accessibility."
}