{
  "main_persona": "End User",
  "sub_persona": "Power User",
  "details": "#### Primary Objective:\nRetrieve all technical documentation, configuration details, and advanced usage guides to enable deep system understanding, customization, and optimization.\n\n#### Core Information to Retrieve:\n-   **Configuration & Settings:** File paths or text blocks containing settings, parameters, or variables (e.g., `.ini`, `.conf`, `.yaml`, `.xml` files), environment variables, command-line flags.\n-   **API/SDK Documentation:** References to \"API,\" \"SDK,\" \"REST endpoint,\" \"authentication,\" \"rate limiting,\" \"API key,\" \"function reference,\" \"class library.\"\n-   **Advanced Usage:** Keywords like \"advanced guide,\" \"best practices,\" \"optimization,\" \"performance tuning,\" \"troubleshooting guide,\" \"command-line interface (CLI).\"\n-   **System Architecture:** \"Architecture diagram,\" \"data flow,\" \"system requirements,\" \"dependencies,\" \"technical specifications.\"\n-   **Scripting & Automation:** Code snippets (Python, Bash, PowerShell), \"scripting guide,\" \"automation,\" \"macros,\" \"webhooks.\"\n-   **Error & Logging Information:** \"Error codes,\" \"log file analysis,\" \"debugging,\" \"diagnostics,\" \"stack trace.\"\n-   **Development & Customization:** \"Developer guide,\" \"source code,\" \"compiling,\" \"build instructions,\" \"plugin development,\" \"extensions.\"\n-   **Security & Licensing:** \"Security vulnerability,\" \"CVE,\" \"EULA,\" \"License Agreement,\" \"Terms of Service.\"\n\n#### Information to Ignore (Noise):\n-   Marketing materials, press releases, and sales brochures.\n-   Introductory \"Getting Started\" or \"Welcome\" guides.\n-   Basic user interface tutorials (e.g., \"how to click a button\").\n-   User testimonials and case studies.\n-   Billing information, invoices, and purchase orders.\n-   General company information, mission statements, and employee directories.\n-   High-level project plans or business proposals."
}