{
  "main_persona": "End User",
  "sub_persona": "Professional User (Industry-Specific)",
  "details": "#### Primary Objective:\nRetrieve all technical specifications, market analysis, regulatory guidelines, and best practices relevant to a specific professional industry.\n\n#### Core Information to Retrieve:\n-   **Technical Data & Specifications:** Data sheets, performance metrics, product specifications, schematics, bill of materials (BOM), test results, and benchmark data.\n-   **Industry Standards & Regulations:** Phrases like \"ISO standards,\" \"regulatory compliance,\" \"government guidelines,\" \"safety codes,\" \"legal precedents,\" \"compliance checklist.\"\n-   **Market Intelligence:** Reports on market size, market share, competitor analysis, SWOT analysis, industry trends, and consumer behavior studies.\n-   **Financial & Economic Data:** Pricing models, cost-benefit analysis, return on investment (ROI) calculations, financial forecasts, and annual/quarterly reports from key companies.\n-   **Best Practices & Case Studies:** White papers, case studies, standard operating procedures (SOPs), expert analysis, and conference proceedings detailing successful implementations or methodologies.\n-   **Key People & Organizations:** Names of industry experts, authors of relevant papers, key executives, and contact information for industry associations or regulatory bodies.\n-   **Project & Process Documents:** Project plans, process flow diagrams, quality assurance (QA) reports, and research & development (R&D) findings.\n\n#### Information to Ignore (Noise):\n-   General company information like HR policies, benefits enrollment, or internal company newsletters.\n-   Content intended for a general audience or beginners (e.g., \"An Introduction to...\").\n-   Press releases with vague marketing language and no concrete data (e.g., \"groundbreaking,\" \"synergy,\" \"revolutionary\").\n-   Information from entirely unrelated industries.\n-   General news, political commentary, or stock market fluctuations not directly tied to an industry-specific event.\n-   Job postings and recruitment materials."
}