{
  "main_persona": "End User",
  "sub_persona": "Enterprise User",
  "details": "#### Primary Objective:\nRetrieve internal company documents, process guidelines, project information, and contact details necessary to perform job functions effectively and stay aligned with corporate policies.\n\n#### Core Information to Retrieve:\n-   **Policies and Procedures:** Standard Operating Procedures (SOPs), HR policies (e.g., \"vacation policy,\" \"code of conduct\"), expense reporting guidelines, IT security policies, travel booking procedures.\n-   **Project-Specific Documents:** Project plans, charters, status reports, meeting minutes, requirements documents, technical specifications, and team rosters.\n-   **Internal Company Information:** Organizational charts (\"org chart\"), department directories, employee contact information (email, phone extension), office locations, internal announcements.\n-   **Financial & Sales Data:** Internal sales reports, quarterly performance summaries, product pricing sheets, sales quotas, customer relationship management (CRM) reports.\n-   **Human Resources (HR) & Benefits:** Benefits enrollment guides, 401(k) plan documents, performance review templates, holiday schedules, training materials, onboarding checklists.\n-   **IT & Technical Support:** How-to guides for internal software, knowledge base articles, troubleshooting steps, password reset instructions, system access request forms.\n-   **Marketing & Brand Assets:** Brand style guides, official logos, presentation templates, press release archives, marketing campaign briefs.\n-   **Legal & Compliance:** Compliance training documents, data handling policies (e.g., GDPR, PII), Non-Disclosure Agreement (NDA) templates, records retention schedules.\n\n#### Information to Ignore (Noise):\n-   Raw, unstructured system logs or server error reports.\n-   Redundant email signatures and boilerplate legal disclaimers in email chains.\n-   Outdated or draft versions of documents when a final version exists.\n-   Generic, public-facing news articles or stock market feeds not part of an internal report.\n-   Informal social communications (e.g., lunch plans, non-work event coordination).\n-   Marketing spam or unsolicited promotional materials from external vendors.\n-   Highly technical source code or architectural diagrams irrelevant to a non-engineering role."
}