{
  "main_persona": "Engineer",
  "sub_persona": "Environmental Engineer",
  "details": "#### Primary Objective:\nRetrieve technical specifications, regulatory standards, and site-specific data related to environmental assessment, pollution control, and remediation projects.\n\n#### Core Information to Retrieve:\n-   **Regulatory & Compliance Terms:** EPA regulations, Clean Water Act (CWA), Clean Air Act (CAA), RCRA, CERCLA, NEPA, permits, consent decrees, environmental standards, effluent guidelines, emission limits.\n-   **Technical Data & Measurements:** Soil sampling results, groundwater monitoring data, contaminant concentrations (ppm, ppb), air quality data, flow rates, toxicity levels, pH, turbidity, chemical analysis reports.\n-   **Site Assessment & Investigation:** Phrases like \"Phase I/II Environmental Site Assessment,\" \"site characterization,\" \"risk assessment,\" \"hydrogeological study,\" \"borehole logs,\" \"contaminant plume mapping.\"\n-   **Remediation Technologies & Plans:** Terms like \"remediation,\" \"bioremediation,\" \"soil vapor extraction (SVE),\" \"pump and treat,\" \"activated carbon,\" \"remedial action plan (RAP),\" \"corrective action.\"\n-   **Engineering Designs & Systems:** Wastewater treatment plant schematics, stormwater pollution prevention plan (SWPPP), landfill design, air scrubber specifications, P&ID (Piping and Instrumentation Diagram) for environmental systems.\n-   **Pollutants & Chemicals:** Names of specific contaminants like volatile organic compounds (VOCs), heavy metals (lead, mercury), polycyclic aromatic hydrocarbons (PAHs), per- and polyfluoroalkyl substances (PFAS).\n-   **Reporting & Documentation:** Environmental Impact Statement (EIS), Health and Safety Plan (HASP), monitoring reports, spill reports, project specifications.\n-   **Sustainability Concepts:** Life Cycle Assessment (LCA), carbon footprint analysis, water conservation measures, green infrastructure, renewable energy integration.\n\n#### Information to Ignore (Noise):\n-   Company financial reports, shareholder information, and marketing materials.\n-   Human Resources documents like employee reviews, payroll, and general office policies.\n-   General legal contracts not related to environmental liability or permitting.\n-   Press releases or news articles not directly related to an environmental incident or technology.\n-   Detailed mechanical or electrical engineering designs for non-environmental systems.\n-   Raw, uninterpreted data sets without context or analysis.\n-   General sales and procurement information for non-technical equipment."
}