{
  "main_persona": "Engineer",
  "sub_persona": "Biomedical Engineer",
  "details": "#### Primary Objective:\nRetrieve all technical, scientific, and regulatory information necessary for the design, development, testing, and maintenance of medical devices, diagnostic equipment, and biological systems.\n\n#### Core Information to Retrieve:\n-   **Medical Device Specifications:** Schematics, CAD designs, material specifications, component lists, performance parameters, user manuals.\n-   **Biocompatibility & Materials Science:** Information on biomaterials (polymers, ceramics, metals), tissue-device interaction, cytotoxicity, degradation rates, surface modifications.\n-   **Regulatory Affairs:** FDA guidelines (e.g., 510(k), PMA), CE marking, ISO standards (e.g., ISO 13485, ISO 14971), clinical trial protocols, GxP guidelines.\n-   **Biomedical Signal Processing:** ECG, EEG, EMG, PPG data, signal acquisition methods, filtering algorithms, diagnostic interpretations.\n-   **Medical Imaging:** Principles of MRI, CT, Ultrasound, X-ray, image processing algorithms, diagnostic imaging software, resolution standards.\n-   **Anatomy & Physiology:** Detailed descriptions of human organ systems, cellular biology, biomechanics, physiological responses to medical interventions.\n-   **Prosthetics & Implants:** Design principles, materials, surgical implantation techniques, long-term performance data, patient outcomes.\n-   **Tissue Engineering & Regenerative Medicine:** Scaffolding techniques, cell culture protocols, growth factors, stem cell research, artificial organs.\n-   **Biomedical Instrumentation:** Sensor technologies, calibration procedures, circuit diagrams, troubleshooting guides for medical equipment.\n-   **Clinical Data & Outcomes:** Clinical study reports, patient demographics, adverse event reports, efficacy data, statistical analyses related to medical devices.\n-   **Software & Algorithms:** Code for medical device control, data analysis scripts (Python, MATLAB), AI/ML applications in diagnostics, cybersecurity protocols for medical devices.\n-   **Sterilization & Infection Control:** Methods (e.g., autoclaving, ETO, gamma irradiation), validation protocols, microbial resistance.\n-   **Intellectual Property:** Patent applications, granted patents, freedom-to-operate analyses related to biomedical innovations.\n-   **Bioethics:** Ethical guidelines for human experimentation, patient data privacy (HIPAA, GDPR), informed consent.\n\n#### Information to Ignore (Noise):\n-   General financial market reports unrelated to medical technology companies.\n-   Consumer product reviews for non-medical devices (e.g., household appliances, personal electronics).\n-   Political news or social commentary.\n-   Highly specialized civil engineering, aerospace engineering, or automotive engineering documents.\n-   Humanities research papers or literary analyses.\n-   General business administration or marketing strategies for non-biotech industries.\n-   Detailed architectural blueprints for non-medical facilities."
}