{
  "main_persona": "Engineer",
  "sub_persona": "Data Engineer",
  "details": "#### Primary Objective:\nRetrieve technical documentation, specifications, and performance metrics related to data infrastructure, pipelines, databases, and processing systems.\n\n#### Core Information to Retrieve:\n-   **Data Pipeline & ETL Logic:** Phrases like \"ETL job,\" \"ELT process,\" \"data pipeline,\" \"data ingestion,\" \"data flow,\" \"transformation logic.\"\n-   **System Architecture:** \"Architecture diagram,\" \"system design,\" \"data model,\" \"database schema,\" \"data flow diagram.\"\n-   **Database & Storage Information:** Keywords like \"SQL,\" \"NoSQL,\" \"data warehouse,\" \"data lake,\" \"connection string,\" \"schema definition,\" \"indexing strategy,\" \"partitioning.\"\n-   **Technology & Service Names:** Specific names of databases, services, and tools (e.g., \"PostgreSQL,\" \"Snowflake,\" \"BigQuery,\" \"Redshift,\" \"Kafka,\" \"Spark,\" \"Airflow,\" \"dbt\").\n-   **Code & Scripts:** Code snippets in Python, Scala, or SQL; configuration files (.yml, .conf); deployment scripts.\n-   **API & Data Contracts:** \"API endpoint,\" \"payload structure,\" \"JSON schema,\" \"Avro schema,\" \"Parquet format,\" \"rate limit.\"\n-   **Performance & Monitoring:** \"Query performance,\" \"latency,\" \"throughput,\" \"error logs,\" \"monitoring dashboard,\" \"SLO/SLA,\" \"resource utilization\" (CPU, memory).\n-   **Infrastructure Configuration:** \"Terraform,\" \"Docker,\" \"Kubernetes,\" \"environment variables,\" \"server specs,\" \"access credentials,\" \"IAM roles.\"\n-   **Data Governance:** Terms like \"data lineage,\" \"data quality rules,\" \"PII,\" \"data catalog,\" \"encryption,\" \"access control.\"\n\n#### Information to Ignore (Noise):\n-   Business intelligence reports, sales dashboards, and final data visualizations.\n-   Marketing campaign analysis and customer sentiment reports.\n-   High-level business strategy documents and financial projections.\n-   Human Resources policies, team meeting minutes (unless technically focused), and project management timelines.\n-   Front-end user interface (UI/UX) design mockups.\n-   General company press releases or marketing copy."
}