{
  "main_persona": "Engineer",
  "sub_persona": "Software Engineer",
  "details": "#### Primary Objective:\nRetrieve all technical documentation, code examples, architectural designs, and system specifications related to software development and engineering.\n\n#### Core Information to Retrieve:\n-   **Code & Algorithms:** Code snippets (in languages like Python, Java, C++, JavaScript, Go), pseudocode, data structures, algorithm descriptions, Big O notation.\n-   **Architecture & Design:** Phrases like \"system architecture,\" \"design pattern,\" \"microservices,\" \"API gateway,\" \"database schema,\" \"UML diagrams,\" \"sequence diagrams,\" \"data flow.\"\n-   **APIs & Protocols:** API documentation (REST, GraphQL, gRPC), endpoints, request/response formats (JSON, XML), HTTP status codes, OAuth, TCP/IP.\n-   **Tools & Technologies:** Mentions of specific frameworks (React, Angular, Spring, Django), libraries, SDKs, containerization tools (Docker, Kubernetes), CI/CD platforms (Jenkins, GitLab CI), version control (Git commands, pull requests).\n-   **Technical Specifications:** Functional requirements, non-functional requirements (NFRs), technical spec documents, performance metrics (latency, throughput), scalability plans.\n-   **Testing & Debugging:** Unit tests, integration tests, end-to-end (E2E) testing plans, error messages, stack traces, bug reports, debugging procedures, post-mortems.\n-   **Database Information:** SQL queries, NoSQL queries, database schemas, migration scripts, indexing strategies.\n\n#### Information to Ignore (Noise):\n-   Marketing materials, sales pitches, and product brochures.\n-   High-level business strategy documents without technical implementation details.\n-   Company financial reports, investor briefings, and stock performance data.\n-   Human Resources (HR) documents, employee handbooks, and corporate policies.\n-   Legal contracts, Terms of Service (ToS), and Non-Disclosure Agreements (NDAs).\n-   End-user manuals that lack technical depth or setup instructions.\n-   Press releases and general company announcements."
}