{
  "main_persona": "Engineer",
  "sub_persona": "Mechanical Engineer",
  "details": "#### Primary Objective:\nRetrieve all technical specifications, design data, analysis results, and material properties related to the design, manufacturing, and maintenance of mechanical systems and components.\n\n#### Core Information to Retrieve:\n-   **Technical Specifications:** Data sheets, spec sheets, performance curves (for pumps, motors, fans), Bill of Materials (BOM).\n-   **Design & CAD Data:** Keywords like \"drawing,\" \"schematic,\" \"blueprint,\" \"exploded view,\" \"assembly.\" Part numbers (P/N), dimensions, tolerances, and Geometric Dimensioning and Tolerancing (GD&T) symbols.\n-   **Analysis & Simulation Data:** Results from Finite Element Analysis (FEA), Computational Fluid Dynamics (CFD), thermal analysis, and vibration analysis. Keywords include \"stress,\" \"strain,\" \"deflection,\" \"flow rate,\" \"pressure drop,\" \"heat transfer coefficient,\" \"natural frequency.\"\n-   **Material Properties:** Data for metals, plastics, and composites, including \"tensile strength,\" \"yield strength,\" \"Young's modulus,\" \"density,\" \"hardness,\" \"thermal conductivity.\" Specific material names like \"6061-T6 Aluminum,\" \"AISI 304 Stainless Steel,\" \"PEEK,\" \"Titanium.\"\n-   **Manufacturing & Quality:** Information on processes like \"CNC machining,\" \"injection molding,\" \"casting,\" \"welding.\" Quality control procedures, test reports, and validation data.\n-   **Standards & Codes:** References to industry standards like ASTM, ISO, ANSI, SAE, and ASME.\n-   **Component Keywords:** \"Bearing,\" \"gear,\" \"shaft,\" \"fastener,\" \"actuator,\" \"pump,\" \"valve,\" \"piston,\" \"seal,\" \"heat exchanger.\"\n-   **Formulas & Equations:** Physics and engineering equations related to thermodynamics, fluid dynamics, statics, and dynamics.\n-   **Maintenance & Failure:** Failure analysis reports, root cause analysis (RCA), maintenance procedures, lubrication schedules.\n\n#### Information to Ignore (Noise):\n-   Marketing materials, sales brochures, and product advertisements.\n-   Pricing information, customer quotes, invoices, and purchase orders.\n-   Company financial reports, investor relations documents, and stock performance.\n-   Human Resources (HR) documents, such as employee policies, job postings, or benefits information.\n-   Project management documents focused on budget and scheduling rather than technical milestones.\n-   Legal contracts, terms and conditions, and non-disclosure agreements (NDAs).\n-   General corporate communications and press releases."
}