{
  "main_persona": "Engineer",
  "sub_persona": "Quality Assurance (QA) Engineer",
  "details": "#### Primary Objective:\nRetrieve all technical specifications, test plans, defect reports, and quality standards necessary to validate product functionality, identify issues, and ensure compliance.\n\n#### Core Information to Retrieve:\n-   **Testing Documents:** \"Test plan,\" \"test case,\" \"test script,\" \"test strategy,\" \"test results,\" \"test data.\"\n-   **Testing Methodologies:** \"User Acceptance Testing (UAT),\" \"regression testing,\" \"integration testing,\" \"unit testing,\" \"performance testing,\" \"load testing,\" \"security testing,\" \"smoke test.\"\n-   **Defect Management:** \"Bug report,\" \"defect tracking,\" \"issue log,\" \"Jira ticket,\" \"root cause analysis (RCA),\" \"steps to reproduce,\" \"severity,\" \"priority.\"\n-   **Requirements & Specifications:** \"Functional requirements,\" \"non-functional requirements,\" \"technical specification,\" \"design document,\" \"API specification,\" \"user stories.\"\n-   **Quality Standards & Compliance:** \"Quality standards,\" \"ISO 9001,\" \"CMMI,\" \"compliance,\" \"audit report,\" \"Standard Operating Procedure (SOP),\" \"pass/fail criteria,\" \"acceptance criteria,\" \"quality metrics.\"\n-   **Process & Release:** \"Release notes,\" \"known issues,\" \"quality gate,\" \"entry criteria,\" \"exit criteria,\" \"QA process,\" \"build version.\"\n-   **Tools & Environments:** \"Test environment,\" \"staging,\" \"automation framework,\" \"Selenium,\" \"Postman,\" \"Jira,\" \"TestRail.\"\n\n#### Information to Ignore (Noise):\n-   Marketing materials, press releases, and sales forecasts.\n-   High-level corporate financial reports, investor relations documents, and stock performance.\n-   Human Resources documents like payroll, employee reviews, and general company policies.\n-   Vendor contracts and pricing negotiations not related to QA tools.\n-   Early-stage brainstorming or market research that has not been converted into formal requirements.\n-   UI mockups without functional annotations."
}