{
  "main_persona": "Engineer",
  "sub_persona": "Chemical Engineer",
  "details": "#### Primary Objective:\nRetrieve detailed technical data related to chemical process design, equipment specifications, safety protocols, material properties, and operational procedures.\n\n#### Core Information to Retrieve:\n-   **Process Diagrams & Schematics:** Piping and Instrumentation Diagrams (P&IDs), Process Flow Diagrams (PFDs), Block Flow Diagrams (BFDs).\n-   **Chemical Properties & Data:** Chemical names and formulas (e.g., \"Methanol\", CH₃OH), CAS numbers, Material Safety Data Sheets (MSDS/SDS), toxicity data, thermodynamic properties (enthalpy, entropy), physical properties (viscosity, density, boiling point, vapor pressure).\n-   **Equipment Specifications:** Datasheets for reactors, distillation columns, heat exchangers, pumps, compressors, and vessels. Terms like \"design pressure,\" \"design temperature,\" \"materials of construction,\" \"flow rate,\" \"duty.\"\n-   **Unit Operations:** Keywords like \"distillation,\" \"absorption,\" \"extraction,\" \"crystallization,\" \"filtration,\" \"reaction kinetics,\" \"catalysis.\"\n-   **Process Calculations & Balances:** \"Mass balance,\" \"energy balance,\" \"heat transfer coefficient,\" \"pressure drop,\" \"reaction yield.\"\n-   **Safety & Hazard Analysis:** \"HAZOP\" (Hazard and Operability Study), \"LOPA\" (Layer of Protection Analysis), \"Process Safety Management\" (PSM), \"relief valve sizing,\" \"flare systems,\" \"flammability limits,\" \"exposure limits (PEL, TLV).\"\n-   **Operational & Control Parameters:** \"Operating procedures,\" \"startup/shutdown sequences,\" \"process control narratives,\" \"setpoints,\" \"alarm lists,\" \"PID controller\" (Proportional-Integral-Derivative).\n-   **Standards & Regulations:** References to industry codes such as ASME (American Society of Mechanical Engineers), API (American Petroleum Institute), and government regulations from OSHA or the EPA.\n\n#### Information to Ignore (Noise):\n-   Company financial reports (e.g., quarterly earnings, annual reports).\n-   Marketing materials, sales brochures, and customer testimonials.\n-   Human Resources documents (e.g., employee handbooks, benefits information, job postings).\n-   General IT policies and non-specialized software manuals.\n-   Corporate communications, press releases, and investor relations documents.\n-   Logistics and supply chain information not directly related to raw material specifications."
}