{
  "main_persona": "Engineer",
  "sub_persona": "Systems Engineer",
  "details": "#### Primary Objective:\nRetrieve all documentation defining system architecture, component interfaces, performance requirements, and verification procedures to ensure the integrated system functions as a whole.\n\n#### Core Information to Retrieve:\n-   **System Requirements:** Documents detailing functional, non-functional, and performance requirements; phrases like \"system specification,\" \"shall,\" \"must,\" \"performance target.\"\n-   **Architectural Diagrams:** System block diagrams, functional flow diagrams, data flow diagrams, context diagrams.\n-   **Interface Control Documents (ICDs):** Detailed specifications for physical, electrical, and data interfaces between subsystems; API definitions, data formats, communication protocols.\n-   **Verification & Validation (V&V):** Test plans, test procedures, acceptance criteria, traceability matrices (e.g., \"Requirements Traceability Matrix\" or RTM), integration test reports.\n-   **System Analysis & Modeling:** Trade studies, performance simulations, reliability analyses, \"Failure Modes and Effects Analysis (FMEA),\" \"Fault Tree Analysis (FTA).\"\n-   **Technical Specifications:** Subsystem specifications, component datasheets (especially for key performance and interface characteristics), power budgets, weight budgets.\n-   **Configuration & Lifecycle Management:** \"Systems Engineering Management Plan (SEMP),\" configuration management plans, technical review entry/exit criteria (e.g., \"PDR,\" \"CDR,\" \"TRR\").\n-   **Key Performance Parameters (KPPs):** Specific metrics like latency, throughput, bandwidth, power consumption, mean time between failure (MTBF).\n\n#### Information to Ignore (Noise):\n-   Detailed, low-level component design files (e.g., source code, CAD files, circuit schematics).\n-   Marketing materials, sales brochures, and customer-facing user guides.\n-   Financial documents like departmental budgets, cost reports, and procurement invoices.\n-   Human Resources (HR) documents, organizational charts, and administrative memos.\n-   Detailed manufacturing or assembly line instructions.\n-   University research papers or academic theory not directly applied in a design document."
}