{
  "main_persona": "Engineer",
  "sub_persona": "Aerospace Engineer",
  "details": "#### Primary Objective:\nRetrieve detailed technical specifications, design principles, performance data, and regulatory standards relevant to the design, manufacturing, testing, and operation of aircraft and spacecraft.\n\n#### Core Information to Retrieve:\n-   **Technical Specifications:** Phrases like \"design requirements,\" \"system specifications,\" \"mass budget,\" \"power budget,\" \"performance metrics.\"\n-   **Aerodynamics:** Keywords such as \"lift coefficient,\" \"drag coefficient,\" \"lift-to-drag ratio,\" \"Mach number,\" \"Reynolds number,\" \"airfoil profile,\" \"wing loading,\" \"computational fluid dynamics (CFD),\" and \"wind tunnel test data.\"\n-   **Propulsion Systems:** Data on \"jet engines,\" \"rocket engines,\" \"turbofan,\" \"propellants,\" \"specific impulse (Isp),\" \"thrust,\" \"fuel consumption,\" and \"nozzle design.\"\n-   **Structures and Materials:** Information on \"composite materials,\" \"titanium alloys,\" \"aluminum alloys,\" \"stress/strain analysis,\" \"finite element analysis (FEA),\" \"fatigue life,\" \"load paths,\" and \"material properties\" (e.g., tensile strength, density).\n-   **Flight Dynamics & Control:** Concepts like \"stability and control,\" \"guidance, navigation, and control (GNC),\" \"autopilot systems,\" \"actuators,\" \"control surfaces,\" \"fly-by-wire,\" and \"flight envelope.\"\n-   **Avionics and Systems:** Schematics and data for \"avionics architecture,\" \"communication systems,\" \"radar,\" \"sensors,\" \"interface control documents (ICD),\" and \"power distribution.\"\n-   **Design and Manufacturing:** Terms such as \"CAD drawings,\" \"CATIA,\" \"SolidWorks,\" \"tolerance analysis,\" \"assembly procedures,\" and \"manufacturing processes.\"\n-   **Testing and Verification:** Documents related to \"flight test plan,\" \"ground test results,\" \"structural testing,\" \"non-destructive testing (NDT),\" and \"qualification reports.\"\n-   **Standards and Regulations:** References to regulatory bodies and standards like \"FAA,\" \"EASA,\" \"NASA-STD,\" \"MIL-STD,\" \"AS9100,\" \"airworthiness,\" and \"certification.\"\n\n#### Information to Ignore (Noise):\n-   Company financial reports, investor relations documents, and stock performance.\n-   Marketing brochures, sales forecasts, and press releases.\n-   Human Resources documents, such as employee handbooks or corporate policies.\n-   Airline passenger statistics, ticket pricing, and flight schedules.\n-   General news articles about the aerospace industry unless they contain specific technical breakthroughs.\n-   Logistics, supply chain management, and procurement documents.\n-   High-level business strategy or corporate mission statements."
}