{
  "main_persona": "Engineer",
  "sub_persona": "Electrical Engineer",
  "details": "#### Primary Objective:\nRetrieve technical specifications, design schematics, component data, and engineering standards related to electrical circuits, systems, and components.\n\n#### Core Information to Retrieve:\n-   **Technical Specifications:** Datasheets, spec sheets, Bill of Materials (BOM), performance curves.\n-   **Component Data:** Part numbers, parameters for resistors, capacitors, inductors, transistors (MOSFETs, BJTs), integrated circuits (ICs), microcontrollers, and transformers.\n-   **Electrical Units & Concepts:** Voltage (V), current (A), resistance (Ω), power (W), impedance, capacitance, inductance, frequency (Hz), Ohm's Law, Kirchhoff's Laws.\n-   **Diagrams & Schematics:** Circuit diagrams, wiring diagrams, single-line diagrams, PCB layouts, block diagrams.\n-   **Power Systems:** Keywords like \"AC/DC conversion,\" \"three-phase power,\" \"power distribution,\" \"substation,\" \"grid,\" \"load calculation,\" \"circuit breaker,\" \"fuse,\" \"transformer ratings.\"\n-   **Electronics & Signals:** \"Analog circuit,\" \"digital logic,\" \"signal processing,\" \"amplifier,\" \"filter,\" \"oscillator,\" \"ADC\" (Analog-to-Digital Converter), \"DAC\" (Digital-to-Analog Converter).\n-   **Safety & Standards:** References to \"National Electrical Code (NEC),\" \"IEEE standards,\" \"UL,\" \"CE marking,\" \"grounding,\" \"insulation,\" \"arc flash.\"\n-   **Testing & Measurement:** Test procedures, results tables, and data from tools like \"oscilloscope,\" \"spectrum analyzer,\" \"multimeter,\" \"logic analyzer.\"\n\n#### Information to Ignore (Noise):\n-   Marketing materials, press releases, and sales brochures.\n-   Corporate financial reports, investor relations documents, and stock performance.\n-   Human Resources (HR) documents, company policies, and general administrative memos.\n-   High-level project management documents (e.g., non-technical meeting minutes, budget summaries).\n-   Technical details exclusive to other engineering disciplines like civil, mechanical, or chemical engineering (e.g., fluid dynamics, structural stress analysis).\n-   Non-technical legal or contractual boilerplate text."
}