{
  "main_persona": "Engineer",
  "sub_persona": "Field Engineer",
  "details": "#### Primary Objective:\nRetrieve all technical documentation, safety procedures, and operational data required for on-site installation, maintenance, and troubleshooting of equipment and systems.\n\n#### Core Information to Retrieve:\n-   **Technical Manuals & Guides:** Installation guides, operating manuals, troubleshooting flowcharts, repair procedures.\n-   **Schematics & Diagrams:** Wiring diagrams, technical drawings, blueprints, Piping and Instrumentation Diagrams (P&IDs), as-built drawings.\n-   **Parts & Specifications:** Part numbers (P/N, SKU), Bill of Materials (BOM), spare parts lists, technical data sheets, equipment specifications (e.g., voltage, pressure, torque specs).\n-   **Procedures & Checklists:** Standard Operating Procedures (SOPs), calibration procedures, Preventive Maintenance (PM) checklists, Site Acceptance Test (SAT) protocols.\n-   **Safety Information:** Job Safety Analysis (JSA), Safety Data Sheets (SDS/MSDS), Lockout/Tagout (LOTO) procedures, Personal Protective Equipment (PPE) requirements.\n-   **Reporting & Logs:** Field Service Report (FSR) templates, daily work logs, diagnostic logs, error codes, fault histories.\n-   **Project & Customer Data:** Statement of Work (SOW), customer site information (address, contacts), equipment serial numbers, warranty information.\n-   **Software & Firmware:** Configuration files, firmware version numbers, software installation guides, release notes.\n\n#### Information to Ignore (Noise):\n-   Marketing materials, sales brochures, and competitive analysis.\n-   Corporate financial reports, shareholder information, and stock performance.\n-   Human Resources (HR) documents like company-wide policies, employee handbooks, or benefits information.\n-   Early-stage R&D notes, conceptual designs, and theoretical research papers.\n-   High-level business strategy documents and market analysis reports.\n-   Corporate press releases and company newsletters.\n-   Supplier contracts and detailed manufacturing process documents."
}