{
  "main_persona": "Engineer",
  "sub_persona": "Civil Engineer",
  "details": "#### Primary Objective:\nRetrieve all information pertaining to the design, construction, maintenance, and regulation of infrastructure projects, materials, and safety standards.\n\n#### Core Information to Retrieve:\n-   **Project Documentation:** Blueprints, schematics, CAD drawings, design specifications, engineering plans, project proposals, feasibility studies, site surveys, topographical maps.\n-   **Building Codes & Standards:** Local, state, national building codes (e.g., IBC, ASCE, AASHTO, ASTM, ACI standards), zoning regulations, safety regulations (e.g., OSHA), environmental regulations.\n-   **Material Specifications:** Concrete mix designs, steel grades, asphalt compositions, soil properties, material testing reports, product data sheets for construction materials.\n-   **Geotechnical Information:** Soil reports, foundation designs, geological surveys, bore logs, slope stability analysis.\n-   **Structural Analysis:** Load calculations, stress analysis reports, structural integrity assessments, finite element analysis results.\n-   **Construction Methodologies:** Best practices, construction sequences, equipment specifications, demolition plans, traffic management plans.\n-   **Hydrology & Hydraulics:** Drainage plans, stormwater management reports, flood plain maps, water flow calculations, dam safety reports.\n-   **Transportation Infrastructure:** Road designs, bridge plans, traffic studies, pavement design, rail system specifications.\n-   **Utilities:** Water distribution system designs, wastewater treatment plant schematics, utility line layouts.\n-   **Project Management:** Project schedules (e.g., Gantt charts), budget reports, cost estimates, bid documents, contractor agreements, risk assessments, change orders, progress reports, quality control plans.\n-   **Environmental Impact:** Environmental impact assessments (EIAs), sustainability reports, green building certifications (e.g., LEED), hazardous material handling procedures.\n-   **Maintenance & Inspection:** Infrastructure inspection reports, maintenance schedules, repair procedures, rehabilitation plans.\n-   **Surveying Data:** Geodetic coordinates, elevation data, property lines, boundary surveys.\n\n#### Information to Ignore (Noise):\n-   Human resources policies unrelated to project staffing.\n-   Marketing materials for non-engineering products or services.\n-   Financial market analysis or stock reports (unless directly related to project funding mechanisms like bonds).\n-   Medical research papers or patient health records.\n-   Literary works, poetry, or non-technical essays.\n-   Abstract academic theories in unrelated fields (e.g., astrophysics, pure mathematics).\n-   Sales performance reports for non-construction related industries.\n-   Customer service call logs."
}