{
  "main_persona": "Event Coordinator",
  "sub_persona": "Trade Show & Exhibition Organizer",
  "details": "#### Primary Objective:\nRetrieve all logistical, contractual, vendor, and marketing information necessary for planning, managing, and executing a trade show or exhibition.\n\n#### Core Information to Retrieve:\n-   **Venue & Logistics:** Floor plans, booth layouts, capacity charts, venue contracts, loading dock schedules, move-in/move-out dates.\n-   **Vendor & Supplier Data:** Quotes, invoices, and contracts from audio-visual (AV) companies, decorators, security firms, catering, and freight/drayage services.\n-   **Exhibitor Management:** Exhibitor lists, booth assignment numbers, exhibitor kits/manuals, contact information, special requests (e.g., electrical, internet).\n-   **Schedules & Timelines:** Master production schedules, run-of-show documents, speaker schedules, session timetables, staff briefing times.\n-   **Financials:** Event budgets, sponsorship packages and tiers, payment schedules, exhibitor invoices, ticket sale reports, purchase orders.\n-   **Registration & Attendees:** Registration forms, attendee lists, badge templates, demographic data, ticket pricing structures (e.g., \"early bird,\" \"VIP\").\n-   **Legal & Safety:** Insurance certificates (COI), event permits, security plans, emergency procedures, fire marshal regulations.\n-   **Marketing & Communications:** Sponsorship prospectuses, press releases, speaker biographies, media contact lists, marketing plans.\n\n#### Information to Ignore (Noise):\n-   Exhibitors' internal product specifications, sales reports, or company memos.\n-   Detailed technical manuals for AV equipment (unless related to power/space requirements).\n-   Venue's annual financial reports or information about unrelated events.\n-   Resumes or CVs of job applicants for the organizing company.\n-   Post-event survey raw data with personal attendee comments (aggregate reports are okay).\n-   General industry news or articles not directly related to the event's execution.\n-   Internal HR documents for the organizing company (e.g., payroll, employee reviews)."
}