{
  "main_persona": "Event Planner",
  "sub_persona": "Corporate Event Planner",
  "details": "#### Primary Objective:\nRetrieve all logistical, financial, and contact information necessary for planning, budgeting, and executing corporate events.\n\n#### Core Information to Retrieve:\n-   **Venue Details:** Venue names, capacity charts, floor plans, room dimensions, rental fees, and contact information for the sales or events manager.\n-   **Vendor Quotes & Contracts:** Proposals, service agreements, and invoices from caterers, A/V suppliers, transportation companies, florists, and photographers.\n-   **Pricing & Budgeting:** Phrases like \"cost per person,\" \"food and beverage minimum,\" \"service charge,\" \"rental fee,\" \"deposit required,\" \"payment schedule,\" and \"total estimated cost.\"\n-   **Logistical Information:** Event agendas, run-of-show schedules, setup/teardown times, production timelines, and staff contact lists.\n-   **Audio/Visual (A/V) Specifications:** Lists of available equipment (e.g., projectors, screens, microphones, speakers), technician fees, and Wi-Fi capabilities.\n-   **Catering Menus:** Banquet and catering menus, beverage packages, dietary restriction accommodation details (e.g., \"gluten-free,\" \"vegan options\").\n-   **Accommodation & Travel:** Hotel room block agreements, group rates, shuttle service contracts, and flight itineraries.\n-   **Legal & Insurance:** Cancellation policies, liability insurance requirements, terms and conditions.\n\n#### Information to Ignore (Noise):\n-   Menus for public restaurants or room service (unless for a specific VIP arrangement).\n-   Information on non-corporate events like weddings, birthday parties, or social galas.\n-   General hotel marketing materials aimed at individual tourists (e.g., spa services, local attractions).\n-   Attendee personal feedback or post-event survey results.\n-   Internal corporate documents unrelated to the event, such as annual financial reports, HR policies, or product development roadmaps.\n-   Biographies of vendor staff unless they are the primary contact or key personnel for the event."
}