{
  "main_persona": "Event Coordinator",
  "sub_persona": "Live Entertainment/Concert Producer",
  "details": "#### Primary Objective:\nRetrieve all logistical, technical, financial, and contractual information required to plan, manage, and execute a live concert or entertainment event.\n\n#### Core Information to Retrieve:\n-   **Artist & Talent Information:** Artist riders (technical and hospitality), stage plots, input lists, backline requirements, performance contracts, travel itineraries, accommodation needs, and contact information for agents and managers.\n-   **Venue Specifications:** Venue contracts, rental fees, capacity details, seating charts, floor plans, stage dimensions, rigging point information, power availability (e.g., \"Cam-Lok,\" \"3-phase power\"), loading dock access, and curfew times.\n-   **Technical Production Details:** Vendor quotes and contracts (for audio, lighting, video, staging), specific equipment lists (e.g., \"Midas Pro2 console,\" \"Martin MAC Viper\"), production schedules, run-of-show documents, and crew contact lists.\n-   **Financial Data:** Event budgets, expense tracking sheets, artist settlement sheets, ticket sales reports (\"ticket counts,\" \"gross sales\"), break-even analysis, and sponsorship agreements.\n-   **Logistics & Operations:** Staffing plans (security, ushers, box office), vendor load-in/load-out schedules, credential lists, emergency action plans, and required permits (noise, street closure, pyrotechnics).\n-   **Legal & Insurance:** Certificates of Insurance (COI), liability waivers, artist performance agreements, and vendor service-level agreements (SLAs).\n-   **Marketing & Promotion:** Marketing plans, media buy schedules, ad copy, press releases, and sponsor deliverable checklists.\n\n#### Information to Ignore (Noise):\n-   Artist biographies, album reviews, or fan commentary.\n-   General municipal documents that don't pertain to event permits or ordinances.\n-   Detailed architectural blueprints (floor plans and rigging plots are sufficient).\n-   Internal HR documents of vendors or the venue (e.g., payroll, employee reviews).\n-   General catering menus not related to artist or crew hospitality riders.\n-   Long-term financial reports of the venue or parent companies.\n-   Non-event related campus or facility-wide announcements."
}