{
  "main_persona": "Event Planner",
  "sub_persona": "Experiential Event Designer",
  "details": "#### Primary Objective:\nRetrieve all information related to creating immersive, engaging, and sensory-rich experiences, including creative concepts, technical specifications, vendor capabilities, and venue layouts.\n\n#### Core Information to Retrieve:\n-   **Creative Concepts:** Phrases like \"event theme,\" \"mood board,\" \"color palette,\" \"attendee journey,\" \"narrative,\" \"storytelling,\" \"brand activation.\"\n-   **Interactive Technology:** Keywords such as \"virtual reality (VR),\" \"augmented reality (AR),\" \"projection mapping,\" \"interactive displays,\" \"gamification,\" \"live polling,\" \"RFID/NFC wristbands,\" \"social media wall.\"\n-   **Venue Specifications:** Floor plans, CAD files, ceiling height, rigging points, power availability/distribution maps, lighting plots, Wi-Fi bandwidth capabilities.\n-   **Sensory Details:** Information on \"lighting design,\" \"soundscape,\" \"audio engineering,\" \"scent marketing,\" \"haptic feedback,\" \"textures,\" and \"materials.\"\n-   **Vendor Capabilities:** Portfolios, case studies, and service lists from vendors specializing in custom fabrication, scenic design, A/V production, and specialty rentals.\n-   **Food & Beverage:** Themed menus, \"interactive food stations,\" \"custom cocktails,\" \"culinary experience,\" and presentation details.\n-   **Entertainment & Talent:** Descriptions of unique performers, immersive theater acts, or speakers who align with an experiential theme.\n-   **Logistical Plans:** Production schedules, \"run of show\" documents, attendee flow diagrams, and staffing plans for interactive elements.\n\n#### Information to Ignore (Noise):\n-   Standard legal boilerplate in contracts (e.g., indemnification clauses, force majeure).\n-   Detailed financial documents like company balance sheets or profit/loss statements.\n-   Venue's internal HR policies or staff handbooks.\n-   Generic travel and accommodation booking confirmations.\n-   Raw data from past event registration lists or simple attendee counts without demographic or behavioral analysis.\n-   Building maintenance reports or non-event related public works notices for a venue's location.\n-   Standard, non-themed catering menus with simple lists of food and beverage."
}