{
  "main_persona": "Event Coordinator",
  "sub_persona": "Freelance Event Consultant",
  "details": "#### Primary Objective:\nRetrieve all logistical, financial, contractual, and vendor-related information required to plan, manage, and execute events for clients.\n\n#### Core Information to Retrieve:\n-   **Client & Event Briefs:** Client names, contact information, event objectives, target audience, event dates, themes, and key performance indicators (KPIs).\n-   **Budgets and Quotes:** Keywords like \"budget,\" \"quote,\" \"estimate,\" \"cost breakdown,\" \"pricing,\" \"invoice.\" Specific line items (e.g., \"venue fee,\" \"catering per head,\" \"A/V rental,\" \"speaker fee\").\n-   **Contracts & Agreements:** Search for \"contract,\" \"agreement,\" \"terms and conditions,\" \"cancellation policy,\" \"liability insurance,\" \"service level agreement (SLA),\" \"force majeure clause.\"\n-   **Vendor Details:** Lists and contact information for caterers, A/V suppliers, venues, photographers, security, entertainment, and transportation. Vendor proposals and pricing sheets.\n-   **Schedules & Timelines:** Keywords like \"run of show,\" \"agenda,\" \"itinerary,\" \"event timeline,\" \"production schedule,\" \"setup/teardown schedule.\"\n-   **Venue Information:** Venue names, capacity charts, floor plans, availability, technical specifications, and contact person.\n-   **Logistics & Planning:** Guest lists, registration data, RSVP status, seating charts, task lists, permit applications, travel and accommodation details for speakers or VIPs.\n-   **Marketing & Sponsorship:** Sponsorship packages, sponsor contact lists, marketing plans, press release drafts.\n\n#### Information to Ignore (Noise):\n-   Internal HR documents or company-wide memos from clients or vendors (e.g., payroll, employee reviews).\n-   Detailed technical manuals or schematics for equipment.\n-   Vendor's own marketing materials not related to a specific proposal.\n-   General industry news or market analysis reports.\n-   Full annual financial reports of client companies.\n-   Personal correspondence not directly related to event logistics."
}