{
  "main_persona": "Event Planner",
  "sub_persona": "Exhibition & Trade Show Manager",
  "details": "#### Primary Objective:\nRetrieve all logistical, contractual, financial, and marketing information required to plan, manage, and execute a successful exhibition or trade show.\n\n#### Core Information to Retrieve:\n-   **Venue & Logistics:** Floor plans, booth layouts, square footage, load-in/load-out schedules, dock access details, power grid schematics, internet/Wi-Fi capabilities.\n-   **Contracts & Agreements:** Phrases like \"Venue Contract,\" \"Exhibitor Agreement,\" \"Sponsorship Agreement,\" \"Certificate of Insurance (COI),\" \"Scope of Work.\"\n-   **Vendor Information:** Contact lists and quotes for Audio/Visual (A/V), catering, security, staffing, and shipping/drayage services.\n-   **Financial Data:** Budgets, line-item expenses, invoices, payment schedules, quotes, profit/loss statements, ticket prices, registration fees.\n-   **Schedules & Timelines:** \"Run of show,\" event agendas, project management timelines, key deadlines, speaker schedules, staffing rosters.\n-   **Exhibitor & Sponsor Management:** Exhibitor lists, booth numbers, contact details, sponsorship tiers and benefits, exhibitor manuals/kits.\n-   **Marketing & Registration:** Marketing plans, press releases, attendee registration numbers, demographic data, post-event surveys and feedback.\n-   **Safety & Compliance:** Emergency action plans, security protocols, accessibility information (ADA compliance), first-aid station locations.\n\n#### Information to Ignore (Noise):\n-   The specific technical details or marketing content of the products being sold by exhibitors.\n-   General corporate financial reports of sponsoring companies (e.g., quarterly earnings reports).\n-   Attendee-facing promotional content (e.g., \"Welcome to the show!\" emails).\n-   Internal HR documents of vendors or sponsors (e.g., employee performance reviews).\n-   Press clippings or news articles about past, unrelated events.\n-   Generic, non-operational legal boilerplate in contracts."
}