{
  "main_persona": "Event Coordinator",
  "sub_persona": "Wedding & Social Event Planner",
  "details": "#### Primary Objective:\nRetrieve all actionable details regarding vendors, venues, clients, schedules, and budgets necessary for planning and executing weddings and social events.\n\n#### Core Information to Retrieve:\n-   **Vendor Information:**\n    -   Company names and specific contact people (e.g., \"Jane Doe at Elegant Catering\").\n    -   Contact details: phone numbers, email addresses.\n    -   Service types: \"caterer,\" \"florist,\" \"photographer,\" \"videographer,\" \"DJ,\" \"band,\" \"officiant,\" \"bakery,\" \"transportation.\"\n    -   Pricing & Packages: \"Price list,\" \"package details,\" \"cost per person,\" \"hourly rate,\" \"service fee,\" \"gratuity.\"\n    -   Contracts & Agreements: Phrases like \"contract,\" \"terms and conditions,\" \"cancellation policy,\" \"deposit due,\" \"final payment.\"\n-   **Venue Details:**\n    -   Venue names and addresses.\n    -   Capacity figures: \"guest count,\" \"maximum capacity,\" \"seats up to.\"\n    -   Availability: Calendars, \"booked dates,\" \"available dates.\"\n    -   Specific spaces: \"ballroom,\" \"ceremony site,\" \"cocktail hour space,\" \"bridal suite.\"\n    -   Policies: \"Preferred vendor list,\" \"alcohol policy,\" \"insurance requirement,\" \"noise ordinance.\"\n    -   Logistics: \"Floor plan,\" \"seating chart,\" \"A/V equipment,\" \"parking information.\"\n-   **Event-Specific Data:**\n    -   Client names and contact information.\n    -   Event type: \"wedding,\" \"anniversary,\" \"engagement party,\" \"birthday.\"\n    -   Event date and time.\n    -   Schedules & Timelines: \"Day-of timeline,\" \"itinerary,\" \"run of show,\" \"ceremony time,\" \"reception start.\"\n    -   Guest Information: \"Guest list,\" \"RSVP count,\" \"table assignments,\" \"seating chart.\"\n    -   Client Preferences: \"Color palette,\" \"theme,\" \"special requests,\" \"dietary restrictions,\" \"allergies,\" \"song request list.\"\n-   **Financial Information:**\n    -   \"Budget,\" \"invoice,\" \"receipt,\" \"payment schedule,\" \"expense tracking.\"\n    -   Specific costs and line items associated with vendors.\n\n#### Information to Ignore (Noise):\n-   **Corporate Event Terminology:** \"Keynote speaker,\" \"breakout session,\" \"conference agenda,\" \"trade show,\" \"shareholder meeting.\"\n-   **Public Event Terminology:** \"Ticket sales,\" \"general admission,\" \"sponsorship package,\" \"parade route.\"\n-   **Irrelevant Vendor Details:** Vendors' internal staffing memos, detailed technical specifications of equipment (e.g., camera sensor models), supplier invoices to the vendor.\n-   **General Business Documents:** Corporate annual reports, marketing analytics, press releases, company mission statements.\n-   **Non-Event Related Information:** Personal correspondence between contacts, unrelated news articles, construction or zoning permits not directly affecting the venue's operation on the event date."
}