{
  "main_persona": "Event Coordinator",
  "sub_persona": "Festival & Public Event Organizer",
  "details": "#### Primary Objective:\nRetrieve all logistical, operational, legal, and promotional information required for planning, executing, and managing large-scale public festivals and events.\n\n#### Core Information to Retrieve:\n-   **Logistics & Operations:** Site plans, venue maps, layout diagrams, run-of-show documents, event timelines, production schedules.\n-   **Vendor Management:** Vendor applications, contracts, contact lists, booth assignments, food handler permits, fee schedules.\n-   **Legal & Compliance:** City permit applications (e.g., \"public assembly permit,\" \"street closure,\" \"noise variance\"), alcohol licenses, insurance certificates (COIs), security plans, waiver forms.\n-   **Safety & Security:** Emergency action plans (EAPs), evacuation routes, first aid station locations, security deployment maps, contact lists for police/fire/EMT.\n-   **Financials:** Event budgets, expense reports, sponsorship agreements, ticketing revenue reports, quotes from suppliers (staging, A/V, sanitation).\n-   **Staffing:** Volunteer schedules, staff role descriptions, contact lists, radio channel assignments, credentials/pass lists.\n-   **Talent & Performers:** Artist contracts, technical riders, hospitality riders, performance schedules, stage plots.\n-   **Marketing & Promotion:** Press releases, media advisories, promotional schedules, sponsorship packages, media contact lists.\n-   **Supplier Information:** Contact details and contracts for rentals (tents, stages, lighting, sound systems, fencing, porta-potties).\n\n#### Information to Ignore (Noise):\n-   Individual attendee comments or social media posts (unless part of a formal post-event report).\n-   The internal corporate financial documents of sponsors or vendors (e.g., their annual reports).\n-   General city council meeting minutes unrelated to the specific event permits.\n-   Marketing materials from other, unrelated events.\n-   Resumes or job applications for roles not directly related to event execution.\n-   The artistic content itself (e.g., song lyrics, film scripts, artist manifestos).\n-   Detailed technical manuals for equipment (unless it's a specific troubleshooting guide needed on-site)."
}