{
  "main_persona": "Event Coordinator",
  "sub_persona": "Conference & Association Planner",
  "details": "#### Primary Objective:\nRetrieve all logistical, contractual, and programmatic details required to plan, budget, and execute professional conferences and association meetings.\n\n#### Core Information to Retrieve:\n-   **Venue Logistics:** Floor plans, capacity charts (e.g., \"theater-style,\" \"classroom,\" \"banquet\"), venue rental agreements, pricing sheets, insurance requirements (\"Certificate of Insurance\").\n-   **Vendor Proposals & Contracts:** Quotes, invoices, and service agreements from caterers, audiovisual (AV) companies, decorators, transportation services, and security firms.\n-   **Food & Beverage:** Catering menus, banquet event orders (BEOs), food and beverage minimums (\"F&B minimums\"), dietary restriction summaries.\n-   **Program & Agenda:** Phrases like \"run of show,\" \"schedule of events,\" \"agenda,\" session titles, speaker names, breakout session assignments.\n-   **Speaker Management:** Speaker bios, headshots, contact information, travel itineraries, presentation requirements, and speaker agreements.\n-   **Registration & Attendance:** Attendee registration numbers, registration confirmation lists, name badge data, ticket sales reports.\n-   **Sponsors & Exhibitors:** Sponsorship packages, signed sponsor agreements, exhibitor kits, booth layout diagrams, exhibitor contact lists.\n-   **Financials:** Event budgets, expense tracking sheets, payment schedules, invoice summaries, final cost analysis.\n-   **Accommodations:** Hotel room block agreements, cutoff dates, rooming lists.\n\n#### Information to Ignore (Noise):\n-   Full slide decks or academic papers from speakers (abstracts and titles are sufficient).\n-   Marketing materials for unrelated events (e.g., weddings, social parties, public concerts).\n-   Internal, non-event-related association documents (e.g., general membership newsletters, HR policies, board meeting minutes on unrelated topics).\n-   General marketing brochures from vendors that lack specific pricing or service details.\n-   Individual attendee travel receipts or personal expense reports.\n-   Public-facing restaurant menus or general hotel amenity information not related to the event block.\n-   Press clippings or news articles about the association's industry unless they directly mention a competing event."
}