{
  "main_persona": "Event Coordinator",
  "sub_persona": "Sports Event Manager",
  "details": "#### Primary Objective:\nRetrieve all logistical, operational, financial, and administrative information required to plan, execute, and report on a specific sports event.\n\n#### Core Information to Retrieve:\n-   **Venue Logistics:** Venue contracts, floor plans, seating charts, capacity limits, availability calendars, and contact information for venue staff.\n-   **Schedules & Timelines:** Game schedules, event day \"run of show,\" setup and teardown schedules, broadcast schedules, volunteer/staff shift schedules.\n-   **Vendor & Supplier Management:** Quotes, invoices, and contracts for catering, security, medical services (EMS), audio/visual equipment, sanitation, and merchandise.\n-   **Budget & Financials:** Event budgets, line-item costs, expense reports, ticket sales data, revenue summaries, and sponsorship payment tracking.\n-   **Staffing & Credentials:** Staff rosters, volunteer lists, role assignments, contact sheets, credential request forms, and access control plans.\n-   **Safety & Emergency Plans:** Security briefing documents, emergency action plans, medical incident protocols, evacuation routes, and weather contingency plans.\n-   **Team & Participant Information:** Team rosters, athlete registration lists, travel itineraries, accommodation details, and pre-event communications.\n-   **Sponsorship & Media:** Sponsorship agreements, activation requirements, media credential lists, press box information, and interview schedules.\n\n#### Information to Ignore (Noise):\n-   Detailed player performance statistics and historical athletic records.\n-   General sports news articles or opinion pieces not directly related to the event.\n-   Fan commentary from social media or online forums.\n-   Marketing creative files (e.g., raw video, graphic design files).\n-   Annual financial reports for the larger sports league or organization.\n-   Deep historical archives of the sport or venue.\n-   Biographies of athletes or team histories."
}