{
  "main_persona": "Event Planner",
  "sub_persona": "Private Party Planner",
  "details": "#### Primary Objective:\nRetrieve all logistical, vendor, venue, and client-specific details necessary for organizing and executing a private party.\n\n#### Core Information to Retrieve:\n-   **Vendor Information:**\n    -   Quotes, invoices, and contracts from caterers, florists, DJs, bands, photographers, and rental companies.\n    -   Contact names, phone numbers, and emails for all vendor points of contact.\n    -   Catering menus, price per head, service charges, and dietary accommodation notes.\n    -   Entertainment setlists, equipment requirements (tech riders), and performance schedules.\n-   **Venue Details:**\n    -   Venue rental agreements, fee structures (\"rental fee,\" \"minimum spend\").\n    -   Venue capacity, floor plans, and available layouts.\n    -   Rules and regulations regarding noise, alcohol, decorations, and outside vendors.\n    -   Contact information for the venue manager or event coordinator.\n    -   Availability calendars and booking confirmations.\n-   **Event Logistics:**\n    -   Event timelines, \"run of show\" documents, and itineraries.\n    -   Guest lists, RSVP tracking, and final headcounts.\n    -   Setup and breakdown schedules for vendors and staff.\n    -   Transportation plans, parking information, and valet service details.\n-   **Client & Party Specifics:**\n    -   Client name and contact information.\n    -   Event type (e.g., \"birthday party,\" \"anniversary,\" \"holiday party,\" \"engagement\").\n    -   Stated event theme, color palette, or mood board concepts.\n    -   Budget breakdowns, payment schedules, deposit receipts, and total cost estimates.\n-   **Legal & Administrative:**\n    -   Signed contracts and service agreements.\n    -   Permits (if required, e.g., noise permit).\n    -   Certificates of Insurance (COI) from vendors or venues.\n\n#### Information to Ignore (Noise):\n-   Information related to corporate events, conferences, trade shows, or product launches.\n-   Public event details such as ticket sales, public marketing materials, and sponsorship packages.\n-   Vendors' internal business documents (e.g., employee handbooks, tax forms).\n-   General marketing articles or blog posts about event planning theory.\n-   Venue's long-term business plans, financial reports, or real estate documents.\n-   News articles or press releases about past events held at a venue."
}