{
  "main_persona": "Event Coordinator",
  "sub_persona": "Venue Event Manager",
  "details": "#### Primary Objective:\nRetrieve all information pertaining to venue logistics, operational procedures, event scheduling, client requirements, and vendor coordination essential for managing events at a specific facility.\n\n#### Core Information to Retrieve:\n-   **Venue Specifications:** Floor plans, room capacities (e.g., \"Max Occupancy,\" \"Seated Capacity\"), dimensions, equipment inventory (A/V systems, lighting, staging), power diagrams, utility access points, internet connectivity details.\n-   **Booking & Scheduling:** Venue availability calendars, booking agreements, reservation policies, contract templates, setup/teardown schedules, event timelines, cancellation policies, deposit schedules.\n-   **Operational Protocols:** Emergency response plans (e.g., \"Evacuation Procedures,\" \"First Aid Stations\"), security guidelines, access control policies (e.g., \"Loading Dock Access,\" \"Staff Entrance\"), cleaning schedules, waste disposal procedures, sound restrictions.\n-   **Client & Event Requirements:** Client contracts, event specific needs lists (e.g., \"Guest Count,\" \"Dietary Restrictions,\" \"Technical Rider\"), floor plans for specific events, run-of-show documents, contact information for event organizers and key stakeholders.\n-   **Vendor Management:** Approved vendor lists, vendor contact details, vendor access policies, delivery schedules, service level agreements (SLAs) for caterers, decorators, production companies, and security services.\n-   **Staffing & Roles:** Staffing schedules, team assignments, duty rosters, internal communication protocols (e.g., \"radio channels,\" \"emergency contacts\"), post-event reporting forms.\n-   **Safety & Compliance:** Fire codes, health regulations, safety checklists, permit requirements (e.g., \"liquor license,\" \"occupancy permit\"), insurance certificates, ADA compliance guidelines, incident reports.\n-   **Financial Information:** Venue rental rates, equipment rental fees, deposit structures, payment schedules, invoicing procedures, cost estimates for venue services, outstanding balances.\n-   **Marketing & Sales Materials (Venue-Specific):** Venue brochures, photo galleries, virtual tours, sample menus (if in-house catering), client testimonials related to venue experience, FAQ documents for event organizers.\n\n#### Information to Ignore (Noise):\n-   Broad industry news or general event trends not specific to venue operations or management.\n-   Detailed financial statements or annual reports of the venue's parent company, unrelated to event pricing or operations.\n-   Architectural blueprints for future, unrelated building projects or general urban planning documents.\n-   Human resources documents unrelated to staffing specific events (e.g., general employee reviews, benefits packages, hiring policies).\n-   Highly technical engineering specifications for core building infrastructure (e.g., HVAC schematics, detailed plumbing diagrams), unless directly impacting an event setup or safety.\n-   Marketing campaign strategies for the venue's brand, unless directly aimed at attracting event bookings or providing client resources.\n-   Legal precedents or court cases unrelated to venue safety, contracts, or permits.\n-   Academic research papers on event management theory or historical event studies.\n-   Personal emails or communications not directly related to event operations or specific client interactions."
}