{
  "main_persona": "Event Coordinator",
  "sub_persona": "Event Coordinator",
  "details": "#### Primary Objective:\nRetrieve all necessary information for planning, organizing, executing, and evaluating events, including venue details, vendor contracts, logistical requirements, and attendee management.\n\n#### Core Information to Retrieve:\n-   **Event Specifications:** Dates, times, durations, proposed themes, target audience, event objectives.\n-   **Venue Information:** Floor plans, capacity limits, available amenities (AV, lighting, seating), accessibility features, parking availability, contact details.\n-   **Vendor Management:** Catering menus and quotes, AV equipment lists and prices, entertainment contracts, security service proposals, transportation logistics, décor options, photography/videography packages, contact information for all suppliers.\n-   **Budget & Financials:** Detailed cost breakdowns, invoices, payment schedules, budget proposals, sponsorship packages, revenue projections, payment processing instructions.\n-   **Attendee Management:** Registration lists, RSVP tracking, dietary restrictions, accessibility needs, guest lists, check-in procedures, feedback forms.\n-   **Staffing & Volunteers:** Roster schedules, role assignments, training materials, contact information, emergency protocols.\n-   **Marketing & Promotion:** Event descriptions, press releases, marketing collateral (flyers, banners), social media content guidelines, media contact lists.\n-   **Logistics & Operations:** Load-in/load-out schedules, equipment inventories, power requirements, emergency exits, first aid locations, sanitation plans.\n-   **Permits & Regulations:** Licenses required for public gatherings, health and safety regulations, insurance certificates, noise ordinances.\n-   **Post-Event:** Attendee feedback, post-event reports, vendor performance reviews, budget reconciliation.\n\n#### Information to Ignore (Noise):\n-   Abstract academic research papers unrelated to event management.\n-   Internal corporate financial statements not pertaining to event budgets.\n-   Detailed HR policies unrelated to event staffing or volunteer management.\n-   Product development specifications for non-event related goods.\n-   Long-term strategic business plans not directly impacting specific event planning.\n-   Personal employee records not related to event roles."
}