{
  "main_persona": "Event Planner",
  "sub_persona": "Independent Event Consultant",
  "details": "#### Primary Objective:\nRetrieve all actionable information regarding venues, vendors, budgets, schedules, and contracts necessary for planning and executing client events.\n\n#### Core Information to Retrieve:\n-   **Venue Details:** Capacity numbers (seated, standing), floor plans, rental fees, availability dates, contact person, address, in-house A/V capabilities, parking information.\n-   **Vendor Quotes & Proposals:** Price lists, service packages, and itemized estimates from caterers, florists, photographers, A/V providers, and rental companies.\n-   **Contracts & Agreements:** Search for keywords like \"contract,\" \"agreement,\" \"scope of work,\" \"terms and conditions,\" \"deposit,\" \"cancellation policy,\" \"force majeure.\"\n-   **Budgeting & Financials:** Line items, total costs, payment schedules, tax and gratuity calculations, \"invoice,\" \"quote,\" \"final bill.\"\n-   **Schedules & Timelines:** \"Run of show,\" \"event schedule,\" \"timeline,\" \"agenda,\" setup times, breakdown times, load-in/load-out instructions.\n-   **Client Requirements:** Client names, event objectives, theme descriptions, color palettes, dietary restrictions, guest count estimates, RSVP lists.\n-   **Logistics & Contacts:** Contact lists for all vendors, staff, and client points-of-contact; transportation schedules; equipment rental lists.\n-   **Legal & Insurance:** Phrases like \"liability insurance,\" \"Certificate of Insurance (COI),\" \"permit requirements,\" \"indemnification.\"\n\n#### Information to Ignore (Noise):\n-   Vendor marketing materials not containing specific price or service details (e.g., company history blogs, team bios).\n-   Client's internal corporate documents not related to the event (e.g., annual reports, HR policies).\n-   General news articles or press releases about a venue or company.\n-   Outdated proposals or contracts from past, irrelevant events.\n-   Personal correspondence between vendor staff members.\n-   Detailed technical manuals for A/V equipment unless a specific model is being rented."
}