{
  "main_persona": "Event Coordinator",
  "sub_persona": "Corporate Event Planner",
  "details": "#### Primary Objective:\nRetrieve all logistical, vendor, financial, and scheduling information required to plan, execute, and evaluate a corporate event.\n\n#### Core Information to Retrieve:\n-   **Vendor & Venue Details:** Contracts, quotes, proposals, invoices, contact information (phone, email) for caterers, A/V technicians, venues, transportation services, and entertainers.\n-   **Logistics & Scheduling:** Event agendas, schedules, timelines, run-of-show documents, floor plans, seating charts, and setup diagrams.\n-   **Financial Data:** Budget spreadsheets, expense reports, line items, payment schedules, phrases like \"deposit due,\" \"final payment,\" and sponsorship agreements.\n-   **Attendee Information:** Registration lists, attendee names, company affiliations, dietary restrictions, RSVP status, and special accommodation requests.\n-   **Event Content:** Speaker names, biographies, presentation titles, keynote topics, and workshop descriptions.\n-   **Travel & Accommodation:** Hotel room blocks, booking confirmations, flight itineraries, and ground transportation schedules (e.g., \"shuttle service\").\n-   **Key Documents & Terms:** Banquet Event Orders (BEOs), Certificates of Insurance (COI), rider agreements, and service level agreements (SLAs).\n\n#### Information to Ignore (Noise):\n-   Information related to non-corporate events like weddings, private parties, or social galas.\n-   General corporate documents unrelated to events (e.g., HR policies, annual financial reports, product schematics).\n-   Marketing material from vendors that is not a specific quote, proposal, or contract for an event.\n-   Detailed presentation content or slide decks from speakers (unless they contain logistical requirements).\n-   General employee correspondence or internal memos not related to event planning tasks.\n-   News articles or press releases about the company's general business activities."
}