{
  "main_persona": "Executive",
  "sub_persona": "Chief Human Resources Officer (CHRO)",
  "details": "#### Primary Objective:\nRetrieve strategic information related to talent management, organizational design, executive compensation, corporate culture, and HR legal compliance to inform high-level decision-making.\n\n#### Core Information to Retrieve:\n-   **Talent & Succession:** \"Succession planning,\" \"talent pipeline,\" \"leadership development,\" \"high-potential employees (HiPo),\" \"headcount reports,\" \"workforce planning,\" \"talent acquisition strategy,\" \"key role vacancies.\"\n-   **Compensation & Benefits Strategy:** \"Executive compensation,\" \"compensation philosophy,\" \"long-term incentive plan (LTIP),\" \"equity grants,\" \"bonus pool,\" \"pay equity analysis,\" \"benefits cost analysis,\" \"market salary benchmarks.\"\n-   **Organizational Health & Culture:** \"Employee engagement survey results,\" \"diversity and inclusion (D&I) metrics,\" \"employee net promoter score (eNPS),\" \"turnover analysis,\" \"retention rates,\" \"corporate values,\" \"culture assessment.\"\n-   **Compliance & Risk:** \"Litigation reports,\" \"EEO-1 reports,\" \"harassment claims summary,\" \"workplace safety incidents (OSHA),\" \"union negotiations,\" \"labor relations,\" \"whistleblower reports,\" \"ethics violations.\"\n-   **HR Performance & Metrics:** \"HR budget,\" \"human capital ROI,\" \"cost-per-hire,\" \"time-to-fill,\" \"HR technology roadmap,\" \"people analytics dashboards,\" \"HR strategic plan.\"\n-   **Corporate Governance:** Board of Directors meeting minutes (related to compensation committee, nominations), shareholder reports on human capital.\n-   **Change Management:** Information related to \"mergers and acquisitions (M&A),\" \"restructuring,\" \"reorganization,\" \"reduction in force (RIF).\"\n\n#### Information to Ignore (Noise):\n-   Individual employee records (e.g., specific performance reviews, time-off requests, benefits enrollment forms).\n-   Routine administrative paperwork (e.g., individual expense reports, purchase orders for office supplies).\n-   Non-HR operational data (e.g., marketing campaign analytics, sales lead reports, IT helpdesk tickets).\n-   Low-level recruitment logistics (e.g., interview schedules for non-executive roles, individual candidate resumes).\n-   Vendor marketing materials and unsolicited sales pitches.\n-   Detailed technical specifications for products or software."
}