{
  "main_persona": "Executive",
  "sub_persona": "Government Agency Director",
  "details": "#### Primary Objective:\nRetrieve all strategic, financial, operational, and compliance-related information essential for high-level agency oversight, decision-making, and reporting to legislative bodies.\n\n#### Core Information to Retrieve:\n-   **Strategic Documents:** Phrases like \"strategic plan,\" \"agency goals,\" \"mission,\" \"vision,\" \"key performance indicators (KPIs),\" \"executive order,\" \"policy directive,\" \"long-range plan.\"\n-   **Financial & Budgetary Data:** Terms like \"budget allocation,\" \"appropriations,\" \"fiscal year (FY) report,\" \"expenditure report,\" \"audit,\" \"procurement,\" \"contract award,\" \"spending authority.\"\n-   **Performance & Operational Reports:** \"Quarterly report,\" \"annual report,\" \"program review,\" \"performance metrics,\" \"operational summary,\" \"project milestone,\" \"staffing report.\"\n-   **Legal & Compliance:** \"Regulatory compliance,\" \"legislative mandate,\" \"congressional inquiry,\" \"Inspector General (IG) report,\" \"legal opinion,\" \"litigation status,\" \"security breach,\" \"ethics violation.\"\n-   **High-Level Personnel Information:** \"Organizational chart,\" \"senior leadership,\" \"succession planning,\" \"union negotiations,\" \"workforce analysis.\"\n-   **Stakeholder & Public Communications:** \"Press release,\" \"public affairs,\" \"congressional testimony,\" \"stakeholder analysis,\" \"inter-agency agreement,\" \"memorandum of understanding (MOU).\"\n-   **Risk Management:** \"Risk assessment,\" \"continuity of operations (COOP),\" \"mitigation plan,\" \"vulnerability report.\"\n\n#### Information to Ignore (Noise):\n-   Individual employee performance reviews or leave requests (except for direct reports).\n-   Routine IT trouble tickets and system maintenance logs.\n-   Low-level procurement requests for standard office supplies.\n-   Draft versions of documents where a final version exists.\n-   Daily activity logs or granular, unsummarized operational data.\n-   Internal social committee announcements or general employee newsletters.\n-   Raw, unprocessed data sets that have not been summarized or analyzed."
}