{
  "main_persona": "Executive",
  "sub_persona": "Chief Operating Officer (COO)",
  "details": "#### Primary Objective:\nRetrieve all data related to operational performance, process efficiency, resource allocation, and risk management to ensure the company's strategic goals are executed effectively.\n\n#### Core Information to Retrieve:\n-   **Performance Metrics:** Key Performance Indicators (KPIs), dashboards, \"operational metrics,\" \"Service Level Agreements (SLAs),\" \"production targets,\" \"quality control reports,\" \"uptime/downtime.\"\n-   **Financial Reports (Operational Focus):** Departmental budgets, P&L statements, \"Cost of Goods Sold (COGS),\" \"operating expenses (OpEx),\" \"capital expenditures (CapEx),\" \"budget vs. actuals,\" \"variance analysis,\" \"EBITDA.\"\n-   **Process & Efficiency:** Phrases like \"process improvement,\" \"workflow optimization,\" \"bottleneck,\" \"Lean,\" \"Six Sigma,\" \"automation,\" \"efficiency gains,\" \"cycle time.\"\n-   **Supply Chain & Logistics:** \"Inventory levels,\" \"supply chain risk,\" \"procurement analysis,\" \"supplier performance,\" \"logistics costs,\" \"vendor contracts.\"\n-   **Human Resources & Staffing:** \"Headcount reports,\" organizational charts, \"staffing plans,\" \"productivity metrics,\" \"employee turnover,\" \"succession planning\" for key operational roles.\n-   **Project & Program Management:** Project status reports, \"milestone tracking,\" Gantt charts, \"resource allocation,\" project budgets, program roadmaps.\n-   **Risk & Compliance:** \"Risk assessment,\" \"business continuity plan,\" \"disaster recovery,\" \"regulatory compliance,\" audit reports, incident reports.\n-   **Strategic Documents:** Strategic plans, annual operating plans (AOP), board meeting minutes (especially sections on operations), M&A due diligence reports.\n\n#### Information to Ignore (Noise):\n-   Granular marketing and social media analytics (e.g., click-through rates, likes, ad copy).\n-   Individual sales call notes or low-level lead generation data.\n-   Detailed software source code or highly technical IT bug reports.\n-   Routine administrative communications (e.g., office catering orders, general HR announcements for birthdays).\n-   Competitor press releases or general market news not directly impacting operations.\n-   Early-stage, theoretical R&D proposals not yet in the planning phase.\n-   Individual employee expense receipts or travel bookings."
}