{
  "main_persona": "Executive",
  "sub_persona": "Chief Marketing Officer (CMO)",
  "details": "#### Primary Objective:\nRetrieve all strategic data on marketing campaign performance, market analysis, competitive positioning, and budget allocation to inform high-level decision-making and drive business growth.\n\n#### Core Information to Retrieve:\n-   **Performance Metrics & KPIs:** Phrases like \"Marketing ROI,\" \"Customer Acquisition Cost (CAC),\" \"Customer Lifetime Value (LTV),\" \"conversion rates,\" \"lead generation,\" \"MQLs,\" and \"SQLs.\"\n-   **Financial Data:** Terms like \"marketing budget,\" \"budget allocation,\" \"marketing spend,\" \"quarterly forecast,\" and \"cost per acquisition (CPA).\"\n-   **Strategic Plans:** Documents titled or containing \"Marketing Strategy,\" \"Go-to-Market Plan,\" \"Annual Marketing Plan,\" \"Product Launch Strategy,\" and \"Quarterly Business Review (QBR).\"\n-   **Market & Competitive Analysis:** Keywords such as \"competitor analysis,\" \"market share,\" \"industry trends,\" \"SWOT analysis,\" \"market research,\" and the names of key competitors.\n-   **Audience & Segmentation:** Information on \"target audience,\" \"customer personas,\" \"market segmentation,\" and \"customer journey mapping.\"\n-   **Campaign Summaries:** High-level reports on major campaigns, including overall performance, key takeaways, and strategic impact, rather than daily metrics.\n-   **Brand Health:** Metrics and reports related to \"brand awareness,\" \"brand perception,\" \"share of voice,\" and \"Net Promoter Score (NPS).\"\n-   **Team & Agency Performance:** Marketing department organizational charts, summaries of agency performance, and Statements of Work (SOWs) with major vendors.\n-   **Technology Stack:** Summaries of the marketing technology (MarTech) stack, including major platform names like Salesforce, HubSpot, Marketo, Google Analytics, etc., especially regarding cost and ROI.\n\n#### Information to Ignore (Noise):\n-   Granular, day-to-day operational details (e.g., individual social media post drafts, specific email copy, daily standup notes).\n-   Raw, un-summarized data sets (e.g., raw website clickstream data, individual survey responses).\n-   Non-marketing departmental reports (e.g., detailed engineering sprints, HR benefits administration, facilities management).\n-   Individual employee expense reports or routine IT support tickets.\n-   Low-level project management artifacts like individual task assignments or comments in project tools.\n-   Boilerplate legal or HR policy documents not directly related to a marketing contract or SOW.\n-   Routine internal communications about non-strategic topics (e.g., office social events, general IT updates)."
}