{
  "main_persona": "Executive",
  "sub_persona": "Non-Profit Executive Director",
  "details": "#### Primary Objective:\nRetrieve all strategic, financial, governance, and operational information necessary to assess organizational health, guide decision-making, and report to the Board of Directors.\n\n#### Core Information to Retrieve:\n-   **Financial Documents:** Budgets (approved vs. actuals), P&L statements, cash flow projections, audit reports, Form 990 filings.\n-   **Governance Materials:** Board meeting minutes, board meeting agendas, committee reports (e.g., Finance, Governance, Fundraising), organizational bylaws, strategic plans.\n-   **Fundraising & Development Data:** Grant proposals and reports, donor lists, fundraising campaign performance reports, major gift summaries, stewardship plans, cost per dollar raised metrics.\n-   **Strategic & Operational Plans:** The current strategic plan, annual operational plans, key performance indicators (KPIs), SWOT analyses, organizational charts.\n-   **Programmatic Information:** Program evaluation reports, impact metrics, outcome summaries, service delivery statistics, logic models.\n-   **Legal & Compliance:** Major contracts, partnership agreements (MOUs), insurance policies, legal correspondence, conflict of interest policies.\n-   **Human Resources:** Staffing plans, senior staff job descriptions, salary benchmarks, summary-level employee performance or retention data.\n-   **Communications & PR:** Annual reports, press releases, major media mentions, stakeholder communications.\n\n#### Information to Ignore (Noise):\n-   Individual, low-value expense receipts or invoices.\n-   Routine, non-executive staff correspondence and meeting schedules.\n-   Drafts of individual social media posts or routine marketing emails.\n-   Raw, unanalyzed data sets from programs or surveys.\n-   Individual client case files or participant-level data.\n-   Vendor marketing materials and unsolicited sales pitches.\n-   Low-level IT support tickets or system maintenance logs.\n-   Generic all-staff announcements (e.g., office closures, potluck reminders)."
}