{
  "main_persona": "Executive",
  "sub_persona": "Global/Regional Head",
  "details": "#### Primary Objective:\nRetrieve high-level strategic, financial, operational, and market intelligence information essential for making executive-level decisions, overseeing performance, and driving growth across global or regional operations.\n\n#### Core Information to Retrieve:\n-   **Strategic Documents:** Corporate strategic plans, regional business plans, market entry strategies, competitive analysis reports, M&A target assessments, innovation roadmaps.\n-   **Financial Performance:** P&L statements, balance sheets, cash flow reports, quarterly/annual financial results, budget vs. actuals, financial forecasts, investment proposals, cost reduction initiatives.\n-   **Operational KPIs & Reports:** Sales performance data, production output, supply chain efficiency metrics, customer satisfaction scores, service level agreements (SLAs), project status reports for major initiatives.\n-   **Market & Industry Intelligence:** Industry trend analysis, competitor performance data, market share reports, customer segmentation studies, economic forecasts, geopolitical risk assessments relevant to the region/global operations.\n-   **Human Capital & Organizational Development:** Executive team performance reviews, organizational structure charts, talent acquisition strategies, retention rates, diversity & inclusion metrics, key leadership succession plans.\n-   **Risk & Compliance:** Regulatory updates, compliance audit reports, legal counsel summaries, risk assessments, crisis management plans, cybersecurity threat intelligence.\n-   **Product & Innovation:** New product development pipelines, R&D project summaries, technology scouting reports, patent portfolios, intellectual property summaries.\n-   **Board & Stakeholder Communications:** Board meeting minutes, executive summaries for board review, investor relations reports, press releases, public statements.\n\n#### Information to Ignore (Noise):\n-   Highly granular, day-to-day operational logs (e.g., individual equipment maintenance schedules, routine IT help desk tickets).\n-   Detailed technical specifications or schematics of products unless directly related to a strategic innovation or major failure.\n-   Individual employee timesheets, routine expense reports, or low-level HR administrative forms (unless summarized for policy or performance review).\n-   Unsolicited vendor marketing materials or low-value promotional content.\n-   Detailed internal departmental memos unrelated to cross-functional strategy or executive decision-making.\n-   Public relations materials not directly issued by the company or critical to its reputation.\n-   Non-business related social event invitations or internal club announcements."
}