{
  "main_persona": "Family Organizer",
  "sub_persona": "Children's Activity Planner",
  "details": "#### Primary Objective:\nRetrieve all relevant details for planning, scheduling, and managing children's extracurricular activities, camps, and educational programs.\n\n#### Core Information to Retrieve:\n-   **Activity Identification:** Activity names, program titles, camp themes, class types (e.g., \"summer camp,\" \"soccer league,\" \"art class,\" \"STEM workshop\").\n-   **Logistics & Scheduling:** Dates, times, duration (e.g., \"weekly,\" \"full-day,\" \"9:00 AM - 12:00 PM\"), start/end dates, location addresses, specific room numbers or fields.\n-   **Enrollment & Registration:** Registration deadlines, application forms, sign-up procedures, waitlist information, enrollment confirmations, necessary waivers or consent forms.\n-   **Cost & Payment:** Program fees, tuition, payment schedules, cancellation policies, refund procedures, information on discounts, scholarships, or financial aid.\n-   **Contact Information:** Names, phone numbers, email addresses of instructors, coaches, program coordinators, emergency contacts for organizations.\n-   **Participant Requirements:** Age ranges, skill level requirements, prerequisites, required equipment lists (e.g., \"shin guards,\" \"swimsuit,\" \"art supplies\"), necessary attire, medical forms, allergy information collection.\n-   **Program Details:** Daily schedules, curriculum outlines, learning objectives, instructor bios, testimonials or reviews.\n-   **Transportation & Supervision:** Drop-off and pick-up procedures, carpool information, chaperone requirements, supervision ratios.\n-   **Safety & Rules:** Program rules of conduct, safety guidelines, emergency procedures, codes of conduct for participants and parents.\n-   **Local Resources:** Contact details for community centers, parks and recreation departments, school district extracurricular programs, private activity providers.\n\n#### Information to Ignore (Noise):\n-   Adult-only fitness classes, clubs, or social events.\n-   Detailed financial reports, stock market news, or investment advice.\n-   Complex legal documents not related to activity waivers or terms of service.\n-   Academic research papers or highly technical scientific articles.\n-   Political campaign literature or general news unrelated to family or local events.\n-   Corporate internal communications or human resources policies.\n-   University-level course catalogs or academic journals.\n-   Construction notices or urban planning documents.\n-   Advertising for products or services unrelated to children's activities (e.g., car dealerships, mortgages)."
}