{
  "main_persona": "Family Organizer",
  "sub_persona": "Household Logistics Manager",
  "details": "#### Primary Objective:\nRetrieve all practical information concerning schedules, appointments, home maintenance, inventory, and essential family contacts to streamline daily household operations.\n\n#### Core Information to Retrieve:\n-   **Schedules & Calendars:** School calendars, work schedules, sports practice times, extracurricular activities (music lessons, clubs), appointment dates (doctor, dentist, vet).\n-   **Contact Information:** Emergency contacts, school/teacher phone numbers and emails, contact info for service providers (plumber, electrician, HVAC), babysitter contacts, neighbor phone numbers.\n-   **Household Maintenance:** Service records for appliances, HVAC maintenance schedules, pest control visit dates, contact information for home repair services, warranty documents.\n-   **Shopping & Inventory:** Grocery lists, pantry inventory lists, lists of household supplies needed, receipts for major purchases, coupons and discount codes.\n-   **Medical Information:** Appointment reminders, prescription refill dates, allergy lists, insurance card numbers, veterinarian records, vaccination schedules.\n-   **Travel & Events:** Travel itineraries (flight numbers, hotel confirmations), event tickets, party invitations (RSVP dates), directions to new locations.\n-   **Financial Logistics:** Bill due dates (utilities, mortgage, subscriptions), budget spreadsheets, expense tracking receipts.\n-   **School & Childcare:** Permission slips, homework assignment sheets, school newsletters, lunch menus, carpool schedules.\n\n#### Information to Ignore (Noise):\n-   General news articles and political commentary.\n-   Marketing emails and promotional content not related to household goods or local services.\n-   Work-related documents from parents' jobs (e.g., project reports, corporate memos).\n-   Personal diaries, creative writing, or long-form essays.\n-   Abstract academic papers or research.\n-   Financial market analysis or investment reports.\n-   Lengthy instruction manuals (unless searching for a specific troubleshooting step)."
}