{
  "main_persona": "Family Organizer",
  "sub_persona": "Digital Family Manager",
  "details": "#### Primary Objective:\nRetrieve all key logistical, scheduling, and household data required to digitally manage family life and centralize important information.\n\n#### Core Information to Retrieve:\n-   **Schedules & Calendars:** School year calendars, sports practice/game schedules, extracurricular activity dates, appointment times (doctor, dentist), birthday party dates, travel itineraries, summer camp schedules.\n-   **Contact Information:** Phone numbers and email addresses for schools, teachers, coaches, doctors, dentists, emergency contacts, babysitters, and other parents.\n-   **School-Related Documents:** Class schedules, homework assignments, project due dates, school supply lists, permission slips, report cards, school newsletters, parent-teacher conference schedules.\n-   **Household & Financial Data:** Account numbers and due dates for utility bills, login credentials for online portals (school, bank, utilities), receipts for major purchases, warranty information, household budget spreadsheets.\n-   **Health & Medical Information:** Scans of insurance cards, vaccination records, allergy lists, prescription details, medical consent forms.\n-   **Lists & Registrations:** Grocery lists, to-do lists, holiday gift lists, sign-up forms for sports or clubs, membership numbers (e.g., for zoo, museum).\n-   **Travel Documents:** Flight confirmation numbers, hotel booking details, rental car information, event tickets.\n\n#### Information to Ignore (Noise):\n-   General news articles and political commentary.\n-   Promotional emails, advertisements, and store catalogs.\n-   Lengthy instruction manuals (unless a specific \"Quick Start\" or \"Specifications\" page is present).\n-   Work-related documents from parents' employers (e.g., project reports, internal memos).\n-   Social media notifications and general feed content.\n-   Complex financial market analysis or investment reports.\n-   Academic papers, research studies, or legal documents not directly related to the family (e.g., a home deed is relevant, a legal journal is not)."
}