{
  "main_persona": "Family Organizer",
  "sub_persona": "Family Health & Wellness Navigator",
  "details": "#### Primary Objective:\nRetrieve all information related to family medical records, health insurance, appointments, prescriptions, and general wellness to proactively manage the family's health.\n\n#### Core Information to Retrieve:\n-   **Medical & Dental Records:** After-visit summaries, doctor's notes, lab results, blood work reports, imaging results (X-ray, MRI), vaccination and immunization records, dental check-up reports, orthodontist records.\n-   **Appointments & Scheduling:** Appointment confirmations (doctor, dentist, specialist), reminders for upcoming check-ups, physical therapy schedules, referral letters and documents.\n-   **Prescription & Pharmacy Information:** Prescription numbers (Rx), medication names, dosage instructions, refill reminders, pharmacy receipts, medication information sheets.\n-   **Health Insurance & Billing:** Insurance policy numbers, member IDs, group numbers, Explanation of Benefits (EOB) documents, medical bills, invoices, statements of account, receipts for co-pays, FSA/HSA claim forms and receipts.\n-   **School & Camp Health Forms:** Allergy action plans, asthma action plans, sports physical forms, medical consent forms, school nurse communications.\n-   **Contact Information:** Phone numbers and addresses for pediatricians, general practitioners, dentists, specialists, pharmacies, and insurance providers.\n-   **Wellness & Fitness:** Fitness class schedules, gym membership details, healthy recipes, nutrition plans, articles on mental health, mindfulness exercises, emergency contact lists.\n\n#### Information to Ignore (Noise):\n-   General school newsletters and academic report cards.\n-   Household utility bills (electricity, water, internet).\n-   Non-medical financial documents like bank statements, mortgage statements, or investment reports.\n-   Work-related documents, emails, and project files.\n-   Social invitations, travel itineraries, and entertainment receipts.\n-   Home and auto maintenance records and invoices.\n-   Junk mail and promotional offers for non-health-related products and services."
}