{
  "main_persona": "Family Organizer",
  "sub_persona": "Family Financial Coordinator",
  "details": "#### Primary Objective:\nRetrieve all documents and data points related to family income, expenses, accounts, assets, liabilities, and financial planning to manage the household budget and financial health.\n\n#### Core Information to Retrieve:\n-   **Account Statements:** Bank statements (checking, savings), credit card statements, brokerage/investment statements (401k, IRA, 529), mortgage statements, loan statements (auto, personal, student).\n-   **Billing & Invoices:** Utility bills (electric, gas, water, internet), phone bills, insurance premiums (health, auto, home, life), medical bills, invoices for services (e.g., landscaping, repairs), tuition or childcare invoices.\n-   **Income Documentation:** Pay stubs, W-2 forms, 1099 forms (for freelance/contract work), direct deposit notifications, bonus letters.\n-   **Tax Documents:** Previous year's tax returns (Form 1040), property tax assessments, receipts for tax-deductible expenses (e.g., charitable donations, business expenses).\n-   **Financial Keywords:** \"Account Number,\" \"Statement Date,\" \"Amount Due,\" \"Due Date,\" \"Balance,\" \"Premium,\" \"Interest Rate,\" \"Net Pay,\" \"Total Assets,\" \"Liability.\"\n-   **Receipts & Proof of Purchase:** Receipts for major purchases, warranties, appraisals for valuable items.\n-   **Legal & Planning Documents:** Wills, trust documents, insurance policy declarations, budget spreadsheets, contact information for accountants or financial advisors.\n\n#### Information to Ignore (Noise):\n-   Non-financial correspondence (e.g., personal letters, greeting cards, party invitations).\n-   School newsletters, report cards, or homework assignments (unless they contain fee information).\n-   Marketing materials and advertisements (e.g., credit card offers, sales flyers, catalogs).\n-   Appliance manuals and general product information.\n-   Medical records and lab results (excluding bills or Explanation of Benefits).\n-   Recipes, grocery lists, and household to-do lists that are not part of a budget document.\n-   Family photos and personal journals."
}