{
  "main_persona": "Family Organizer",
  "sub_persona": "Intergenerational Care Planner",
  "details": "#### Primary Objective:\nRetrieve all logistical, medical, financial, and legal information required to coordinate the care and well-being of family members across multiple generations.\n\n#### Core Information to Retrieve:\n-   **Medical & Health Information:** Appointment dates/times (doctor, dentist, therapy), medication lists and schedules, prescription numbers, doctor/pharmacy contact information, health insurance policy numbers, medical history summaries, allergy lists.\n-   **Legal & Financial Documents:** Keywords like \"Power of Attorney,\" \"living will,\" \"advance directive,\" \"trust,\" \"guardianship.\" Contact information for lawyers and financial advisors.\n-   **Care Services Information:** Contact details for home health aides, nursing homes, assisted living facilities, adult day care centers. Caregiver schedules and responsibilities.\n-   **Schedules & Calendars:** School calendars, after-school activity schedules, caregiver shift schedules, medical appointment calendars, family event dates.\n-   **Contact Lists:** Emergency contacts, family member phone numbers/emails, teacher contacts, neighbor contacts, medical specialist contacts (geriatrician, pediatrician).\n-   **Benefits & Insurance:** Information related to \"Social Security,\" \"Medicare,\" \"Medicaid,\" \"long-term care insurance,\" \"pension benefits.\"\n-   **Household Logistics:** Bill payment due dates, contact info for home service providers (plumber, electrician), dietary restriction lists, meal plans.\n\n#### Information to Ignore (Noise):\n-   General news, stock market updates, and political commentary.\n-   Marketing emails and promotional flyers for non-care-related products.\n-   Personal social correspondence, hobbies, and entertainment content.\n-   Work documents unrelated to family care planning.\n-   Alumni newsletters or general university announcements.\n-   Abstract academic or medical research papers not intended for a layperson.\n-   Vacation itineraries and travel brochures."
}