{
  "main_persona": "Financial Analyst",
  "sub_persona": "Credit Analyst",
  "details": "#### Primary Objective:\nRetrieve all financial data, risk indicators, and qualitative information necessary to evaluate the creditworthiness and default risk of a specific entity.\n\n#### Core Information to Retrieve:\n-   **Financial Statements:** Balance Sheets, Income Statements, Cash Flow Statements (specifically looking for items like total debt, cash, revenue, EBITDA, and free cash flow).\n-   **Financial Ratios:**\n    -   Leverage Ratios: \"Debt-to-EBITDA,\" \"Debt-to-Equity,\" \"Total Debt to Total Capital.\"\n    -   Liquidity Ratios: \"Current Ratio,\" \"Quick Ratio.\"\n    -   Coverage Ratios: \"Interest Coverage Ratio (ICR),\" \"Debt Service Coverage Ratio (DSCR),\" \"Fixed Charge Coverage Ratio (FCCR).\"\n    -   Profitability Ratios: \"Operating Margin,\" \"Net Profit Margin,\" \"Return on Assets (ROA).\"\n-   **Debt Structure & Covenants:** Terms like \"credit agreement,\" \"loan indenture,\" \"senior secured,\" \"subordinated debt,\" \"maturity profile,\" \"debt schedule,\" \"revolving credit facility.\"\n-   **Financial Covenants:** Specific phrases like \"leverage covenant,\" \"coverage covenant,\" \"minimum liquidity,\" \"maximum capex.\"\n-   **Credit Ratings:** Explicit ratings from agencies like \"Moody's,\" \"S&P,\" \"Fitch,\" and any discussion of \"rating outlook\" (e.g., stable, positive, negative).\n-   **Risk Factors:** Sections labeled \"Risk Factors,\" \"Forward-Looking Statements,\" and discussions of market risk, operational risk, and liquidity risk.\n-   **Management Discussion & Analysis (MD&A):** Management commentary on performance, liquidity, and capital resources.\n-   **Industry & Market Analysis:** Data on market share, competitive landscape, industry trends, and macroeconomic indicators impacting the business.\n\n#### Information to Ignore (Noise):\n-   Marketing materials, product brochures, and advertising content.\n-   Human resources documents like employee handbooks, benefits summaries, or DEI reports.\n-   Routine press releases about non-financial events (e.g., community outreach, minor awards).\n-   Detailed information on equity performance, stock price volatility, or dividend policy (unless it directly impacts cash flow for debt service).\n-   Highly technical product specifications or engineering documents.\n-   Biographies of non-executive board members or low-level management.\n-   Information on office locations, facilities management, or administrative procedures."
}