{
  "main_persona": "Financial Analyst",
  "sub_persona": "Financial Analyst",
  "details": "#### Primary Objective:\nRetrieve all financial statements, market data, economic indicators, and corporate reports necessary for investment analysis and performance evaluation.\n\n#### Core Information to Retrieve:\n-   **Company Financial Statements:** Income statements, balance sheets, cash flow statements, statements of retained earnings, annual reports (10-K), quarterly reports (10-Q).\n-   **Valuation Metrics & Ratios:** Price-to-earnings (P/E) ratio, earnings per share (EPS), EBITDA, revenue growth rates, gross/operating/net profit margins, return on equity (ROE), return on assets (ROA), debt-to-equity ratio, current ratio, quick ratio, free cash flow (FCF).\n-   **Market Data:** Stock prices, trading volumes, market capitalization, industry indices, commodity prices, interest rates, bond yields, currency exchange rates.\n-   **Economic Indicators:** Gross Domestic Product (GDP) reports, inflation rates (CPI, PPI), unemployment rates, consumer confidence indices, industrial production data, central bank policy statements.\n-   **Corporate Actions & News:** Merger and acquisition (M&A) announcements, divestitures, share repurchase programs, dividend declarations, earnings call transcripts, press releases related to financial performance.\n-   **Investment Research:** Analyst reports, stock recommendations, sector analyses, competitive landscape reports.\n-   **Regulatory Filings:** SEC filings (S-1, 8-K), prospectuses, proxy statements.\n-   **Industry Specific Data:** Market share data, industry growth forecasts, competitor financial performance, regulatory changes impacting specific sectors.\n-   **Risk Factors:** Disclosures on market risk, credit risk, operational risk, geopolitical risk, and regulatory risk.\n\n#### Information to Ignore (Noise):\n-   Detailed operational manuals or engineering specifications.\n-   Human resources policies, employee handbooks, or internal training materials.\n-   Marketing brochures without embedded financial data.\n-   Extensive legal contracts unrelated to financial transactions or compliance.\n-   Non-financial news articles or general interest content (e.g., sports, entertainment, personal blogs).\n-   Specific product design documents or architectural plans.\n-   Internal meeting minutes not related to financial strategy or performance."
}