{
  "main_persona": "Financial Analyst",
  "sub_persona": "Investment Banking Analyst",
  "details": "#### Primary Objective:\nRetrieve all financial data, company performance metrics, and market information relevant to corporate valuation, deal structuring, and capital markets transactions.\n\n#### Core Information to Retrieve:\n-   **Financial Statements & Data:** Income Statements, Balance Sheets, Cash Flow Statements, specifically searching for line items like \"Revenue,\" \"EBITDA,\" \"Net Income,\" \"Total Debt,\" \"Cash and Cash Equivalents,\" \"Capital Expenditures (CapEx).\"\n-   **Valuation Metrics:** Phrases like \"Enterprise Value,\" \"Market Capitalization,\" \"EV/EBITDA,\" \"P/E Ratio,\" \"Discounted Cash Flow (DCF),\" \"Weighted Average Cost of Capital (WACC),\" \"Terminal Value.\"\n-   **M&A and Transaction Terms:** Keywords such as \"merger,\" \"acquisition,\" \"divestiture,\" \"leveraged buyout (LBO),\" \"takeover,\" \"strategic alternative,\" \"synergies,\" \"accretion/dilution analysis,\" \"precedent transactions,\" \"transaction comps.\"\n-   **Capital Markets Activity:** Phrases like \"Initial Public Offering (IPO),\" \"S-1 Filing,\" \"prospectus,\" \"debt issuance,\" \"equity offering,\" \"capital structure,\" \"underwriting.\"\n-   **Company Projections & Guidance:** Forward-looking statements, financial forecasts, revenue guidance, earnings per share (EPS) targets.\n-   **Risk & Competitive Landscape:** Identification of \"Risk Factors,\" \"Competition,\" \"market share,\" \"Total Addressable Market (TAM).\"\n-   **Key Sections of Filings:** \"Management's Discussion and Analysis (MD&A),\" footnotes to financial statements, lists of material contracts.\n-   **Ownership and Control:** Information on major shareholders, board of directors composition, and executive compensation.\n\n#### Information to Ignore (Noise):\n-   Routine press releases about minor product launches, personnel changes below the executive level, or community engagement.\n-   General marketing materials, brand slogans, and customer testimonials.\n-   Detailed technical specifications of products unless they are central to a major patent or valuation argument.\n-   Corporate Social Responsibility (CSR) reports that do not disclose material financial risk or expenditure.\n-   Internal HR policies, employee handbooks, and non-executive employee biographies.\n-   Low-level operational data (e.g., daily plant output, specific IT system configurations)."
}