{
  "main_persona": "Financial Analyst",
  "sub_persona": "Risk Management Analyst",
  "details": "#### Primary Objective:\nRetrieve all data, metrics, and qualitative statements related to financial, operational, market, and regulatory risks to assess potential threats and vulnerabilities to an organization.\n\n#### Core Information to Retrieve:\n-   **Risk-Specific Keywords:** \"Risk,\" \"threat,\" \"vulnerability,\" \"exposure,\" \"uncertainty,\" \"volatility,\" \"downturn,\" \"headwind,\" \"contingency,\" \"mitigation.\"\n-   **Financial Risk Metrics:**\n    -   Credit Risk: \"Credit rating,\" \"downgrade,\" \"credit default swaps (CDS),\" \"loan loss provision,\" \"delinquency rate,\" \"counterparty risk.\"\n    -   Liquidity Risk: \"Current ratio,\" \"quick ratio,\" \"cash flow statements,\" \"working capital,\" \"debt covenants.\"\n    -   Market Risk: \"Value at Risk (VaR),\" \"beta,\" \"standard deviation,\" \"interest rate sensitivity,\" \"currency fluctuation,\" \"commodity price risk.\"\n    -   Leverage: \"Debt-to-equity ratio,\" \"debt-to-asset ratio,\" \"interest coverage ratio.\"\n-   **Qualitative Risk Disclosures:**\n    -   Explicit sections like \"Risk Factors,\" \"Management's Discussion and Analysis (MD&A),\" \"Forward-Looking Statements.\"\n    -   Phrases like \"material weakness,\" \"going concern,\" \"significant deficiency\" from audit reports.\n-   **Operational Risk Indicators:** \"Supply chain disruption,\" \"cybersecurity,\" \"data breach,\" \"business continuity,\" \"key person risk,\" \"system failure,\" \"fraud.\"\n-   **Legal and Regulatory Compliance:** \"Litigation,\" \"lawsuit,\" \"regulatory inquiry,\" \"investigation,\" \"fine,\" \"sanction,\" \"settlement,\" mentions of regulatory bodies (e.g., SEC, FINRA, Fed), \"compliance failure,\" \"Sarbanes-Oxley (SOX).\"\n-   **Economic & Geopolitical Factors:** \"Recession,\" \"inflation,\" \"interest rates,\" \"trade tariffs,\" \"political instability,\" \"geopolitical risk.\"\n\n#### Information to Ignore (Noise):\n-   Marketing and public relations material (e.g., product launch announcements, brand positioning).\n-   Corporate Social Responsibility (CSR) reports and philanthropic activities.\n-   Biographies of non-executive employees or board members.\n-   Routine administrative information (e.g., office location changes, holiday schedules).\n-   General positive forward-looking statements without specific financial projections (e.g., \"we are excited for the future\").\n-   Standard descriptions of company products or services unless tied to a specific liability or risk."
}