{
  "main_persona": "Freelancer",
  "sub_persona": "Administrative & Virtual Assistant Freelancer",
  "details": "#### Primary Objective:\nRetrieve all actionable tasks, client communications, scheduling details, and business management documents necessary to operate an administrative freelance business and serve clients effectively.\n\n#### Core Information to Retrieve:\n-   **Task & Project Management:** Keywords like \"task,\" \"action item,\" \"to-do,\" \"deadline,\" \"project brief,\" \"scope of work,\" \"meeting agenda,\" \"meeting minutes.\"\n-   **Scheduling & Calendars:** Meeting requests, appointment confirmations, travel itineraries (flight numbers, hotel bookings), availability requests, phrases like \"schedule a call,\" \"find a time.\"\n-   **Client Communication:** Specific client names, company names, email threads containing instructions or feedback, contact lists, phone numbers.\n-   **Financial Documents:** Invoices (e.g., \"Invoice #\"), receipts, expense reports, purchase orders, quotes, proposals, payment reminders, phrases like \"amount due,\" \"payment terms.\"\n-   **Document Creation & Formatting:** Drafts of documents, presentation slides, spreadsheets, reports, requests for proofreading or editing.\n-   **Data Entry Information:** Tables of data, lists to be digitized, contact information for entry into a CRM, customer order details.\n-   **Login & System Credentials:** Usernames, passwords, login URLs, software licenses, instructions for using specific platforms (e.g., Asana, Trello, Slack).\n-   **Contracts & Agreements:** Service agreements, Non-Disclosure Agreements (NDAs), Statements of Work (SOWs), contract templates.\n\n#### Information to Ignore (Noise):\n-   The client's highly technical or industry-specific internal documents (e.g., engineering schematics, scientific research, legal case files) unless directly related to an assigned task.\n-   General marketing newsletters, promotional emails, and spam.\n-   Client's internal company-wide announcements not relevant to the freelancer's role (e.g., office party invitations, internal HR policy changes).\n-   Large datasets or raw data logs that are not part of a specific data entry task.\n-   Detailed financial reports of the client's business (e.g., balance sheets, profit & loss statements) unless tasked with transcribing them.\n-   Personal, non-work-related correspondence and social media notifications."
}