{
  "main_persona": "Freelancer",
  "sub_persona": "Data & Analytics Freelancer",
  "details": "#### Primary Objective:\nRetrieve information on potential client projects, data analytics methodologies, technical tools, and business administration documents to secure and manage freelance work.\n\n#### Core Information to Retrieve:\n-   **Client & Project Opportunities:** Phrases like \"Request for Proposal (RFP),\" \"Statement of Work (SOW),\" \"project brief,\" \"freelance opportunity,\" \"data consultant needed,\" \"scope of work,\" \"deliverables.\"\n-   **Technical Keywords:** \"Python,\" \"R,\" \"SQL,\" \"Tableau,\" \"Power BI,\" \"Spark,\" \"AWS,\" \"Azure,\" \"Google Cloud Platform.\"\n-   **Data Science Concepts:** \"Machine learning,\" \"statistical analysis,\" \"A/B testing,\" \"predictive modeling,\" \"data visualization,\" \"ETL,\" \"data pipeline,\" \"dashboard,\" \"KPI,\" \"customer segmentation.\"\n-   **Business & Financial Terms:** \"Contract,\" \"invoice,\" \"hourly rate,\" \"project fee,\" \"payment terms,\" \"Non-Disclosure Agreement (NDA),\" \"Master Service Agreement (MSA).\"\n-   **Project Management:** \"Timeline,\" \"milestones,\" \"project plan,\" \"requirements,\" \"meeting minutes,\" \"progress report.\"\n-   **Data Formats & Sources:** References to APIs, database schemas, `.csv`, `.json`, data dictionaries.\n-   **Client Stakeholders:** Titles like \"Project Manager,\" \"Head of Data,\" \"Director of Analytics,\" \"Chief Technology Officer (CTO).\"\n\n#### Information to Ignore (Noise):\n-   General company newsletters and marketing announcements.\n-   HR documents for full-time employees (e.g., benefits packages, 401k information, paid time off policies).\n-   Internal IT support tickets or non-data infrastructure details.\n-   Creative assets like marketing copy, logos, or brand style guides.\n-   Source code for front-end web development (HTML, CSS, JavaScript).\n-   General office administration documents (e.g., catering orders, office supply lists)."
}