{
  "main_persona": "Freelancer",
  "sub_persona": "Marketing & Digital Strategy Freelancer",
  "details": "#### Primary Objective:\nRetrieve all information related to marketing strategies, client proposals, project management, campaign performance, and business development to support freelance operations.\n\n#### Core Information to Retrieve:\n-   **Client & Project Documents:** \"Marketing Proposal,\" \"Statement of Work (SOW),\" \"Scope of Work,\" \"Freelance Agreement,\" \"Service Level Agreement (SLA),\" \"Project Quote.\"\n-   **Strategy & Planning Concepts:** \"Marketing Plan,\" \"Content Strategy,\" \"SEO Strategy,\" \"Target Audience,\" \"Customer Persona,\" \"Competitive Analysis,\" \"SWOT Analysis,\" \"Customer Journey Map.\"\n-   **Performance Metrics & KPIs:** \"Return on Investment (ROI),\" \"Key Performance Indicators (KPIs),\" \"Conversion Rate,\" \"Click-Through Rate (CTR),\" \"Cost Per Acquisition (CPA),\" \"Customer Lifetime Value (CLV),\" \"Engagement Rate.\"\n-   **Project Management & Communication:** \"Project Timeline,\" \"Content Calendar,\" \"Client Brief,\" \"Meeting Agenda,\" \"Status Report,\" \"Invoice,\" \"Payment Terms.\"\n-   **Marketing Tactics & Keywords:** \"Search Engine Optimization (SEO),\" \"Pay-Per-Click (PPC),\" \"Content Marketing,\" \"Email Marketing,\" \"Social Media Marketing,\" \"Keyword Research,\" \"Backlink Profile,\" \"A/B Testing.\"\n-   **Analytics & Reporting:** \"Google Analytics,\" \"Performance Report,\" \"Campaign Results,\" \"Monthly Analytics,\" \"Dashboard,\" \"Traffic Sources.\"\n-   **Contact Information:** Client names, email addresses, company names, key stakeholder titles.\n\n#### Information to Ignore (Noise):\n-   Client's internal HR documents (e.g., employee handbooks, payroll).\n-   Client's detailed financial statements or corporate tax filings.\n-   Technical IT documentation unrelated to website performance (e.g., internal network diagrams, server source code).\n-   Legal documents not pertaining to the freelance contract (e.g., property leases, corporate bylaws).\n-   Personal documents, resumes, or non-work-related correspondence.\n-   General news articles or industry reports not specific to a client's project or market."
}