{
  "main_persona": "Freelancer",
  "sub_persona": "Creative Professional Freelancer",
  "details": "#### Primary Objective:\nRetrieve all actionable information related to client projects, business administration, financial tracking, and potential new opportunities.\n\n#### Core Information to Retrieve:\n-   **Client & Project Documents:** Phrases like \"Creative Brief,\" \"Scope of Work (SOW),\" \"Project Proposal,\" \"Client Feedback,\" \"Revisions,\" \"Brand Guidelines,\" \"Style Guide,\" \"Project Timeline,\" \"Deliverables.\"\n-   **Financial Documents:** Keywords such as \"Invoice,\" \"Purchase Order (PO),\" \"Quote,\" \"Estimate,\" \"Receipt,\" \"Expense Report,\" \"Bank Transfer Confirmation.\"\n-   **Contracts & Legal:** \"Contract,\" \"Agreement,\" \"Non-Disclosure Agreement (NDA),\" \"Statement of Work,\" \"Terms and Conditions,\" \"Service Agreement,\" \"Intellectual Property,\" \"Usage Rights.\"\n-   **Tax & Business Forms:** Form names like \"W-9,\" \"1099-NEC,\" \"1099-MISC,\" \"Business License,\" \"Certificate of Insurance.\"\n-   **Payment Terms:** Phrases such as \"Net 30,\" \"Net 60,\" \"Due upon receipt,\" \"50% upfront,\" \"Deposit,\" \"Final Payment.\"\n-   **New Opportunities:** Keywords like \"Request for Proposal (RFP),\" \"Call for Submissions,\" \"Job Posting,\" \"Creative Inquiry,\" \"Looking for a freelancer.\"\n-   **Contact Information:** Client names, emails, phone numbers, and company addresses.\n-   **Asset Licenses:** \"License Agreement,\" \"Software Subscription,\" \"Stock Photo License,\" \"Font License.\"\n\n#### Information to Ignore (Noise):\n-   Inspirational articles, mood boards, or general industry news not tied to a specific project.\n-   Client's internal-only documents (e.g., their own HR policies, all-staff memos, company-wide financial reports).\n-   Early, superseded drafts of proposals or creative work (e.g., \"proposal_v1.pdf\").\n-   Promotional marketing emails and newsletters from vendors or services.\n-   Personal, non-business financial statements or receipts.\n-   General user manuals for hardware or software not directly related to a billable project expense."
}