{
  "main_persona": "Freelancer",
  "sub_persona": "Project Management Freelancer",
  "details": "#### Primary Objective:\nRetrieve all actionable information related to project planning, execution, client management, and the business operations of a freelance practice.\n\n#### Core Information to Retrieve:\n-   **Project Scoping & Planning:** Phrases like \"Statement of Work (SOW),\" \"Scope of Work,\" \"Project Proposal,\" \"Project Plan,\" \"Gantt Chart,\" \"Timeline,\" \"Milestones,\" \"Deliverables,\" \"Project Charter.\"\n-   **Methodologies & Frameworks:** Keywords such as \"Agile,\" \"Scrum,\" \"Kanban,\" \"Waterfall,\" \"Sprint Planning,\" \"Daily Stand-up,\" \"Retrospective.\"\n-   **Financial & Contractual Documents:** \"Contract,\" \"Master Service Agreement (MSA),\" \"Independent Contractor Agreement,\" \"Non-Disclosure Agreement (NDA),\" \"Quote,\" \"Estimate,\" \"Invoice,\" \"Payment Terms,\" \"Billing Rate.\"\n-   **Project Execution & Monitoring:** Terms like \"Status Report,\" \"Progress Update,\" \"Risk Assessment,\" \"Risk Register,\" \"Change Request,\" \"Action Items,\" \"Meeting Minutes,\" \"Budget vs. Actual,\" \"Key Performance Indicators (KPIs).\"\n-   **Client & Stakeholder Management:** Phrases such as \"Client Onboarding,\" \"Stakeholder Communication Plan,\" \"Approval,\" \"Sign-off,\" \"Client Feedback,\" \"Requirements Gathering.\"\n-   **Resource & Task Management:** \"Resource Allocation,\" \"Task Assignment,\" \"To-do List,\" \"Backlog,\" \"User Story,\" names of specific project management tools (e.g., Jira, Asana, Trello).\n-   **Freelance Business Administration:** Forms like \"W-9,\" \"1099,\" terms like \"Quarterly Taxes,\" \"Expense Tracking,\" \"Profit and Loss.\"\n-   **Project Closure:** \"Project Post-mortem,\" \"Lessons Learned,\" \"Final Report,\" \"Project Handoff.\"\n\n#### Information to Ignore (Noise):\n-   Internal corporate HR documents (e.g., employee performance reviews, company-wide benefits information).\n-   Marketing newsletters and promotional sales emails.\n-   Highly technical documentation not related to project deliverables (e.g., raw server logs, detailed code commits).\n-   Company-wide announcements not directly impacting the project (e.g., internal promotions, office parties).\n-   Vendor invoices or contracts that are not part of the freelancer's managed project budget.\n-   General industry news or articles not specifically related to a current project's context.\n-   Personal correspondence unrelated to business or project work."
}