{
  "main_persona": "Freelancer",
  "sub_persona": "Writing & Editing Freelancer",
  "details": "#### Primary Objective:\nRetrieve information pertaining to freelance writing and editing job opportunities, client project requirements, industry best practices, and business management resources.\n\n#### Core Information to Retrieve:\n-   **Job Postings & Opportunities:** Keywords like \"freelance writer,\" \"editor wanted,\" \"copywriter,\" \"content creator,\" \"proofreader,\" \"technical writer,\" \"medical editor,\" \"ghostwriter,\" \"gig,\" \"contract,\" \"remote writing jobs,\" \"per-word rate,\" \"project rate.\"\n-   **Client Requirements & Briefs:** \"Content brief,\" \"style guide,\" \"brand guidelines,\" \"target audience,\" \"deliverables,\" \"revisions,\" \"feedback loop,\" \"deadline,\" \"SEO keywords.\"\n-   **Contract & Payment Terms:** \"Service agreement,\" \"statement of work (SOW),\" \"non-disclosure agreement (NDA),\" \"invoice,\" \"payment schedule,\" \"hourly rate,\" \"retainer,\" \"kill fee,\" \"late payment clause.\"\n-   **Writing & Editing Best Practices:** \"Grammar rules,\" \"punctuation guidelines,\" \"AP style,\" \"Chicago Manual of Style,\" \"MLA format,\" \"SEO writing tips,\" \"readability scores,\" \"plagiarism checker,\" \"fact-checking resources.\"\n-   **Portfolio & Marketing:** \"Portfolio examples,\" \"pitching guide,\" \"cover letter templates,\" \"marketing strategies for freelancers,\" \"client testimonials,\" \"case studies,\" \"networking events.\"\n-   **Software & Tools:** \"Word processor features,\" \"editing software,\" \"grammar checker,\" \"project management tools for freelancers,\" \"CMS platforms (WordPress, HubSpot).\"\n-   **Industry Trends:** \"Content marketing trends,\" \"digital publishing,\" \"AI in writing,\" \"audience engagement strategies,\" \"niche markets for writers.\"\n\n#### Information to Ignore (Noise):\n-   Highly technical schematics or engineering specifications (unless directly related to a specific client project in a technical niche).\n-   Detailed corporate financial reports or stock market analysis.\n-   Personal finance advice unrelated to self-employment business practices.\n-   Deep academic research papers outside of specific content requirements.\n-   Manufacturing processes or industrial operations data.\n-   Non-literary event listings (e.g., sports schedules, concerts).\n-   Construction plans or urban development reports."
}