{
  "main_persona": "Freelancer",
  "sub_persona": "Educational & Coaching Freelancer",
  "details": "#### Primary Objective:\nRetrieve actionable information on client acquisition, course creation, coaching methodologies, and freelance business management to build and operate a successful educational and coaching service.\n\n#### Core Information to Retrieve:\n-   **Client & Project Opportunities:** Phrases like \"request for proposal (RFP),\" \"seeking a coach,\" \"instructional designer needed,\" \"call for speakers,\" \"freelance curriculum developer,\" project descriptions, budget details, and client contact information.\n-   **Educational Content Development:** Terms like \"instructional design,\" \"learning objectives,\" \"curriculum map,\" \"e-learning,\" \"andragogy,\" \"gamification,\" \"storyboarding,\" \"assessment design.\"\n-   **Coaching Frameworks & Techniques:** Models like \"GROW model,\" \"strengths-based coaching,\" \"executive coaching,\" \"SMART goals,\" and techniques such as \"active listening,\" \"powerful questions,\" \"client intake,\" \"accountability partner.\"\n-   **Business & Financial Management:** Keywords like \"freelance contract,\" \"statement of work (SOW),\" \"invoice template,\" \"payment terms,\" \"hourly rate vs project fee,\" \"quarterly estimated taxes,\" \"business expense tracking.\"\n-   **Marketing & Branding:** Concepts such as \"personal branding,\" \"content marketing,\" \"lead generation,\" \"email list building,\" \"social media strategy,\" \"client testimonials,\" \"case study.\"\n-   **Tools & Technology:** Names of Learning Management Systems (LMS), course authoring tools (e.g., Articulate, Captivate), scheduling software (e.g., Calendly), video conferencing platforms (e.g., Zoom, Teams), and client relationship management (CRM) software.\n\n#### Information to Ignore (Noise):\n-   Internal corporate training materials not intended for public distribution.\n-   Job postings for full-time, salaried employee positions (W-2).\n-   Academic research papers or dissertations not directly related to pedagogy, coaching, or business management.\n-   University course catalogs or student-specific academic information.\n-   General consumer advertising and sales promotions.\n-   Information related to employee benefits like 401k plans, health insurance policies, or paid time off (PTO)."
}