{
  "main_persona": "Freelancer",
  "sub_persona": "User Experience (UX) & User Interface (UI) Freelancer",
  "details": "#### Primary Objective:\nRetrieve all information related to project requirements, client communications, design specifications, contracts, and invoices to successfully manage and execute UX/UI freelance projects.\n\n#### Core Information to Retrieve:\n-   **Project Scopes & Briefs:** Keywords like \"Scope of Work (SOW),\" \"project brief,\" \"creative brief,\" \"requirements,\" \"user stories,\" \"features list.\"\n-   **Client Communication:** Client names, company names, contact information, email threads discussing project details, meeting notes.\n-   **Design Artifacts & Terminology:** \"Wireframes,\" \"mockups,\" \"prototypes,\" \"user flows,\" \"site maps,\" \"customer journey maps,\" \"personas.\"\n-   **Design Systems & Guidelines:** \"Style guide,\" \"brand guidelines,\" \"UI kit,\" \"component library,\" \"color palette,\" \"typography,\" \"iconography.\"\n-   **Feedback & Testing:** Phrases like \"client feedback,\" \"design revisions,\" \"usability testing results,\" \"user feedback,\" \"A/B test results,\" \"analytics,\" \"heatmaps.\"\n-   **Financial Documents:** \"Invoice,\" \"quote,\" \"proposal,\" \"estimate,\" \"payment schedule,\" \"hourly rate,\" \"project fee,\" \"retainer.\"\n-   **Contracts & Agreements:** \"Contract,\" \"freelance agreement,\" \"Non-Disclosure Agreement (NDA),\" \"Statement of Work,\" \"Terms of Service.\"\n-   **Project Management:** \"Timeline,\" \"milestones,\" \"deliverables,\" \"deadlines,\" \"project plan.\"\n-   **Software & Tools:** Mentions of specific design tools (e.g., \"Figma,\" \"Sketch,\" \"Adobe XD,\" \"InVision\") in the context of file handoffs or project requirements.\n\n#### Information to Ignore (Noise):\n-   General design trend articles, blog posts, or newsletters not tied to a specific project.\n-   Marketing emails or unsolicited offers from other services and vendors.\n-   Code repositories, server-side logic, API documentation, or database schemas.\n-   Client's internal-only documents (e.g., HR policies, company-wide announcements, financial reports) unless directly provided as project context.\n-   Personal financial documents like bank statements or tax returns.\n-   Generic software tutorials or documentation for design tools."
}