{
  "main_persona": "Freelancer",
  "sub_persona": "Freelancer",
  "details": "#### Primary Objective:\nRetrieve information related to project opportunities, client contracts, financial management, marketing, and professional development relevant to independent work.\n\n#### Core Information to Retrieve:\n-   **Job and Project Leads:** Keywords like \"freelance opportunity,\" \"contract work,\" \"project brief,\" \"RFP,\" \"gig,\" \"client looking for,\" \"hourly rate,\" \"fixed price project.\"\n-   **Client Information:** Company profiles, client reviews, contact details, communication preferences, payment history.\n-   **Contracts and Legal Documents:** \"Service agreement,\" \"NDA,\" \"terms and conditions,\" \"invoice terms,\" \"scope of work,\" \"deliverables,\" \"intellectual property rights,\" \"liability clauses.\"\n-   **Financial Management:** \"Invoice templates,\" \"payment schedules,\" \"expense tracking,\" \"tax deductions,\" \"freelance taxes,\" \"accounting software,\" \"payment gateways.\"\n-   **Project Management:** \"Project milestones,\" \"deadlines,\" \"workflow tools,\" \"communication platforms,\" \"feedback mechanisms,\" \"revisions.\"\n-   **Marketing and Branding:** \"Portfolio examples,\" \"testimonial requests,\" \"case studies,\" \"personal branding,\" \"networking events,\" \"social media strategy,\" \"lead generation.\"\n-   **Skill Development:** \"Online courses,\" \"tutorials,\" \"industry trends,\" \"software updates,\" \"certification programs,\" \"webinars.\"\n-   **Business Operations:** \"Business registration,\" \"freelance insurance,\" \"home office deductions,\" \"business tools and software recommendations.\"\n\n#### Information to Ignore (Noise):\n-   Internal corporate HR policies for employees (e.g., benefits packages, vacation accrual).\n-   Large-scale corporate financial reports not relevant to client solvency.\n-   Academic research papers unrelated to specific project requirements or skill development.\n-   Highly specialized scientific or engineering diagrams unless directly linked to a project.\n-   General news articles unrelated to market trends or specific client industries.\n-   Personal social media chatter or non-professional content.\n-   Long-form philosophical essays or non-practical theory."
}