{
  "main_persona": "Freight Forwarder",
  "sub_persona": "Air Freight Specialist",
  "details": "#### Primary Objective:\nRetrieve all logistical, regulatory, pricing, and documentation details required for the international and domestic air transportation of cargo.\n\n#### Core Information to Retrieve:\n-   **Shipment Documentation:** Air Waybill (AWB), Master Air Waybill (MAWB), House Air Waybill (HAWB), Shipper's Letter of Instruction (SLI), Commercial Invoice, Packing List, Certificate of Origin.\n-   **Regulations & Compliance:** Phrases like \"IATA regulations,\" \"TSA screening,\" \"known shipper,\" \"customs clearance,\" \"import/export restrictions,\" \"duties and taxes,\" \"tariffs.\" Specific terms like \"Incoterms\" (e.g., EXW, FOB, CIF, DDP).\n-   **Dangerous Goods (DG):** \"Dangerous Goods Declaration (DGD),\" \"UN number,\" \"packing group,\" \"hazmat labels,\" \"lithium battery regulations.\"\n-   **Logistics & Routing:** Airline names (e.g., \"Lufthansa Cargo,\" \"FedEx,\" \"Emirates SkyCargo\"), flight numbers, airport codes (IATA 3-letter codes like JFK, LHR, HKG), transit times, routings, handling agent details.\n-   **Cargo Specifications:** Dimensions (length, width, height), actual weight, volumetric weight (dimensional weight), chargeable weight, piece count, terms like \"stackable\" or \"non-stackable.\"\n-   **Unit Load Devices (ULDs):** ULD identifiers (e.g., \"AKE,\" \"PMC,\" \"PAG\"), ULD contours, net specifications, build-up instructions.\n-   **Pricing & Quotes:** Freight rates (e.g., \"rate per kg/lb\"), fuel surcharges (FSC), security surcharges (SSC), handling fees, customs brokerage fees, insurance costs.\n-   **Status & Tracking:** Phrases like \"Proof of Delivery (POD),\" \"shipment status,\" \"cargo arrived,\" \"customs hold,\" \"cleared customs.\"\n\n#### Information to Ignore (Noise):\n-   **Ocean & Ground Freight Data:** Bill of Lading (B/L), sea container numbers (TEU/FEU), vessel names, port names, trucking manifests, rail schedules.\n-   **Passenger Travel Information:** Passenger tickets, boarding passes, seat assignments, frequent flyer programs, baggage claim details for personal luggage.\n-   **General Airline Corporate Information:** Annual financial reports, stock performance, HR policies, marketing campaigns for passenger travel.\n-   **Aircraft Technical Data:** Detailed aircraft maintenance logs, engine specifications, non-cargo related schematics.\n-   **Warehouse/Facility Management:** Internal warehouse staffing schedules, forklift maintenance records, general facility utility bills."
}