{
  "main_persona": "Freight Forwarder",
  "sub_persona": "Supply Chain Integrator",
  "details": "#### Primary Objective:\nRetrieve all logistical, regulatory, and partner-related data to manage and optimize the end-to-end movement of goods across the entire supply chain.\n\n#### Core Information to Retrieve:\n-   **Shipment Specifics:** Bill of Lading (B/L) numbers, Air Waybill (AWB) numbers, container numbers, booking confirmations, tracking numbers.\n-   **Logistics & Transport Data:** Phrases like \"freight quote,\" \"sailing schedule,\" \"flight schedule,\" \"transit time,\" \"port of loading (POL),\" \"port of discharge (POD),\" \"estimated time of arrival (ETA),\" \"estimated time of departure (ETD).\"\n-   **Carrier Information:** Carrier names (e.g., Maersk, FedEx, DHL), vessel names, flight numbers, trucking company details.\n-   **Customs & Regulatory Terms:** \"Customs clearance,\" \"Harmonized System (HS) code,\" \"import duty,\" \"export declaration,\" \"tariff,\" \"Certificate of Origin.\"\n-   **Incoterms:** References to specific Incoterms (e.g., \"EXW,\" \"FOB,\" \"CIF,\" \"DDP\").\n-   **Supply Chain Documents:** Commercial Invoices, Packing Lists, Purchase Orders (PO), Shipping Instructions (SLI).\n-   **Warehousing & Distribution:** Keywords like \"warehouse receipt,\" \"distribution center,\" \"3PL,\" \"inventory level,\" \"cross-docking,\" \"last-mile delivery.\"\n-   **Costs & Charges:** Rate sheets, invoices mentioning \"freight charges,\" \"demurrage,\" \"detention,\" \"bunker adjustment factor (BAF),\" \"port fees.\"\n-   **Contact Information:** Names, emails, and phone numbers for shippers, consignees, customs brokers, and transport partners.\n-   **Disruption Alerts:** Mentions of \"port congestion,\" \"carrier delay,\" \"weather advisory,\" \"labor strike,\" \"embargo,\" \"supply chain disruption.\"\n\n#### Information to Ignore (Noise):\n-   Detailed product marketing descriptions or user manuals for the goods being shipped.\n-   General corporate financial reports (e.g., Annual Reports, quarterly earnings calls) not related to logistics costs.\n-   Human Resources documents like employee handbooks, payroll, or internal job postings.\n-   Internal manufacturing process details that do not affect shipping timelines or requirements.\n-   High-level marketing and sales strategy documents.\n-   IT support tickets or internal system update notes."
}