{
  "main_persona": "Freight Forwarder",
  "sub_persona": "Road Freight Specialist",
  "details": "#### Primary Objective:\nRetrieve all logistical, regulatory, and operational data required to plan, execute, and track road freight shipments efficiently.\n\n#### Core Information to Retrieve:\n-   **Shipment Details:** Pickup and delivery addresses, shipper/consignee names, pallet counts, piece counts, weight (gross/net), dimensions, and volume (CBM).\n-   **Documentation & Reference Numbers:** Bill of Lading (BOL), Proof of Delivery (POD), PRO numbers, booking confirmations, reference numbers, packing lists, commercial invoices.\n-   **Carrier Information:** Carrier names, SCAC codes, DOT/MC numbers, driver contact information, dispatch contacts.\n-   **Pricing & Costs:** Freight quotes, rate confirmations, linehaul charges, fuel surcharge (FSC), accessorial fees (e.g., \"detention,\" \"lumper,\" \"liftgate,\" \"inside delivery\").\n-   **Equipment & Service Types:** FTL (Full Truckload), LTL (Less-than-Truckload), dry van, reefer (refrigerated), flatbed, step-deck, box truck.\n-   **Operational Instructions:** Pickup/delivery appointment times, warehouse hours, special handling instructions (e.g., \"protect from freeze,\" \"top load only\").\n-   **Regulatory & Customs:** Terms like \"Hazmat,\" \"Dangerous Goods (DG),\" \"UN Number,\" \"customs broker,\" \"border crossing,\" \"PARS/PAPS.\"\n-   **Status & Tracking:** Phrases like \"in transit,\" \"dispatched,\" \"delivered,\" \"delayed,\" \"estimated time of arrival (ETA).\"\n\n#### Information to Ignore (Noise):\n-   **Non-Road Freight Terminology:** \"Air Waybill (AWB),\" \"Ocean Bill of Lading,\" \"TEU,\" \"vessel,\" \"container number,\" \"port of loading/discharge.\"\n-   **Internal Corporate Documents:** HR policies, employee payroll information, marketing brochures, non-operational company newsletters.\n-   **High-Level Financial Reports:** Annual reports, shareholder communications, stock performance data.\n-   **Detailed Product Information:** Marketing descriptions, user manuals, or technical specifications of the goods being shipped (beyond what is needed for transport classification).\n-   **Facility Management:** Building maintenance records, office supply orders, real estate contracts."
}