{
  "main_persona": "Freight Forwarder",
  "sub_persona": "Ocean Freight Specialist",
  "details": "#### Primary Objective:\nRetrieve all logistical, regulatory, commercial, and documentation details required to plan, execute, and track international ocean freight shipments.\n\n#### Core Information to Retrieve:\n-   **Shipment Details:** Bill of Lading (B/L) numbers, container numbers (e.g., \"MSKU1234567\"), booking numbers, vessel names, voyage numbers.\n-   **Logistical Terms:** \"FCL\" (Full Container Load), \"LCL\" (Less than Container Load), \"Reefer\" (Refrigerated), \"DG\" (Dangerous Goods), \"CY/CY\" (Container Yard), \"Port of Loading\" (POL), \"Port of Discharge\" (POD).\n-   **Scheduling Information:** Sailing schedules, transit times, \"ETD\" (Estimated Time of Departure), \"ETA\" (Estimated Time of Arrival).\n-   **Key Documents:** \"Bill of Lading,\" \"Sea Waybill,\" \"Commercial Invoice,\" \"Packing List,\" \"Certificate of Origin,\" \"Importer Security Filing\" (ISF), \"Verified Gross Mass\" (VGM).\n-   **Financials & Charges:** Rate quotations, freight invoices, \"Ocean Freight,\" \"Bunker Adjustment Factor\" (BAF), \"Terminal Handling Charges\" (THC), \"Demurrage,\" \"Detention,\" \"Customs Duty.\"\n-   **Parties Involved:** Shipper, Consignee, Notify Party, Customs Broker, Carrier/Shipping Line names (e.g., Maersk, MSC, CMA CGM).\n-   **Regulatory & Compliance:** \"HS Code\" / \"HTS Code,\" \"Incoterms\" (e.g., FOB, CIF, EXW), \"SOLAS,\" \"IMO Class\" for hazardous goods.\n-   **Port & Location Data:** Port names, UN/LOCODEs (e.g., \"CNSHA,\" \"USLAX,\" \"NLRTM\"), terminal names, warehouse addresses.\n\n#### Information to Ignore (Noise):\n-   Information exclusively related to Air Freight (e.g., Air Waybill numbers, flight details, IATA codes).\n-   Unrelated domestic ground transport details (unless explicitly for drayage to/from the port).\n-   Corporate marketing materials, press releases, and company newsletters.\n-   Internal HR documents, employee directories, or company-wide memos.\n-   Detailed product manufacturing specifications or internal R&D data.\n-   General corporate financial reports, shareholder meeting minutes, or stock performance."
}