{
  "main_persona": "Freight Forwarder",
  "sub_persona": "Customs Brokerage Specialist",
  "details": "#### Primary Objective:\nRetrieve all specific documentation, regulations, codes, and procedures required for clearing international shipments through customs accurately and efficiently.\n\n#### Core Information to Retrieve:\n-   **Classification Codes:** Harmonized Tariff Schedule (HTS) codes, HS Codes, Schedule B numbers.\n-   **Shipping Documents:** Commercial Invoice, Packing List, Bill of Lading (B/L), Air Waybill (AWB), Certificate of Origin (COO), Shipper's Letter of Instruction (SLI).\n-   **Valuation & Financials:** Declared customs value, product costs, duties, taxes, tariffs, fees, Incoterms (e.g., FOB, CIF, DDP).\n-   **Regulatory Terms:** Phrases like \"customs clearance,\" \"duty drawback,\" \"anti-dumping,\" \"countervailing duties,\" \"import restrictions,\" \"trade agreement\" (e.g., USMCA, CUSMA).\n-   **Government Agency Data:** Requirements from Customs and Border Protection (CBP), Food and Drug Administration (FDA), Department of Agriculture (USDA), Environmental Protection Agency (EPA), Consumer Product Safety Commission (CPSC).\n-   **Shipment Identifiers:** Container numbers, seal numbers, Importer Security Filing (ISF) data, entry numbers, bond information.\n-   **Party Information:** Full names and addresses for Shipper, Consignee, Importer of Record, and Notify Party.\n-   **Port & Route Details:** Port of Loading, Port of Discharge, Vessel/Flight details, entry/exit points.\n\n#### Information to Ignore (Noise):\n-   Marketing materials for freight or logistics services.\n-   Internal human resources documents (e.g., employee handbooks, payroll information).\n-   General news articles about shipping companies or global economics (unless specifically about new trade sanctions or regulations).\n-   Vessel or vehicle maintenance logs.\n-   Consumer-facing product descriptions or advertisements for the goods being shipped.\n-   Corporate financial reports (e.g., quarterly earnings) of logistics partners.\n-   General travel advisories not related to commercial cargo movement."
}