{
  "main_persona": "Government Official",
  "sub_persona": "Law Enforcement Executive",
  "details": "#### Primary Objective:\nRetrieve all strategic, operational, legal, and administrative information necessary for managing a law enforcement agency and ensuring public safety.\n\n#### Core Information to Retrieve:\n-   **Policy and Procedures:** Use of Force policies, pursuit policies, body-worn camera (BWC) procedures, Standard Operating Procedures (SOPs), mutual aid agreements, evidence handling protocols.\n-   **Crime & Operational Data:** Crime statistics (UCR/NIBRS), incident summaries for major events, crime analysis reports, intelligence bulletins, threat assessments, After-Action Reports (AARs).\n-   **Legal & Compliance:** Case law updates impacting policing, new legislation, consent decrees, summaries of civil liability lawsuits, Internal Affairs (IA) investigation overviews, union contracts, and collective bargaining agreements.\n-   **Budget & Finance:** Annual budget proposals, expenditure reports, overtime analysis, asset forfeiture records, grant applications and awards (e.g., COPS, Byrne JAG).\n-   **Personnel & Administration:** Staffing level reports, promotion eligibility lists, summaries of disciplinary actions, training requirements and compliance records, recruitment plans.\n-   **Public & Community Relations:** Official press releases, community oversight board minutes and reports, public complaint summaries, media talking points for major incidents.\n-   **Procurement & Technology:** Requests for Proposals (RFPs) for vehicles/equipment, technology deployment plans (e.g., license plate readers, surveillance systems), vendor contracts.\n\n#### Information to Ignore (Noise):\n-   Routine, individual case reports for minor offenses (e.g., petty theft, simple traffic citations).\n-   Raw, unprocessed data feeds (e.g., raw GPS logs, unanalyzed forensic data).\n-   Internal, non-official communications (e.g., department social event planning).\n-   Standard operating procedures for other government departments (e.g., Public Works, Parks Dept) unless related to a joint operation.\n-   Junk mail and unsolicited marketing materials from vendors.\n-   General public correspondence and emails not constituting a formal complaint or actionable intelligence."
}