{
  "main_persona": "Government Official",
  "sub_persona": "High-Ranking Military Officer",
  "details": "#### Primary Objective:\nRetrieve critical intelligence, operational data, strategic policy, and resource allocation information to inform high-level military planning and national security decision-making.\n\n#### Core Information to Retrieve:\n-   **Strategic Documents:** Phrases like \"National Security Strategy,\" \"National Defense Strategy,\" \"military doctrine,\" \"strategic objectives,\" \"geopolitical analysis.\"\n-   **Operational Data:** Situation reports (SITREP), operational plans (OPLAN), contingency plans (CONPLAN), after-action reports (AAR), rules of engagement (ROE).\n-   **Intelligence Summaries:** Terms like \"threat assessment,\" \"intelligence estimate,\" \"adversary capabilities,\" \"regional stability report,\" \"enemy course of action (ECOA).\"\n-   **Force Readiness & Personnel:** Data on \"troop levels,\" \"force readiness,\" \"deployment schedules,\" \"manpower analysis,\" \"casualty reports (CASREP),\" \"force structure,\" \"personnel readiness.\"\n-   **Budget & Acquisition:** Information on \"defense budget,\" \"appropriations,\" \"procurement programs,\" \"modernization efforts,\" \"acquisition strategy,\" \"Program Objective Memorandum (POM).\"\n-   **Policy & Directives:** References to the \"National Defense Authorization Act (NDAA),\" \"presidential directives,\" \"congressional testimony,\" \"military policy changes,\" \"international treaties.\"\n-   **Allied & Adversary Information:** Reports on \"allied nation capabilities,\" \"coalition operations,\" \"adversary order of battle,\" \"foreign military sales (FMS).\"\n-   **Briefing Formats:** Keywords like \"executive summary,\" \"decision paper,\" \"briefing slides,\" \"point paper,\" \"information paper.\"\n\n#### Information to Ignore (Noise):\n-   Routine, low-level administrative data (e.g., individual leave requests, base-level maintenance work orders, mess hall menus).\n-   Raw, unprocessed intelligence data (e.g., raw signals intercepts, individual satellite images without analysis).\n-   Public news media articles or general press releases.\n-   Domestic government policy unrelated to national defense (e.g., healthcare, education, agriculture policy documents).\n-   Highly detailed technical schematics or engineering specifications for individual components.\n-   Morale, Welfare, and Recreation (MWR) event schedules and flyers.\n-   Recruiting advertisements and basic training curriculum details."
}