{
  "main_persona": "Government Official",
  "sub_persona": "Local Government Mayor / Council Member",
  "details": "#### Primary Objective:\nRetrieve all documents and data pertaining to municipal operations, public policy, budget allocation, constituent services, and inter-departmental communications to support informed decision-making and governance.\n\n#### Core Information to Retrieve:\n-   **Financial Documents:** Budgets (proposed and approved), financial statements, audit reports, revenue forecasts, expenditure reports, tax collection data (property, sales tax), bond ratings, grant applications.\n-   **Policy & Governance:** Draft and final ordinances, resolutions, city charter provisions, meeting agendas, council meeting minutes, committee reports, public hearing notices.\n-   **Public Works & Infrastructure:** Capital improvement plans, zoning applications, land use proposals, building permit data, traffic studies, reports on water/sewer systems, road maintenance schedules, waste management contracts.\n-   **Public Safety Reports:** Police department crime statistics, fire department incident reports, emergency response times, emergency management plans, community policing initiatives.\n-   **Economic & Community Development:** Economic development proposals, business license data, housing reports (e.g., from a housing authority), information on parks and recreation programs, library usage statistics.\n-   **Constituent Communication:** Summaries of resident complaints, public feedback from surveys or town halls, petitions, letters from community groups or HOAs.\n-   **Contracts & Procurement:** Requests for Proposals (RFPs), vendor bids and contracts, legal agreements with other government entities, memorandums of understanding (MOUs).\n-   **Administrative & HR:** Reports from the City Manager, departmental performance metrics, union negotiation documents, staffing level reports, organizational charts.\n\n#### Information to Ignore (Noise):\n-   Federal or state-level legislation that does not have a direct and immediate impact on the municipality.\n-   Routine, low-level internal communications (e.g., individual IT support tickets, daily shift schedules).\n-   Raw, unprocessed data sets without accompanying summary or analysis (e.g., raw traffic sensor data).\n-   Individual employee performance reviews or personal information.\n-   National or international news articles unless they directly mention the local municipality.\n-   Promotional materials from vendors not currently in a procurement process.\n-   Junk mail, spam, or unsolicited marketing emails."
}