{
  "main_persona": "Government Official",
  "sub_persona": "Public Education Administrator",
  "details": "#### Primary Objective:\nRetrieve all information related to educational policy, funding allocation, student performance data, legal compliance, and operational standards for public school systems.\n\n#### Core Information to Retrieve:\n-   **Policy and Legislation:** Keywords like \"education code,\" \"state mandate,\" \"federal law,\" \"board policy,\" \"Title IX,\" \"IDEA\" (Individuals with Disabilities Education Act), \"FERPA\" (Family Educational Rights and Privacy Act), \"compliance.\"\n-   **Finance and Budgeting:** Phrases like \"budget allocation,\" \"per-pupil expenditure,\" \"funding formula,\" \"Title I funding,\" \"grant application,\" \"fiscal report,\" \"audit,\" \"appropriations.\"\n-   **Student Performance Data:** Terms like \"standardized test scores,\" \"assessment results,\" \"graduation rates,\" \"dropout rates,\" \"student achievement,\" \"accountability report,\" \"demographic subgroup performance.\"\n-   **Curriculum and Standards:** \"Curriculum standards,\" \"state standards,\" \"learning outcomes,\" \"instructional materials adoption,\" \"graduation requirements.\"\n-   **Personnel and Administration:** \"Teacher certification,\" \"teacher evaluation,\" \"collective bargaining agreement,\" \"union contract,\" \"staffing ratios,\" \"professional development requirements,\" \"superintendent reports.\"\n-   **Operations and Safety:** \"District calendar,\" \"enrollment projections,\" \"school safety plan,\" \"emergency procedures,\" \"transportation policy,\" \"facilities management.\"\n-   **Official Communications:** \"Board of Education meeting minutes,\" \"public hearing notices,\" \"official district communications,\" \"policy drafts.\"\n\n#### Information to Ignore (Noise):\n-   Individual student assignments, grades, or report cards.\n-   Daily classroom lesson plans and teacher-specific instructional materials.\n-   PTA/PTO meeting notes, school fundraising flyers, and bake sale announcements.\n-   Student club activities, sports team schedules, and non-academic event promotions.\n-   Student-run newspaper articles or school yearbooks.\n-   Marketing materials and unsolicited proposals from educational vendors.\n-   Individual school newsletters focused on student life rather than district policy."
}