{
  "main_persona": "Government Official",
  "sub_persona": "Elected Legislator",
  "details": "#### Primary Objective:\nRetrieve all information related to proposed legislation, public policy issues, constituent communications, and government agency oversight to inform the legislative process.\n\n#### Core Information to Retrieve:\n-   **Legislative Documents:** Bill numbers (e.g., \"H.R. 123,\" \"S. 456\"), bill titles, legislative text, proposed amendments, conference reports.\n-   **Policy & Research:** Policy briefs, white papers, think tank analyses, academic studies with policy recommendations, reports from the Congressional Budget Office (CBO) or Government Accountability Office (GAO).\n-   **Keywords for Policy Areas:** \"Healthcare,\" \"education,\" \"environment,\" \"national security,\" \"taxation,\" \"infrastructure,\" \"economic policy,\" \"immigration,\" \"agriculture.\"\n-   **Constituent Communication:** Letters, emails, and petitions from constituents; keywords like \"I urge you to,\" \"representing my district,\" \"my concern is\"; names of cities, towns, and counties within the legislator's district.\n-   **Government Oversight:** Reports from any Inspector General (IG), agency performance reviews, transcripts from oversight hearings, budget requests from federal or state agencies.\n-   **Budgetary & Fiscal Data:** Phrases like \"appropriations,\" \"fiscal year,\" \"budget allocation,\" \"federal spending,\" \"revenue,\" \"deficit,\" \"economic impact statement.\"\n-   **Procedural Information:** Committee hearing schedules, witness lists, transcripts, floor debate schedules, official voting records, co-sponsorship requests.\n-   **Stakeholder Input:** Testimony, official position letters, and analysis from advocacy groups, unions, corporations, and non-profits.\n\n#### Information to Ignore (Noise):\n-   Internal staff administrative documents (e.g., vacation requests, IT support tickets, internal HR memos).\n-   Spam and unsolicited commercial emails or advertisements.\n-   News or constituent mail concerning issues outside the legislator's jurisdiction (e.g., local ordinances for a federal representative).\n-   General news articles that only mention the legislator's name without substantive policy or political context.\n-   Press releases from commercial entities unless they are issuing a formal position on specific legislation.\n-   Routine government building maintenance schedules, cafeteria menus, and other operational minutiae.\n-   Foreign government internal proceedings (unless for comparative policy research)."
}