{
  "main_persona": "Government Official",
  "sub_persona": "City / County Administrator",
  "details": "#### Primary Objective:\nRetrieve all operational, financial, legal, and policy documents necessary to manage the day-to-day functions and strategic planning of the city/county government.\n\n#### Core Information to Retrieve:\n-   **Financial Documents:** Budget proposals, approved budgets (e.g., \"FY24 Budget\"), financial statements, audit reports, revenue and expenditure reports, tax revenue data, bond ratings, and grant applications/awards.\n-   **Legislative & Policy Documents:** City/county ordinances, resolutions, proposed regulations, zoning codes, municipal codes, and official proclamations.\n-   **Meeting Materials:** Agendas, meeting minutes, and presentation materials for City Council, County Board, Planning Commission, and other official bodies.\n-   **Contracts & Agreements:** Vendor contracts, service level agreements (SLAs), inter-local agreements, memorandums of understanding (MOUs), and procurement documents (RFPs, bids).\n-   **Departmental Reports:** Status reports from Public Works, Police, Fire, Parks & Recreation, Planning, and other city/county departments. Performance metrics and KPIs.\n-   **Personnel Information:** Union contracts (Collective Bargaining Agreements), HR policies, salary schedules, staffing level reports, and key personnel job descriptions.\n-   **Capital Projects:** Capital Improvement Plans (CIP), project status updates, engineering reports, and construction bids/contracts.\n-   **Legal & Risk Management:** Legal opinions from the city/county attorney, litigation updates, liability claims, and insurance policies.\n-   **Public Communication:** Official press releases, public hearing notices, community survey results, and formal citizen complaints or inquiries.\n\n#### Information to Ignore (Noise):\n-   Routine internal departmental emails or memos not related to policy or major operational issues.\n-   Low-level operational data logs (e.g., individual traffic sensor data, raw utility readings) that are not part of a summary report.\n-   Community event flyers for non-governmental events (e.g., bake sales, local concerts).\n-   Individual employee performance reviews or disciplinary actions.\n-   Unsolicited marketing materials or sales pitches from vendors.\n-   Archival material with no legal or policy precedent (e.g., old photographs, historical anecdotes).\n-   General news articles about other municipalities, unless specifically used for a comparative analysis report."
}