{
  "main_persona": "Graphic Designer",
  "sub_persona": "Art Director (Graphic Design Focus)",
  "details": "#### Primary Objective:\nRetrieve all information related to visual strategy, brand identity, project management, and creative team leadership to guide design projects from concept to completion.\n\n#### Core Information to Retrieve:\n-   **Brand & Strategy Documents:** Phrases like \"brand guidelines,\" \"style guide,\" \"brand identity,\" \"visual identity system,\" \"logo usage,\" \"color palette,\" \"typography standards,\" \"brand voice.\"\n-   **Project Briefs & Proposals:** \"Creative brief,\" \"project scope,\" \"statement of work (SOW),\" \"project goals,\" \"target audience,\" \"key messaging.\"\n-   **Conceptual Materials:** \"Mood board,\" \"inspiration,\" \"concept development,\" \"sketches,\" \"storyboards,\" \"wireframes.\"\n-   **Design Assets & Mockups:** \"Layout,\" \"composition,\" \"mockup,\" \"prototype,\" \"final design,\" \"key art,\" \"hero image.\"\n-   **Team & Vendor Management:** \"Creative team roster,\" \"designer assignments,\" \"freelancer contract,\" \"photographer,\" \"illustrator,\" \"copywriter,\" contact information for printers and other vendors.\n-   **Feedback & Revisions:** \"Client feedback,\" \"internal review,\" \"design critique,\" \"revision history,\" \"approval status,\" \"final sign-off.\"\n-   **Technical Specifications:** \"Print specs,\" \"die lines,\" \"bleed,\" \"color profile\" (CMYK, RGB), \"resolution\" (DPI), \"file formats\" (AI, PSD, INDD, PDF), \"web accessibility\" (WCAG).\n-   **Project Management Data:** \"Project timeline,\" \"deliverables list,\" \"milestones,\" \"project budget,\" \"resource allocation.\"\n\n#### Information to Ignore (Noise):\n-   Company-wide financial reports (e.g., quarterly earnings, balance sheets).\n-   Human Resources documents like payroll, general employee benefits, or non-creative job postings.\n-   Raw data from other departments (e.g., sales lead lists, engineering bug reports, server logs).\n-   IT support tickets and infrastructure documentation.\n-   Individual employee expense reports not related to a creative project budget.\n-   Legal documents unrelated to copyright, trademarks, or vendor/client contracts (e.g., real estate leases).\n-   Logistics and supply chain manifests."
}