{
  "main_persona": "Graphic Designer",
  "sub_persona": "Packaging Designer",
  "details": "#### Primary Objective:\nRetrieve all technical specifications, design guidelines, brand assets, and regulatory requirements necessary for designing and producing product packaging.\n\n#### Core Information to Retrieve:\n-   **Technical Specifications:** Dielines, cut lines, fold lines, keylines, dimensions (L x W x H), bleed, trim marks, safety margins.\n-   **Materials & Substrates:** Keywords like \"paperboard,\" \"corrugated,\" \"rigid box,\" \"glass,\" \"PET,\" \"cardstock,\" and specific weights or thicknesses (e.g., \"350gsm,\" \"18pt C1S\").\n-   **Printing & Finishing:** Color codes (Pantone/PMS, CMYK), printing process names (\"offset,\" \"flexography,\" \"digital\"), and finishing terms (\"foil stamp,\" \"emboss,\" \"deboss,\" \"spot UV,\" \"matte varnish,\" \"lamination\").\n-   **Regulatory & Compliance:** Barcodes (UPC, EAN), QR codes, nutritional facts panel, ingredients list, warning labels, recycling symbols, country of origin, net weight/volume.\n-   **Branding & Content:** Brand guidelines, style guides, official logos (in vector formats like AI, EPS, PDF), brand fonts/typography, marketing copy, product names, and taglines.\n-   **Structural Information:** Terms like \"tuck end box,\" \"clamshell,\" \"blister pack,\" \"sleeve,\" \"insert,\" \"window patching,\" \"glue tabs.\"\n-   **Project Briefs:** Documents containing creative direction, target audience, competitive analysis, mood boards, and project goals.\n\n#### Information to Ignore (Noise):\n-   Web design assets and code (HTML, CSS, hex codes, UI/UX wireframes).\n-   General corporate financial documents (annual reports, investor briefings, sales projections).\n-   Internal company memos, HR policies, and non-design-related meeting minutes.\n-   Digital advertising metrics, social media analytics, and SEO reports.\n-   Supply chain and logistics documents not directly related to package dimensions or materials.\n-   Architectural plans or engineering schematics for anything other than the package structure itself."
}