{
  "main_persona": "Graphic Designer",
  "sub_persona": "Agency Graphic Designer",
  "details": "#### Primary Objective:\nRetrieve all project briefs, client brand guidelines, creative assets, and feedback to effectively execute design tasks from conception to final delivery.\n\n#### Core Information to Retrieve:\n-   **Project Briefs & Scopes:** Keywords like \"creative brief,\" \"project scope,\" \"design requirements,\" \"deliverables,\" \"timeline,\" \"deadline,\" \"target audience,\" and \"key message.\"\n-   **Brand Guidelines:** Look for documents titled \"brand guidelines,\" \"style guide,\" \"brand book,\" \"visual identity guide.\"\n-   **Branding Elements:**\n    -   **Color Palettes:** Hex codes (#RRGGBB), RGB values, CMYK values, Pantone numbers (PMS).\n    -   **Typography:** Font names, font families, type hierarchy (H1, H2, body), kerning/leading rules.\n    -   **Logos:** Specific logo variations (primary, secondary, favicon) and usage rules.\n-   **Creative Assets & Content:**\n    -   **File Types:** .AI, .PSD, .EPS, .SVG, .INDD, .PDF, .JPG, .PNG, .TIFF.\n    -   **Content:** Phrases like \"final copy,\" \"copy deck,\" \"headshots,\" \"product photography,\" \"stock images,\" \"icon library.\"\n    -   Links to asset libraries (e.g., Dropbox, Google Drive, DAM).\n-   **Feedback & Revisions:** Phrases like \"client feedback,\" \"revisions,\" \"amends,\" \"markups,\" \"edits required,\" \"version 2\" (or v2, v3), \"round of changes.\"\n-   **Technical Specifications:**\n    -   **Print:** \"Print specs,\" \"bleed,\" \"trim,\" \"safe area,\" \"DPI,\" \"CMYK,\" \"die line.\"\n    -   **Digital:** \"Dimensions\" (e.g., 1920x1080px), \"resolution,\" \"file size,\" \"web safe,\" \"sRGB.\"\n-   **Inspiration & Concepts:** \"Mood board,\" \"storyboard,\" \"wireframe,\" \"mockup,\" \"prototype,\" \"competitor analysis.\"\n\n#### Information to Ignore (Noise):\n-   **Financial Documents:** Invoices, billing rates, project budgets, purchase orders, expense reports.\n-   **Sales & Client Acquisition:** New business proposals, sales pitches, lead generation lists, prospecting emails.\n-   **Human Resources & Admin:** Employee performance reviews, payroll information, company-wide HR policies, office management memos.\n-   **Agency-Level Business Reports:** Agency annual reports, profit/loss statements, shareholder communications, board meeting minutes.\n-   **Non-Design Technical Data:** Website backend code, server logs, IT infrastructure documents, software license agreements."
}