{
  "main_persona": "Graphic Designer",
  "sub_persona": "UI/UX Designer",
  "details": "#### Primary Objective:\nRetrieve all information pertaining to user interface design, user experience research, interaction patterns, design systems, and digital product development to create intuitive and effective digital experiences.\n\n#### Core Information to Retrieve:\n-   **UI/UX Principles:** Usability heuristics, accessibility guidelines (WCAG), information architecture, user-centered design methodologies.\n-   **User Research Data:** User personas, user journey maps, user flows, empathy maps, usability testing reports, A/B test results, survey data, interview transcripts.\n-   **Design Specifications:** Wireframes, mockups, prototypes (e.g., Figma, Sketch, Adobe XD files), design systems, style guides, component libraries.\n-   **Interaction Design:** Microinteractions, animations (duration, easing), transition effects, haptic feedback patterns.\n-   **Platform Guidelines:** Apple Human Interface Guidelines, Google Material Design specifications, web responsive design breakpoints, dark mode specifications.\n-   **Visual Design Elements:** Color palettes (HEX, RGB, HSL), typography (font families, weights, sizes), iconography, graphic assets (SVG, PNG).\n-   **Technical Constraints:** Screen resolutions, device specifications, front-end framework limitations (e.g., React components, HTML/CSS considerations).\n-   **Tools & Software:** Tutorials, best practices for design and prototyping tools (e.g., Figma, Sketch, Adobe XD, InVision).\n-   **Project Documentation:** Design briefs, functional requirements, user stories, development hand-off documentation.\n-   **Industry Trends:** Emerging UI/UX patterns, new design technologies (e.g., AI in design, XR interfaces).\n\n#### Information to Ignore (Noise):\n-   Print-specific design guidelines (e.g., CMYK color profiles, print DPI, bindery specifications).\n-   Deep back-end code, server configurations, database schemas.\n-   Detailed marketing campaign performance metrics (unless directly impacting UI/UX metrics).\n-   Physical product manufacturing specifications or industrial design schematics.\n-   Financial reports, legal documents unrelated to intellectual property or user data privacy.\n-   General administrative or HR policies.\n-   Content for print advertising, billboards, or physical packaging."
}