{
  "main_persona": "Graphic Designer",
  "sub_persona": "Freelance Graphic Designer",
  "details": "#### Primary Objective:\nRetrieve all information related to client projects, design assets, business administration, and professional development to support a freelance graphic design practice.\n\n#### Core Information to Retrieve:\n-   **Client & Project Documents:** \"Creative Brief,\" \"Scope of Work (SOW),\" \"Project Proposal,\" \"Contract,\" \"Agreement.\"\n-   **Project Management Terms:** \"Deliverables,\" \"Timeline,\" \"Milestones,\" \"Revisions,\" \"Feedback,\" \"Approval,\" \"Project Status.\"\n-   **Financial Information:** \"Invoice,\" \"Quote,\" \"Estimate,\" \"Payment Terms,\" \"Hourly Rate,\" \"Project Fee,\" \"Deposit,\" \"Receipt.\"\n-   **Client Contact Information:** Client names, company names, email addresses, phone numbers.\n-   **Design Specifications:** \"Brand Guidelines,\" \"Style Guide,\" \"Color Palette,\" \"Hex Codes,\" \"RGB,\" \"CMYK,\" \"Typography,\" \"Font.\"\n-   **Asset & File Types:** \"Logo,\" \"Vector,\" \"Raster,\" \"Icon,\" \"Stock Photo,\" \"Mood Board,\" \".ai,\" \".psd,\" \".eps,\" \".svg,\" \".fig.\"\n-   **Legal & Usage Terms:** \"Copyright,\" \"Usage Rights,\" \"Work for Hire,\" \"Non-Disclosure Agreement (NDA),\" \"Terms and Conditions.\"\n-   **Software & Tools:** Names of design software like \"Adobe Creative Suite,\" \"Illustrator,\" \"Photoshop,\" \"InDesign,\" \"Figma,\" \"Sketch.\"\n-   **Design Concepts:** \"Layout,\" \"Composition,\" \"Hierarchy,\" \"White Space,\" \"User Interface (UI),\" \"User Experience (UX).\"\n\n#### Information to Ignore (Noise):\n-   Generic corporate documents from clients not related to the design project (e.g., their internal HR policies, quarterly financial reports).\n-   Software End-User License Agreements (EULAs) and lengthy privacy policies.\n-   Personal, non-business related documents (e.g., personal bank statements, medical records, utility bills).\n-   Promotional marketing emails and unsolicited newsletters from non-design sources.\n-   Highly technical documentation unrelated to design (e.g., server configurations, API documentation).\n-   Receipts and invoices for personal, non-business-related purchases."
}