{
  "main_persona": "Graphic Designer",
  "sub_persona": "Motion Graphic Designer",
  "details": "#### Primary Objective:\nRetrieve all technical specifications, creative assets, project requirements, and inspirational materials needed to design, animate, and deliver motion graphics.\n\n#### Core Information to Retrieve:\n-   **Project Briefs & Scopes:** Keywords like \"creative brief,\" \"scope of work,\" \"project goals,\" \"target audience,\" \"key messages,\" \"call to action (CTA).\"\n-   **Technical Specifications:** \"Resolution\" (e.g., 1920x1080, 4K), \"frame rate\" (e.g., 24fps, 30fps), \"aspect ratio,\" \"file format\" (.mp4, .mov, .gif), \"codec,\" \"bitrate,\" \"render settings.\"\n-   **Asset & Brand Guidelines:** \"Style guide,\" \"brand book,\" \"color palette,\" \"hex codes,\" \"RGB values,\" \"typography,\" \"font names,\" \"logo usage,\" \"vector files\" (.ai, .svg, .eps).\n-   **Story & Sequence:** \"Storyboard,\" \"script,\" \"shot list,\" \"animatic,\" \"narrative,\" \"voice-over (VO) script.\"\n-   **Software & Technique References:** Software names like \"After Effects,\" \"Cinema 4D,\" \"Blender,\" \"Mocha,\" \"Premiere Pro.\" Technical terms like \"keyframes,\" \"easing,\" \"motion path,\" \"compositing,\" \"rotoscoping,\" \"particle system,\" \"rigging,\" \"timing.\"\n-   **Feedback & Revisions:** Phrases like \"client feedback,\" \"revision notes,\" \"amendments,\" \"version control\" (e.g., v1, v2, final), \"timecodes\" for specific feedback.\n-   **Audio Requirements:** \"Sound effects (SFX),\" \"music track,\" \"audio mixing,\" \"background music,\" \"audio file formats\" (.mp3, .wav).\n\n#### Information to Ignore (Noise):\n-   Overall company financial reports, sales figures, and marketing budget breakdowns.\n-   Human Resources (HR) documents, employee policies, and payroll information.\n-   Print-specific design specs like \"CMYK,\" \"bleed,\" \"crop marks,\" \"print resolution (DPI).\"\n-   Static web development assets or code (HTML, CSS, JavaScript).\n-   Lengthy legal contracts, NDAs, or master service agreements (unless searching for specific deliverable clauses).\n-   Raw market research data, user analytics, and SEO reports."
}