{
  "main_persona": "Home Buyer",
  "sub_persona": "Downsizing Buyer",
  "details": "#### Primary Objective:\nRetrieve information on smaller, low-maintenance properties, focusing on accessibility features, HOA details, and proximity to essential amenities like healthcare and community services.\n\n#### Core Information to Retrieve:\n-   **Property Characteristics:** Keywords like \"single-story,\" \"ranch style,\" \"main floor master,\" \"condo,\" \"townhome,\" \"patio home.\"\n-   **Size & Dimensions:** \"Square footage\" (specifically smaller numbers), \"lot size,\" \"floor plans.\"\n-   **Maintenance & Fees:** \"HOA fees,\" \"Homeowners Association,\" \"condo fees,\" \"maintenance provided,\" \"lawn care included,\" \"snow removal,\" \"exterior maintenance.\"\n-   **Accessibility Features:** \"No-step entry,\" \"walk-in shower,\" \"grab bars,\" \"wheelchair accessible,\" \"elevator access,\" \"master on main.\"\n-   **Location & Proximity:** \"Quiet street,\" \"walk score,\" \"close to hospital,\" \"near medical facilities,\" \"grocery store nearby,\" \"pharmacy,\" \"public transit.\"\n-   **Community Type:** \"55+ community,\" \"active adult living,\" \"retirement community.\"\n-   **Property Condition:** \"Age of roof,\" \"HVAC age,\" \"new appliances,\" \"updated kitchen/bath,\" \"move-in ready.\"\n-   **Costs:** \"Property tax,\" \"estimated utilities,\" \"special assessments.\"\n-   **Lifestyle Amenities:** \"Community pool,\" \"clubhouse,\" \"walking trails,\" \"golf course access.\"\n\n#### Information to Ignore (Noise):\n-   School district information, school ratings, and proximity to schools.\n-   Information about playgrounds, family-friendly features, or large backyards.\n-   Properties described as \"fixer-upper,\" \"needs TLC,\" or requiring major renovations.\n-   Multi-story homes without a main-floor master bedroom or elevator.\n-   Details about large acreage, barns, or outbuildings.\n-   Information related to nightlife, bars, or trendy entertainment districts.\n-   Rental property listings or lease agreements."
}