{
  "main_persona": "Home Inspector",
  "sub_persona": "Specialized Systems Inspector (HVAC/Plumbing/Electrical)",
  "details": "#### Primary Objective:\nRetrieve detailed technical specifications, installation guidelines, maintenance procedures, common failure modes, safety regulations, and building code compliance information for residential HVAC, plumbing, and electrical systems.\n\n#### Core Information to Retrieve:\n-   **HVAC Systems:** Furnace types (gas, electric, oil), AC units (central, mini-split), heat pumps, boilers, ductwork design, ventilation systems (HRV/ERV), thermostat specifications, refrigerant types, AFUE/SEER/HSPF ratings, carbon monoxide detectors, condensate lines, exhaust flues, air filter types, typical lifespans, common issues (e.g., \"no heat,\" \"compressor failure,\" \"airflow problems\").\n-   **Plumbing Systems:** Water heaters (tank, tankless), pipe materials (copper, PEX, PVC, galvanized), drain-waste-vent (DWV) systems, supply lines, main water shut-off, fixture specifications (faucets, toilets, showers), sump pumps, sewage ejector pumps, septic system components, water pressure regulators, backflow preventers, common issues (e.g., \"leaks,\" \"low water pressure,\" \"clogged drains,\" \"water heater leaks\").\n-   **Electrical Systems:** Service entrance conductors, main service panel, sub-panels, circuit breakers, fuse boxes, wiring types (Romex, armored cable, knob & tube, aluminum), outlet and switch types (GFCI, AFCI), grounding systems, bonding, fixture wiring, smoke detectors, carbon monoxide detectors, surge protectors, voltage and amperage ratings, common issues (e.g., \"tripped breaker,\" \"ungrounded outlets,\" \"faulty wiring,\" \"overloaded circuits\").\n-   **Codes & Standards:** National Electrical Code (NEC), International Plumbing Code (IPC), International Mechanical Code (IMC), local building codes, safety standards (e.g., UL listings, CSA certifications), manufacturer installation instructions, service manuals, recall notices, permit requirements.\n-   **Maintenance & Repair:** Recommended maintenance schedules, diagnostic procedures, error codes, common repair parts, material specifications, energy efficiency ratings.\n-   **Inspection Data:** Checklists for system inspection, common defect classifications, typical lifespan charts, repair cost estimates (for systems), diagnostic tools and methods.\n\n#### Information to Ignore (Noise):\n-   Architectural design aesthetics, interior decorating, color schemes, or specific furniture layouts.\n-   Structural engineering reports focused on foundation, framing, or roofing integrity (unless directly impacting system mounts or penetrations).\n-   Landscaping plans, garden designs, or outdoor amenity details (e.g., swimming pools, detached sheds, fences) unless directly containing relevant utilities.\n-   General real estate market analysis, property valuation reports, or appraisal documents.\n-   Information on general household cleaning products, recipes, or personal finance.\n-   Community rules (e.g., HOA bylaws) not related to system installation or maintenance.\n-   Information on non-permanent fixtures, decorative items, or personal belongings.\n-   Abstract academic research papers on unrelated scientific fields."
}