{
  "main_persona": "Home Buyer",
  "sub_persona": "Vacation Home Buyer",
  "details": "#### Primary Objective:\nRetrieve all information on property features, local attractions, rental income potential, and ownership regulations to support the purchase of a vacation home.\n\n#### Core Information to Retrieve:\n-   **Property Listings & Features:** Listing price, address, photos, square footage, number of beds/baths, lot size, property taxes.\n-   **Vacation-Specific Keywords:** \"Waterfront,\" \"beach access,\" \"ski-in/ski-out,\" \"lakefront,\" \"mountain view,\" \"ocean view,\" \"cabin,\" \"cottage.\"\n-   **Rental Potential Data:** Phrases like \"short-term rental\" (STR), \"vacation rental,\" \"rental history,\" \"projected income,\" \"occupancy rates,\" \"cap rate.\"\n-   **Regulations & Zoning:** Local ordinances on short-term rentals, rental permits or licenses, zoning restrictions.\n-   **HOA Documents:** \"Homeowners Association,\" \"HOA fees,\" \"covenants,\" \"bylaws,\" and specific rules regarding rentals, guests, and property use.\n-   **Location & Proximity:** Distance to key attractions (e.g., \"miles to beach,\" \"distance to ski lift\"), restaurants, grocery stores, and emergency services.\n-   **Property Management:** Information on property management companies, their fees, services offered, and contact details.\n-   **Financials:** Second home mortgage rates, insurance quotes (especially for flood or fire zones), estimated utility costs, closing cost estimates.\n-   **Condition & Amenities:** Age of roof/HVAC, inspection reports, mentions of \"pool,\" \"hot tub,\" \"dock,\" \"fireplace,\" \"furnished.\"\n\n#### Information to Ignore (Noise):\n-   Information on local primary and secondary school districts or school ratings.\n-   Daily commute times to major business hubs or office parks.\n-   First-time homebuyer programs and grants.\n-   Long-term residential rental market data (12-month leases).\n-   Commercial real estate listings (e.g., office spaces, retail).\n-   General municipal information unrelated to property ownership or tourism (e.g., local election results, public works plans).\n-   Detailed biographies of real estate agents or sellers."
}