{
  "main_persona": "Home Buyer",
  "sub_persona": "Multi-Family Investor",
  "details": "#### Primary Objective:\nRetrieve all financial, physical, and legal information necessary to evaluate the profitability and risk of multi-family real estate investments.\n\n#### Core Information to Retrieve:\n-   **Financial Performance Data:** Keywords like \"rent roll,\" \"pro forma,\" \"net operating income (NOI),\" \"cap rate,\" \"cash flow,\" \"operating expenses,\" \"gross potential income.\"\n-   **Property-Specific Terms:** \"multi-family,\" \"duplex,\" \"triplex,\" \"fourplex,\" \"apartment building,\" \"number of units,\" \"unit mix\" (e.g., \"1-bed/1-bath\").\n-   **Expense Details:** \"property taxes,\" \"insurance,\" \"utilities,\" \"management fees,\" \"repairs and maintenance,\" \"landscaping,\" \"trash removal.\"\n-   **Tenancy Information:** \"lease agreements,\" \"lease expiration dates,\" \"occupancy rate,\" \"vacancy rate,\" \"tenant-occupied,\" \"rental history,\" \"delinquency report.\"\n-   **Building Condition & Upgrades:** \"capital expenditures\" or \"CapEx,\" \"inspection report,\" \"new roof,\" \"HVAC system,\" \"updated plumbing/electrical,\" \"renovated units.\"\n-   **Offering Documents:** \"offering memorandum (OM),\" \"listing agreement,\" \"asking price,\" \"price per unit,\" \"price per square foot.\"\n-   **Location & Market Data:** \"comparable sales\" or \"comps,\" \"market rent,\" \"neighborhood analysis,\" \"zoning classification\" (e.g., R3, R4).\n-   **Financing Terms:** \"debt service,\" \"assumable loan,\" \"seller financing,\" \"appraisal value.\"\n\n#### Information to Ignore (Noise):\n-   Marketing language targeting residential homeowners (e.g., \"your dream home,\" \"cozy starter home,\" \"perfect for your family\").\n-   Information specific to Single-Family Residences (SFRs) unless used as a market comparable.\n-   Homeowner Association (HOA) documents for single-family subdivisions or condominiums.\n-   Interior design or staging advice aimed at emotional appeal rather than ROI.\n-   Personal anecdotes or biographies of previous owners.\n-   Local community event flyers, school newsletters, or non-real estate announcements.\n-   General real estate news not specific to investment properties or the local market."
}