{
  "main_persona": "Home Buyer",
  "sub_persona": "Home Buyer",
  "details": "#### Primary Objective:\nRetrieve all information related to property evaluation, purchase logistics, financing, and legal documentation necessary to make an informed home buying decision.\n\n#### Core Information to Retrieve:\n-   **Property Details:** Property address, MLS number, list price, price history, property tax amount, square footage, lot size, number of bedrooms and bathrooms, year built.\n-   **Listing Descriptions:** Keywords like \"updated kitchen,\" \"hardwood floors,\" \"new roof,\" \"finished basement,\" \"fenced yard,\" \"central air.\"\n-   **Financial Documents:** Loan Estimates, Closing Disclosures, pre-approval letters, interest rates, APR, loan term, closing costs estimates, earnest money amounts.\n-   **Legal & Contractual Terms:** Phrases like \"purchase agreement,\" \"sales contract,\" \"seller's disclosure,\" \"addendum,\" \"contingency\" (e.g., \"inspection contingency,\" \"financing contingency\").\n-   **Inspection Reports:** Home inspection reports, pest inspection results, radon tests, well/septic reports. Keywords like \"foundation,\" \"roof,\" \"HVAC,\" \"electrical,\" \"plumbing.\"\n-   **Community & Governance:** Homeowners Association (HOA) documents, covenants (CC&Rs), HOA fees, school district names, assigned schools.\n-   **Valuation & Title:** Appraisal reports, comparable sales (\"comps\"), title search results, information on liens or encumbrances.\n\n#### Information to Ignore (Noise):\n-   Real estate agent marketing materials and training documents.\n-   General real estate market trend reports not specific to the property's immediate area.\n-   Advertisements for mortgage lenders, moving companies, or home furnishing stores.\n-   Previous owner's personal documents (e.g., old utility bills, personal correspondence).\n-   Architectural blueprints or highly technical construction schematics.\n-   Internal brokerage documents like commission agreements."
}