{
  "main_persona": "Home Inspector",
  "sub_persona": "Thermal Imaging & Energy Efficiency Inspector",
  "details": "#### Primary Objective:\nRetrieve technical specifications, standards, and problem indicators related to a property's energy performance, thermal envelope, and potential moisture intrusion issues.\n\n#### Core Information to Retrieve:\n-   **Insulation Details:** Keywords like \"R-value,\" \"U-value,\" \"insulation type,\" \"spray foam,\" \"batt,\" \"blown-in,\" \"rigid foam,\" \"vapor barrier,\" \"air barrier.\"\n-   **Building Envelope Components:** \"Window schedule,\" \"door schedule,\" \"U-factor,\" \"SHGC\" (Solar Heat Gain Coefficient), \"low-e,\" \"air sealing,\" \"weatherstripping,\" \"building wrap,\" \"sheathing.\"\n-   **Energy & Performance Standards:** References to \"Energy Star,\" \"IECC\" (International Energy Conservation Code), \"blower door test,\" \"ACH50,\" \"energy audit,\" \"RESNET,\" \"BPI\" (Building Performance Institute).\n-   **HVAC System Specifications:** Model numbers for \"furnace,\" \"air conditioner,\" \"heat pump.\" Efficiency ratings like \"SEER,\" \"AFUE,\" \"HSPF.\" Information on \"ductwork,\" \"duct leakage,\" \"ventilation,\" and \"thermostat.\"\n-   **Moisture & Leak Indicators:** Phrases like \"water intrusion,\" \"moisture damage,\" \"roof leak,\" \"plumbing leak,\" \"ice damming,\" \"condensation,\" \"mold,\" \"efflorescence,\" \"flashing.\"\n-   **Structural & Material Information:** Building plans, cross-sections, \"framing type,\" \"foundation type\" (slab, crawlspace, basement), \"attic ventilation,\" \"roofing material.\"\n-   **Electrical Hot Spots:** References to \"overheating circuits,\" \"hot breaker,\" \"loose electrical connection,\" \"thermal anomaly\" in relation to electrical panels or wiring.\n-   **Appliance Information:** Specifications for \"water heater,\" major appliances with \"Energy Guide\" labels, manufacturer installation manuals.\n\n#### Information to Ignore (Noise):\n-   **Aesthetic & Decorative Information:** Paint colors, flooring types (unless related to radiant heat), landscaping plans, interior design choices.\n-   **Financial & Legal Documents:** Property deeds, mortgage agreements, tax assessments, appraisal reports, purchase contracts.\n-   **Real Estate Marketing:** Listing descriptions, promotional brochures, staging information, descriptions of \"curb appeal.\"\n-   **Neighborhood/Community Information:** HOA covenants (unless they dictate specific building materials), school district ratings, local amenities.\n-   **Personal homeowner documents** and correspondence.\n-   General home repair receipts for non-energy-related items (e.g., fixing a cosmetic crack in drywall, repairing a fence)."
}