{
  "main_persona": "Home Inspector",
  "sub_persona": "New Construction Inspector",
  "details": "#### Primary Objective:\nRetrieve all technical documentation related to construction plans, building codes, material specifications, and official permits to verify a new property's compliance and quality.\n\n#### Core Information to Retrieve:\n-   **Architectural & Engineering Plans:** Blueprints, floor plans, elevation drawings, structural plans, framing diagrams, foundation plans.\n-   **Systems Schematics:** MEP (Mechanical, Electrical, Plumbing) drawings, HVAC layouts, electrical wiring diagrams, plumbing riser diagrams.\n-   **Building Codes & Standards:** References to \"International Residential Code (IRC),\" \"National Electrical Code (NEC),\" local building codes, \"code compliance,\" \"inspection requirements.\"\n-   **Permits & Official Documents:** \"Building permit,\" \"electrical permit,\" \"certificate of occupancy,\" \"inspection report,\" \"passed inspection,\" \"final inspection.\"\n-   **Material & Product Specifications:** Manufacturer installation instructions, product data sheets, \"spec sheets,\" material lists, specific brand names or model numbers for windows, roofing, siding, appliances, etc.\n-   **Construction & Site Reports:** \"Geotechnical report,\" \"soil report,\" \"drainage plan,\" \"grading plan,\" \"punch list,\" \"change order,\" \"construction log.\"\n-   **Builder & Warranty Documents:** \"Builder's warranty,\" \"structural warranty,\" \"scope of work,\" \"construction agreement.\"\n\n#### Information to Ignore (Noise):\n-   Real estate marketing brochures and sales materials.\n-   Homeowner mortgage agreements, financing details, or closing statements.\n-   Interior design choices like paint colors, furniture layouts, or decorative finishes.\n-   Homeowner's Association (HOA) bylaws, meeting minutes, and fee schedules (unless they specify construction standards).\n-   Appliance user manuals (except for installation instructions).\n-   Personal correspondence between the buyer and the builder not related to construction changes."
}