{
  "main_persona": "Home Inspector",
  "sub_persona": "Home Inspector",
  "details": "#### Primary Objective:\nRetrieve all information related to a property's structural integrity, major systems (HVAC, plumbing, electrical), potential defects, safety hazards, and maintenance history.\n\n#### Core Information to Retrieve:\n-   **Structural Components:** Keywords like \"foundation,\" \"crack,\" \"settling,\" \"beam,\" \"joist,\" \"truss,\" \"roof,\" \"shingles,\" \"siding,\" \"windows,\" \"framing.\"\n-   **Major Systems:**\n    -   **Electrical:** \"electrical panel,\" \"circuit breaker,\" \"wiring\" (especially \"aluminum\" or \"knob and tube\"), \"GFCI,\" \"amperage,\" \"service upgrade.\"\n    -   **Plumbing:** \"plumbing,\" \"water heater\" (age, capacity), \"pipes\" (material like \"copper,\" \"PEX,\" \"galvanized\"), \"septic system,\" \"sump pump,\" \"leak,\" \"water pressure.\"\n    -   **HVAC:** \"furnace,\" \"air conditioner,\" \"heat pump,\" \"ductwork,\" \"boiler,\" \"thermostat.\"\n-   **Safety Hazards:** \"asbestos,\" \"lead paint,\" \"radon test,\" \"mold,\" \"moisture,\" \"water damage,\" \"termite,\" \"pest infestation,\" \"wood rot,\" \"carbon monoxide detector,\" \"smoke alarm.\"\n-   **History & Documentation:** \"permit,\" \"previous inspection report,\" \"remodel,\" \"renovation,\" \"addition,\" \"blueprint,\" \"schematic.\"\n-   **Appliance & System Details:** \"age of,\" \"installation date,\" \"service record,\" \"maintenance history,\" \"warranty,\" \"user manual,\" \"model number,\" \"serial number.\"\n-   **Exterior & Site:** \"grading,\" \"drainage,\" \"driveway,\" \"walkway,\" \"deck,\" \"porch,\" \"retaining wall,\" \"fence,\" \"chimney,\" \"flashing,\" \"gutters.\"\n-   **Interior Components:** \"attic,\" \"crawlspace,\" \"insulation,\" \"ventilation,\" \"fireplace,\" \"chimney flue.\"\n\n#### Information to Ignore (Noise):\n-   Mortgage documents, loan information, and property financing details.\n-   Property tax records and assessed value statements.\n-   Homeowner's insurance policies (unless detailing a claim for a physical repair).\n-   Real estate listing descriptions, marketing materials, and staging information.\n-   Neighborhood information, school district ratings, or community newsletters.\n-   Utility bills (unless they show extreme usage that might indicate a leak or inefficiency).\n-   Personal correspondence, photos, or documents unrelated to the property's physical structure.\n-   Information about home decor, paint colors, or interior design choices."
}