{
  "main_persona": "Home Inspector",
  "sub_persona": "Franchise Home Inspector",
  "details": "#### Primary Objective:\nRetrieve all information related to a property's physical condition, system defects, and safety hazards, cross-referencing against franchise-specific inspection standards, reporting protocols, and procedures.\n\n#### Core Information to Retrieve:\n-   **Franchise-Specific Documents:** Standards of Practice (SOP), inspection checklists, reporting templates, comment libraries, software user guides.\n-   **Defect Language:** Keywords like \"material defect,\" \"safety hazard,\" \"deficiency,\" \"recommend repair,\" \"further evaluation,\" \"monitor,\" \"inoperable,\" \"end of life.\"\n-   **Structural Systems:** Foundation cracks, settlement, framing issues, moisture intrusion in basements or crawlspaces.\n-   **Exterior Components:** Siding damage, window seal failure, wood rot, flashing issues, grading and drainage problems.\n-   **Roofing Systems:** Age of roof, missing or damaged shingles/tiles, evidence of leaks, gutter and downspout condition, flashing details.\n-   **Plumbing Systems:** Leaks, low water pressure, water heater age and condition, TPR valve presence, drain blockages, polybutylene piping.\n-   **Electrical Systems:** Service panel details (brand, amperage), aluminum wiring, double-tapped breakers, ungrounded outlets, GFCI/AFCI protection.\n-   **HVAC Systems:** Age of furnace and A/C units, operational status, filter condition, ductwork issues, combustion analysis results.\n-   **Interior Components:** Water stains on ceilings, floor damage, non-functional windows, stair safety, smoke and CO detector presence.\n-   **Insulation & Ventilation:** Type and amount of attic/crawlspace insulation, signs of mold or mildew, ventilation adequacy.\n-   **Training & Compliance:** Franchise training manuals, bulletins on new standards, continuing education requirements, pre-inspection agreement templates.\n\n#### Information to Ignore (Noise):\n-   Real estate transaction details (purchase price, mortgage documents, closing statements).\n-   Property appraisals, tax records, and market value assessments.\n-   Home staging documents, interior design plans, and cosmetic details (e.g., paint color).\n-   Personal homeowner documents (utility bills, mail, insurance policies).\n-   Neighborhood statistics (school ratings, crime rates, demographics).\n-   Marketing materials aimed at selling new franchises or general real estate listings.\n-   Detailed manufacturing specifications for common building materials unless related to a known recall or defect."
}