{
  "main_persona": "Home Buyer",
  "sub_persona": "Rural/Acreage Buyer",
  "details": "#### Primary Objective:\nRetrieve all information related to property features, land characteristics, utilities, and legal considerations for purchasing homes on large, rural tracts of land.\n\n#### Core Information to Retrieve:\n-   **Property & Land Details:** Acreage, lot size, property lines, property survey, plat map.\n-   **Land Characteristics:** Phrases like \"wooded,\" \"cleared pasture,\" \"rolling hills,\" \"level ground,\" \"tillable acres,\" \"creek/river frontage,\" \"pond.\"\n-   **Utilities & Infrastructure:**\n    -   Water Source: \"well,\" \"well log,\" \"well depth,\" \"GPM\" (gallons per minute), \"cistern,\" \"public water.\"\n    -   Sewer System: \"septic system,\" \"septic permit,\" \"percolation test\" or \"perc test,\" \"conventional septic,\" \"aerobic system.\"\n    -   Connectivity: \"broadband access,\" \"fiber internet,\" \"satellite internet,\" \"cell service.\"\n-   **Access:** \"road frontage,\" \"private road,\" \"easement,\" \"right of way,\" \"road maintenance agreement,\" \"deeded access.\"\n-   **Zoning & Legal:**\n    -   Zoning classification: \"agricultural,\" \"rural residential,\" \"unrestricted.\"\n    -   Rights: \"mineral rights,\" \"water rights,\" \"timber rights.\"\n    -   Restrictions: \"deed restrictions,\" \"covenants,\" \"conservation easement.\"\n-   **Outbuildings & Structures:** \"Barn,\" \"workshop,\" \"shed,\" \"pole barn,\" \"stables,\" \"fencing,\" \"cross-fenced,\" \"greenhouse.\"\n-   **Financials:** Property taxes, \"agricultural exemption,\" \"homestead exemption.\"\n-   **Inspections & Reports:** \"Home inspection,\" \"well inspection,\" \"septic inspection,\" \"termite/pest inspection.\"\n\n#### Information to Ignore (Noise):\n-   Information on urban or suburban amenities (e.g., walkability scores, public transit, proximity to shopping malls).\n-   Condominium or townhouse association documents (HOA bylaws for subdivisions).\n-   Listings for properties with less than one acre of land.\n-   Commercial or industrial zoning information.\n-   Apartment rental agreements and flyers.\n-   City event calendars and announcements."
}