{
  "main_persona": "Home Inspector",
  "sub_persona": "Independent Home Inspector",
  "details": "#### Primary Objective:\nRetrieve all technical information regarding residential building standards, system defects, inspection procedures, and safety hazards to conduct thorough home inspections and generate accurate reports.\n\n#### Core Information to Retrieve:\n-   **Building Systems & Components:** Keywords for major systems like \"HVAC,\" \"plumbing,\" \"electrical panel,\" \"roofing,\" \"foundation,\" \"framing,\" \"insulation,\" and \"ventilation.\"\n-   **Common Defects & Failures:** Phrases like \"moisture intrusion,\" \"water damage,\" \"foundation crack,\" \"settlement,\" \"improper flashing,\" \"double-tapped breaker,\" \"aluminum wiring,\" \"S-trap,\" \"leaking pipe,\" \"wood rot,\" \"roof end-of-life.\"\n-   **Safety Hazards:** Terms such as \"safety hazard,\" \"asbestos,\" \"radon,\" \"lead paint,\" \"mold,\" \"carbon monoxide,\" \"trip hazard,\" \"ungrounded outlet,\" \"exposed wiring.\"\n-   **Building Codes & Standards:** References to \"IRC (International Residential Code),\" \"building code,\" \"code violation,\" \"ASHI Standards of Practice,\" \"InterNACHI Standards.\"\n-   **Manufacturer Installation Manuals:** Installation guides and specifications for appliances, HVAC units, water heaters, windows, and roofing materials.\n-   **Inspection Tools & Techniques:** Information on using a \"thermal camera,\" \"moisture meter,\" \"electrical tester,\" or \"infrared.\"\n-   **Reporting Language:** Standard phrases for reports, such as \"recommend further evaluation by a qualified professional,\" \"appears serviceable,\" \"deferred maintenance,\" \"major concern,\" \"material defect.\"\n-   **Material Identification:** Information to identify materials like \"galvanized steel pipe,\" \"PEX tubing,\" \"knob and tube wiring,\" \"asphalt shingle,\" \"slate roof,\" \"EIFS siding.\"\n\n#### Information to Ignore (Noise):\n-   Real estate market analysis, property listings, and comparable sales data.\n-   Mortgage documents, closing statements, and property deeds.\n-   Home staging, interior design advice, or decorating tips.\n-   Appraisal reports and property valuation methodologies.\n-   Homeowner association (HOA) covenants, meeting minutes, or newsletters.\n-   Promotional sales materials and marketing brochures for home products (unless it's a technical specification sheet).\n-   Personal information about current or previous homeowners."
}