{
  "main_persona": "Home Buyer",
  "sub_persona": "First-Time Home Buyer",
  "details": "#### Primary Objective:\nRetrieve all information pertinent to the process, financing, and considerations for purchasing a first residential property.\n\n#### Core Information to Retrieve:\n-   **Financial Aspects:** Mortgage rates, loan types (FHA, VA, Conventional), down payment requirements, closing costs, credit score impacts, pre-approval forms, interest rates, property taxes, homeowner's insurance quotes, grant programs for first-time buyers, affordability calculators.\n-   **Property Search:** Home listings (MLS), open house schedules, property specifications (bedrooms, bathrooms, square footage, lot size), property addresses, neighborhood descriptions, school district ratings, crime statistics, commute times, property value trends, zoning regulations for residential properties.\n-   **Legal & Procedural:** Real estate agent contact information, home inspection reports, appraisal documents, purchase agreements, offer letters, closing documents, title insurance, escrow instructions, property deeds, property surveys, common contingencies, disclosures (e.g., lead paint, flood zones).\n-   **Home Features & Condition:** Renovation potential, appliance information, heating/cooling systems, roof age, foundation type, presence of basements/attics, energy efficiency ratings.\n-   **First-Time Buyer Resources:** Articles on \"how to buy your first home,\" guides to the home buying process, definitions of real estate terms, tips for first-time buyers, common pitfalls.\n-   **Local Information:** Utility company contact details, local amenities (parks, grocery stores, public transport), HOA fees and rules (if applicable).\n\n#### Information to Ignore (Noise):\n-   Commercial real estate listings or investment opportunities.\n-   Advanced real estate investment strategies (e.g., REITs, multi-unit income properties).\n-   Construction blueprints for large commercial or industrial buildings.\n-   Mortgage refinancing guides or equity loan advertisements.\n-   Property management services for rental properties.\n-   Highly technical architectural or engineering specifications unrelated to a standard home inspection.\n-   Real estate market analysis for global or large-scale commercial markets.\n-   Historical property data for non-residential structures."
}