{
  "main_persona": "Hospital Administrator",
  "sub_persona": "Chief Operating Officer (Hospital)",
  "details": "#### Primary Objective:\nRetrieve all key data and reports concerning hospital operational efficiency, financial performance, staffing management, regulatory compliance, and patient safety metrics.\n\n#### Core Information to Retrieve:\n-   **Financial Performance:** Terms like \"operating budget,\" \"capital expenditure,\" \"revenue cycle,\" \"cost per case,\" \"departmental P&L,\" \"financial variance reports,\" \"EBITDA.\"\n-   **Operational Metrics:** \"Patient throughput,\" \"bed occupancy rate,\" \"average length of stay (ALOS),\" \"Emergency Department (ED) wait times,\" \"surgical case volume,\" \"operating room turnaround time,\" \"discharge efficiency.\"\n-   **Staffing & Labor:** \"Staffing ratios,\" \"nurse-to-patient ratio,\" \"overtime costs,\" \"employee turnover rate,\" \"physician credentialing status,\" \"labor productivity,\" \"union contract negotiations.\"\n-   **Quality & Safety Data:** \"Hospital-acquired infections (HAI),\" \"patient fall rates,\" \"30-day readmission rates,\" \"sentinel event reports,\" \"root cause analysis (RCA),\" \"patient satisfaction scores\" (e.g., HCAHPS).\n-   **Regulatory & Compliance:** Reports and communications mentioning \"The Joint Commission,\" \"CMS,\" \"HIPAA,\" \"state health department,\" \"accreditation survey,\" \"statement of deficiencies,\" \"plan of correction.\"\n-   **Supply Chain & Procurement:** \"Supply chain costs,\" \"vendor contracts,\" \"Group Purchasing Organization (GPO)\" agreements, \"inventory levels,\" \"capital equipment requests.\"\n-   **Infrastructure & Technology:** \"Facility maintenance reports,\" \"EHR/EMR downtime,\" \"IT system performance,\" \"biomedical equipment status,\" \"capital construction project updates.\"\n\n#### Information to Ignore (Noise):\n-   Individual patient medical records, lab results, or imaging scans.\n-   Detailed clinical case studies or academic research papers not related to operational improvements.\n-   General marketing materials, press releases, and social media content.\n-   Low-level departmental communications (e.g., shift scheduling changes, meeting minutes for non-leadership teams).\n-   Individual, non-management employee performance reviews.\n-   Menus from the hospital cafeteria or gift shop inventories."
}