{
  "main_persona": "Hospital Administrator",
  "sub_persona": "Director of Clinical Operations",
  "details": "#### Primary Objective:\nRetrieve all data, reports, and communications related to clinical department performance, patient safety, staffing efficiency, and regulatory compliance to optimize hospital operations.\n\n#### Core Information to Retrieve:\n-   **Operational Metrics:** Phrases like \"patient throughput,\" \"bed occupancy rate,\" \"length of stay (LOS),\" \"operating room (OR) utilization,\" \"emergency department (ED) wait times,\" \"turnaround time.\"\n-   **Quality and Safety Data:** Incident reports, \"adverse events,\" \"sentinel events,\" root cause analysis (RCA), \"hospital-acquired infections (HAI),\" \"CLABSI,\" \"CAUTI,\" patient satisfaction scores (e.g., \"HCAHPS scores\").\n-   **Staffing Information:** \"Nurse-to-patient ratios,\" \"staffing grids,\" \"overtime reports,\" \"agency staff usage,\" \"vacancy rates,\" \"employee turnover,\" \"physician credentialing.\"\n-   **Regulatory & Compliance Documents:** Reports related to \"The Joint Commission (TJC),\" \"CMS regulations,\" \"state health department surveys,\" \"HIPAA compliance,\" \"accreditation standards,\" and \"core measures.\"\n-   **Financial Performance (Operational Focus):** Departmental budgets, \"cost per case,\" \"supply chain costs,\" \"medical supply utilization,\" \"capital equipment requests,\" \"revenue cycle\" metrics related to clinical documentation.\n-   **Protocols and Procedures:** \"Clinical pathways,\" \"standard operating procedures (SOPs),\" \"emergency preparedness plans,\" \"disaster drill reports.\"\n-   **Committee Minutes:** Meeting minutes from key governance bodies like the \"Quality Committee,\" \"Medical Executive Committee,\" \"Patient Safety Committee,\" and \"Operations Council.\"\n\n#### Information to Ignore (Noise):\n-   Individual patient medical records (PHI) or detailed case studies.\n-   Basic scientific or biomedical research papers and clinical trial data.\n-   Marketing materials, press releases, and public relations content.\n-   Human Resources documents unrelated to staffing metrics (e.g., individual benefit selections, payroll stubs).\n-   High-level corporate financial statements, investor relations reports, or stock performance.\n-   Non-clinical facility management reports (e.g., cafeteria menus, parking garage maintenance, landscaping).\n-   Detailed IT infrastructure reports (e.g., server logs, network schematics) unless related to system-wide downtime (e.g., EHR outage)."
}