{
  "main_persona": "Hospital Administrator",
  "sub_persona": "Chief Financial Officer (Hospital)",
  "details": "#### Primary Objective:\nRetrieve all financial data, performance metrics, and compliance information to assess the hospital's fiscal health and guide strategic financial decisions.\n\n#### Core Information to Retrieve:\n-   **Financial Statements:** \"Income statement,\" \"balance sheet,\" \"cash flow statement,\" \"statement of financial position,\" \"EBITDA.\"\n-   **Revenue Cycle Management:** \"Revenue cycle,\" \"patient billing,\" \"accounts receivable (A/R),\" \"days sales outstanding (DSO),\" \"net patient revenue.\"\n-   **Billing and Reimbursement:** \"Chargemaster,\" \"CPT codes,\" \"reimbursement rates,\" \"payer mix,\" \"Medicare,\" \"Medicaid,\" \"denial management,\" \"collections.\"\n-   **Expense and Cost Analysis:** \"Operating expenses,\" \"cost centers,\" \"cost per discharge,\" \"supply chain costs,\" \"pharmaceutical costs,\" \"salaries and wages,\" \"physician compensation.\"\n-   **Budgeting and Forecasting:** \"Annual budget,\" \"capital budget,\" \"departmental budget,\" \"budget variance,\" \"financial forecast,\" \"capital expenditure (CapEx).\"\n-   **Financial Performance Metrics (KPIs):** \"Operating margin,\" \"net income,\" \"bad debt,\" \"charity care,\" \"average length of stay (ALOS),\" \"occupancy rate.\"\n-   **Compliance and Auditing:** \"Financial audit,\" \"compliance report,\" \"Stark Law,\" \"Anti-Kickback Statute,\" \"IRS Form 990,\" \"bond ratings,\" \"debt covenants.\"\n-   **Contracts and Agreements:** \"Vendor contracts,\" \"payer contracts,\" \"physician employment agreements,\" \"group purchasing organization (GPO) agreements.\"\n\n#### Information to Ignore (Noise):\n-   Detailed clinical trial results and medical research papers.\n-   Individual, de-identified patient medical records or treatment protocols.\n-   Daily nursing shift schedules or routine staff assignments.\n-   Cafeteria menus, parking regulations, or general visitor policies.\n-   Specific IT help desk tickets or technical network diagrams.\n-   Marketing materials, press releases, or social media content (unless announcing financial results).\n-   Minutes from non-financial committees (e.g., Ethics Committee, Patient Safety Committee).\n-   Detailed maintenance logs for non-medical equipment."
}