{
  "main_persona": "Hospital Administrator",
  "sub_persona": "Director of Quality and Patient Safety",
  "details": "#### Primary Objective:\nRetrieve all information concerning patient safety incidents, quality improvement metrics, regulatory standards, and best practices to monitor and enhance the quality of patient care.\n\n#### Core Information to Retrieve:\n-   **Patient Safety Events:** Phrases like \"adverse event,\" \"sentinel event,\" \"near miss,\" \"medical error,\" \"patient harm,\" \"incident report.\"\n-   **Analysis Reports:** \"Root Cause Analysis (RCA),\" \"Failure Mode and Effects Analysis (FMEA),\" \"morbidity and mortality (M&M) reports.\"\n-   **Quality Metrics & KPIs:** \"Readmission rates,\" \"hospital-acquired infection (HAI),\" \"CLABSI,\" \"CAUTI,\" \"surgical site infection (SSI),\" \"patient fall rates,\" \"medication error rates,\" \"length of stay (LOS).\"\n-   **Regulatory & Accreditation:** Keywords like \"The Joint Commission (TJC),\" \"CMS,\" \"Department of Health,\" \"accreditation survey,\" \"survey readiness,\" \"statement of deficiencies,\" \"plan of correction.\"\n-   **Standards and Goals:** \"National Patient Safety Goals (NPSGs),\" \"standard of care,\" \"evidence-based practice,\" \"clinical practice guidelines.\"\n-   **Patient Feedback:** \"Patient satisfaction surveys,\" \"HCAHPS scores,\" \"patient grievances,\" \"complaint logs.\"\n-   **Improvement Initiatives:** \"Quality Improvement (QI) project,\" \"Performance Improvement (PI) plan,\" \"Plan-Do-Study-Act (PDSA) cycle,\" \"Lean,\" \"Six Sigma.\"\n-   **Committee Documentation:** Agendas and minutes for \"Patient Safety Committee,\" \"Quality Council,\" \"Peer Review Committee,\" \"Infection Control Committee.\"\n-   **Policies & Procedures:** Documents titled \"Patient Safety Plan,\" \"Infection Control Policy,\" \"Medication Administration Policy.\"\n\n#### Information to Ignore (Noise):\n-   Detailed hospital financial reports (e.g., revenue cycle, accounts payable) unless directly funding a safety initiative.\n-   Marketing materials, press releases, and advertising campaigns.\n-   Human Resources documents concerning payroll, benefits, or employee social events.\n-   Individual, de-identified patient billing records and insurance claims.\n-   Day-to-day departmental operational reports not related to quality (e.g., cafeteria menus, parking logistics, routine maintenance schedules).\n-   Vendor contracts for non-clinical supplies."
}