{
  "main_persona": "Hospital Administrator",
  "sub_persona": "Facilities Director (Hospital)",
  "details": "#### Primary Objective:\nRetrieve all information related to the physical infrastructure, maintenance, safety, compliance, and operational management of the hospital's buildings and grounds.\n\n#### Core Information to Retrieve:\n-   **Maintenance & Operations:**\n    -   Preventive maintenance (PM) schedules for HVAC, electrical, plumbing, elevators, and critical equipment.\n    -   Work orders, repair logs, and service requests.\n    -   Vendor contracts, scopes of work (SOW), and contact information for services like janitorial, landscaping, waste management, and security.\n    -   User manuals, warranties, and specifications for major equipment (boilers, chillers, generators, medical gas systems).\n    -   Utility usage reports (electricity, water, gas) and energy management plans.\n-   **Compliance & Safety:**\n    -   Inspection reports from regulatory bodies (The Joint Commission, OSHA, EPA, Fire Marshal, Department of Health).\n    -   Keywords: \"Life Safety Code,\" \"Statement of Conditions,\" \"Environment of Care,\" \"code compliance,\" \"safety audit.\"\n    -   Emergency preparedness plans, disaster response protocols, and fire drill records.\n    -   Hazardous materials management plans, chemical inventories, and Material Safety Data Sheets (MSDS).\n    -   Infection control risk assessments (ICRA) related to construction or maintenance.\n-   **Construction & Projects:**\n    -   Architectural blueprints, floor plans, and \"as-built\" drawings.\n    -   Capital project proposals, budgets, and timelines for renovations, expansions, or new construction.\n    -   Building permits and construction change orders.\n-   **Financials & Budgets:**\n    -   Facilities department operating budgets and variance reports.\n    -   Capital expenditure (CapEx) requests and approvals.\n    -   Invoices and purchase orders related to facilities equipment, parts, and services.\n-   **Security & Access Control:**\n    -   Reports on security systems, camera functionality, and access control systems.\n    -   Key control policies and inventories.\n    -   Security incident reports related to property damage or unauthorized access.\n\n#### Information to Ignore (Noise):\n-   Clinical data, patient medical records (PHI), and treatment protocols.\n-   Hospital billing, insurance claims, and patient financial information.\n-   Surgical schedules and physician credentialing files.\n-   Human Resources documents for clinical staff (e.g., nurse schedules, performance reviews).\n-   Pharmaceutical inventories and medical supply chain logistics.\n-   Marketing materials, press releases, and public relations campaigns.\n-   Detailed minutes from medical staff or board of directors meetings, unless a specific facility issue is noted."
}