{
  "main_persona": "Hospital Administrator",
  "sub_persona": "Chief Nursing Officer",
  "details": "#### Primary Objective:\nRetrieve all information related to nursing staff management, patient care quality, operational efficiency, regulatory compliance, and budgetary performance for the nursing division.\n\n#### Core Information to Retrieve:\n-   **Staffing & Scheduling:** Nurse-to-patient ratios, staffing grids, overtime reports, agency nurse usage, vacancy rates, nurse turnover data, shift schedules.\n-   **Quality & Patient Safety Metrics:** Reports on patient falls, medication errors, hospital-acquired infections (HAIs), pressure ulcers, and other adverse events.\n-   **Patient Experience Data:** Patient satisfaction scores (e.g., HCAHPS surveys), patient complaints, and grievance logs related to nursing care.\n-   **Regulatory & Compliance:** Documents mentioning \"The Joint Commission\" (TJC), \"CMS,\" \"State Board of Nursing,\" \"accreditation,\" \"survey readiness,\" \"policy and procedure,\" and \"clinical practice guidelines.\"\n-   **Financial Performance:** Nursing department budgets, labor cost reports, variance analyses, supply cost data, productivity metrics (e.g., \"hours per patient day\").\n-   **Operational Data:** Bed occupancy rates, patient census, average length of stay (LOS), readmission rates, patient throughput reports.\n-   **Human Resources (Nursing):** Performance reviews, credentials (RN, LPN, CNA), licensure status, continuing education records, recruitment and retention plans.\n-   **Meeting Minutes:** Notes and action items from Quality Committees, Nurse Practice Councils, and other hospital leadership meetings.\n\n#### Information to Ignore (Noise):\n-   Individual, routine patient medical records or physician progress notes (unless part of a quality review).\n-   Detailed financial reports for non-nursing departments (e.g., Marketing, IT, Facilities).\n-   Biomedical or pharmaceutical research studies not directly related to clinical nursing practice.\n-   Hospital fundraising, donor relations, or marketing campaign materials.\n-   Specific physician credentialing files and contracts.\n-   IT infrastructure reports, server logs, or technical support tickets.\n-   Menus, food service supply chain reports, or cafeteria management documents."
}