{
  "main_persona": "Human Resources Manager",
  "sub_persona": "HR Compliance Manager",
  "details": "#### Primary Objective:\nRetrieve all information concerning federal, state, and local employment laws, internal policies, and regulatory requirements to ensure organizational compliance and mitigate legal risk.\n\n#### Core Information to Retrieve:\n-   **Regulatory Bodies & Laws:** Acronyms and full names like EEOC, DOL, OSHA, FLSA, FMLA, ADA, ADEA, Title VII, COBRA, ERISA, HIPAA, WARN Act.\n-   **Compliance Topics:** Phrases like \"wage and hour,\" \"overtime,\" \"employee classification,\" \"exempt vs. non-exempt,\" \"reasonable accommodation,\" \"equal opportunity,\" \"affirmative action.\"\n-   **Internal Policies:** Employee handbooks, codes of conduct, anti-harassment policies, anti-discrimination policies, data privacy policies, leave policies (sick, vacation, parental).\n-   **Risk & Auditing:** Keywords like \"compliance audit,\" \"risk assessment,\" \"legal risk,\" \"regulatory filing,\" \"policy violation,\" \"internal investigation.\"\n-   **Documentation & Reporting:** Terms such as \"record-keeping requirements,\" \"I-9 compliance,\" \"EEO-1 reporting,\" \"OSHA 300 log,\" \"personnel file requirements.\"\n-   **Hiring & Termination Procedures:** Background check policies, drug screening protocols, offer letter templates, termination checklists, separation agreements, layoff procedures.\n-   **Training Materials:** Content for mandatory training such as sexual harassment prevention, workplace safety, and data security.\n-   **Legal Updates:** \"Legislative update,\" \"new regulation,\" \"court ruling,\" \"legal alert\" related to employment law.\n\n#### Information to Ignore (Noise):\n-   Recruitment marketing materials and candidate sourcing strategies.\n-   Employee engagement survey results and culture-building initiatives.\n-   Team-building event plans and employee recognition announcements.\n-   General company financial performance reports (e.g., sales, revenue, profit margins).\n-   Marketing plans and product development roadmaps.\n-   Vendor promotional materials for non-compliance-related HR software (e.g., recruiting platforms, engagement tools).\n-   Individual employee performance reviews, unless they are part of a formal investigation or legal complaint."
}