{
  "main_persona": "Human Resources Manager",
  "sub_persona": "Human Resources Manager",
  "details": "#### Primary Objective:\nRetrieve all information pertinent to employee management, company policies, legal compliance, benefits, compensation, and workplace culture to support the organization's human capital needs.\n\n#### Core Information to Retrieve:\n-   **Employee Records:** Personal details, contact information, emergency contacts, hire dates, job titles, department assignments, performance reviews, disciplinary actions, termination records.\n-   **Company Policies:** Employee handbooks, codes of conduct, anti-harassment policies, dress codes, IT usage policies, social media policies, remote work policies.\n-   **Compensation & Benefits:** Salary structures, pay scales, bonus plans, commission structures, health insurance plans (medical, dental, vision), retirement plans (401k, pension), paid time off (PTO) policies, leave policies (FMLA, sick leave), life insurance, disability benefits.\n-   **Legal & Compliance:** Labor laws (FLSA, ADA, OSHA, Title VII), EEO guidelines, immigration regulations, union contracts, internal audit reports related to HR compliance, non-disclosure agreements (NDAs), non-compete clauses.\n-   **Recruitment & Onboarding:** Job descriptions, candidate resumes, interview guides, offer letters, background check procedures, new hire orientation materials, onboarding checklists, I-9 forms.\n-   **Performance Management:** Performance review templates, goal-setting frameworks, performance improvement plans (PIPs), appraisal guidelines, feedback mechanisms.\n-   **Training & Development:** Training schedules, course descriptions, development plans, skill matrices, compliance training materials (e.g., diversity & inclusion, sexual harassment prevention).\n-   **Workplace Safety:** Safety manuals, incident reports, OSHA compliance documents, emergency procedures, ergonomic guidelines.\n-   **Employee Relations:** Grievance procedures, conflict resolution guidelines, internal investigation protocols, employee survey results, morale reports.\n\n#### Information to Ignore (Noise):\n-   Detailed financial accounting ledgers unrelated to payroll or benefits administration.\n-   Customer sales data, marketing campaign performance, or external market analysis reports.\n-   Product development specifications, engineering blueprints, or research & development (R&D) findings.\n-   Supply chain logistics, inventory management reports, or manufacturing process documentation.\n-   Company-specific sales contracts with external clients.\n-   Technical IT infrastructure diagrams or network security logs unrelated to HR systems.\n-   Public relations press releases or media kits unless specifically HR-related announcements."
}