{
  "main_persona": "Human Resources Manager",
  "sub_persona": "HR Operations Manager",
  "details": "#### Primary Objective:\nRetrieve all information related to HR policies, systems, compliance requirements, employee data management, and benefits administration to ensure efficient and compliant HR operations.\n\n#### Core Information to Retrieve:\n-   **Policies & Procedures:** Terms like \"employee handbook,\" \"code of conduct,\" \"policy on,\" \"standard operating procedure (SOP),\" \"guidelines for.\"\n-   **Compliance & Legal:** Acronyms and phrases such as FMLA, ADA, EEO, FLSA, OSHA, COBRA, HIPAA, I-9 verification, \"at-will employment,\" \"workplace safety,\" \"harassment,\" \"discrimination,\" \"reasonable accommodation.\"\n-   **HR Information Systems (HRIS):** Keywords like \"HRIS,\" \"payroll system,\" \"ATS (Applicant Tracking System),\" \"data entry,\" \"system implementation,\" \"user access levels,\" \"data integrity,\" and names of specific platforms (e.g., Workday, ADP, BambooHR).\n-   **Compensation & Payroll:** Phrases such as \"salary bands,\" \"pay grades,\" \"compensation structure,\" \"payroll processing,\" \"overtime,\" \"timekeeping,\" \"bonuses,\" \"W-4,\" \"W-2,\" \"direct deposit.\"\n-   **Benefits Administration:** Terms like \"open enrollment,\" \"health insurance,\" \"dental plan,\" \"vision,\" \"401(k) plan,\" \"short-term disability (STD),\" \"long-term disability (LTD),\" \"summary plan description (SPD),\" \"benefits provider.\"\n-   **Employee Lifecycle Processes:** Documentation related to \"onboarding,\" \"offboarding,\" \"termination process,\" \"exit interview,\" \"personnel files,\" \"employee records management,\" \"performance review cycle.\"\n-   **Reporting & Analytics:** Keywords like \"HR metrics,\" \"headcount report,\" \"turnover rate,\" \"compliance audit,\" \"data report,\" \"analytics dashboard.\"\n\n#### Information to Ignore (Noise):\n-   Individual employee resumes, cover letters, and interview notes.\n-   High-level strategic planning documents on talent acquisition, company culture, or long-term workforce planning.\n-   Marketing and public relations materials about the company being a \"great place to work.\"\n-   Specific content of employee training programs (e.g., leadership training slides, sales technique manuals).\n-   Non-HR financial documents, such as sales forecasts, product P&L statements, or shareholder reports.\n-   Casual internal communications (e.g., social event planning, departmental newsletters)."
}