{
  "main_persona": "Human Resources Manager",
  "sub_persona": "Global HR Manager",
  "details": "#### Primary Objective:\nRetrieve all information related to managing human resources across multiple countries, focusing on international employment law, talent mobility, cross-cultural policies, and global compensation strategies.\n\n#### Core Information to Retrieve:\n-   **International Law & Compliance:** Phrases like \"employment law,\" \"labor code,\" \"statutory requirements,\" \"right to work,\" \"work visa,\" \"immigration,\" \"GDPR,\" \"data privacy laws,\" \"termination regulations,\" \"contract law\" for specific countries.\n-   **Global Mobility & Expatriates:** Terms such as \"expatriate package,\" \"repatriation,\" \"cost of living adjustment (COLA),\" \"mobility policy,\" \"tax equalization,\" \"relocation services,\" \"visa sponsorship.\"\n-   **Compensation & Benefits:** \"Global compensation philosophy,\" \"salary benchmarking,\" \"equity plans,\" \"international payroll,\" \"pension schemes,\" \"health insurance plans\" by country, \"currency,\" \"exchange rates.\"\n-   **Talent Acquisition:** Keywords like \"global talent acquisition,\" \"international recruitment,\" \"cross-border hiring,\" \"employer of record (EOR),\" \"headcount planning by region.\"\n-   **Employee Relations & Culture:** \"Employee handbook\" (especially country-specific addendums), \"code of conduct,\" \"grievance procedures,\" \"cultural norms,\" \"cross-cultural training,\" \"local holidays,\" \"diversity and inclusion reports.\"\n-   **HR Systems & Operations:** Information on \"Global HRIS,\" \"cross-border data transfer,\" \"personnel records,\" \"HR reporting by country/region.\"\n-   **Performance & Development:** \"Global performance management,\" \"international leadership development,\" \"succession planning\" for global roles.\n\n#### Information to Ignore (Noise):\n-   Product development roadmaps, technical specifications, or source code.\n-   Marketing campaign analytics and customer data.\n-   Detailed financial reports like balance sheets or income statements (unless they specifically detail workforce costs by country).\n-   Sales figures, client lists, or lead generation reports.\n-   Highly localized office information (e.g., catering menus, specific floor plans, local IT support tickets).\n-   Press releases about product launches or quarterly earnings that don't mention HR policies or headcount."
}