{
  "main_persona": "Human Resources Manager",
  "sub_persona": "Talent Acquisition Manager",
  "details": "#### Primary Objective:\nRetrieve all information pertinent to attracting, sourcing, interviewing, hiring, and onboarding new employees, while ensuring legal compliance and optimizing the recruitment process.\n\n#### Core Information to Retrieve:\n-   **Job Descriptions:** Templates, examples, required qualifications, responsibilities, reporting structures for various roles.\n-   **Recruitment Strategies:** Sourcing channels (e.g., \"job boards,\" \"LinkedIn Recruiter,\" \"talent pipelines,\" \"university partnerships\"), employer branding guidelines, direct sourcing techniques.\n-   **Candidate Assessment:** Interview guides, sample interview questions (behavioral, technical), assessment methods (e.g., \"skills tests,\" \"psychometric evaluations\"), background check policies and procedures.\n-   **Compensation & Benefits:** Salary benchmarks, compensation structures, standard benefits packages (health, dental, 401k), equity grants, sign-on bonuses.\n-   **Offer Management:** Offer letter templates, negotiation strategies, offer acceptance rates, rejection communication.\n-   **Onboarding Procedures:** New hire checklists, first-day schedules, orientation materials, new employee paperwork (e.g., I-9 forms, W-4).\n-   **Legal Compliance:** Equal Employment Opportunity (EEO) guidelines, anti-discrimination laws (e.g., ADA), immigration laws (e.g., \"H1B sponsorship\"), \"fair hiring practices,\" \"non-compete clauses.\"\n-   **HR Technology:** Applicant Tracking System (ATS) usage guides, recruitment software features, HRIS integration.\n-   **Recruitment Metrics:** \"Time-to-hire,\" \"cost-per-hire,\" \"source of hire,\" \"applicant conversion rates,\" \"diversity metrics,\" \"turnover rate of new hires.\"\n-   **Talent Market Research:** Industry trends, talent shortages, competitor hiring practices, demographic data of labor pools.\n\n#### Information to Ignore (Noise):\n-   Detailed employee performance reviews and management documents for existing staff.\n-   Complex internal employee relations cases unrelated to hiring (e.g., disciplinary actions, grievances of current employees).\n-   Company financial statements or investor relations reports.\n-   Product development roadmaps or technical specifications unrelated to required skills.\n-   Marketing campaign analytics for customer acquisition.\n-   Detailed manufacturing processes or supply chain logistics.\n-   General office administration budgets not tied to recruitment."
}