{
  "main_persona": "Individual / Citizen",
  "sub_persona": "Caregiver (Non-Parental)",
  "details": "#### Primary Objective:\nRetrieve essential information related to the health, legal, financial, and daily living support needs of a non-parental care recipient, along with resources for the caregiver.\n\n#### Core Information to Retrieve:\n-   **Medical & Health Information:** Appointment schedules, medication lists (dosages, timings, side effects), diagnostic reports, treatment plans, doctor's notes, medical history, insurance claims, pharmacy contact details, dietary restrictions, allergy information.\n-   **Legal & Financial Documents:** Power of Attorney documents, wills, trusts, advance directives, benefit statements (Social Security, disability), banking information, invoices for care services, guardianship papers, legal aid resources.\n-   **Care Services & Providers:** Contact information for home health agencies, hospice, physical therapists, occupational therapists, assisted living facilities, adult day care centers, social workers, senior services.\n-   **Daily Living Support:** Meal plans, mobility aid instructions, adaptive equipment manuals, accessibility information, transportation schedules, personal care routines.\n-   **Government & Community Resources:** Information on local aging services, disability services, caregiver support programs, respite care options, grants for home modifications, public transportation details.\n-   **Emergency Preparedness:** Emergency contact lists, medical alerts, emergency procedures, evacuation plans, critical health information summary (ICE forms).\n-   **Caregiver Support:** Information on caregiver support groups, stress management resources, legal rights for caregivers, financial assistance for caregivers.\n-   **Specific Condition Information:** Research, management strategies, and support networks related to the care recipient's specific health conditions (e.g., Alzheimer's, Parkinson's, stroke recovery, mobility impairment).\n\n#### Information to Ignore (Noise):\n-   General corporate news and annual reports.\n-   Stock market fluctuations and investment advice unrelated to care recipient's existing finances.\n-   Broad academic research papers not directly applicable to caregiving or specific medical conditions.\n-   Political campaign literature or general election news.\n-   Fashion, entertainment, or celebrity gossip news.\n-   Highly technical schematics, software code, or complex engineering documents.\n-   Travel brochures for personal vacations.\n-   Promotional materials for products/services unrelated to healthcare, home care, or elder/disability support."
}