{
  "main_persona": "Individual / Citizen",
  "sub_persona": "Urban Dweller",
  "details": "#### Primary Objective:\nRetrieve practical, local information regarding city services, transportation, housing, community events, and public notices to effectively manage daily life in an urban environment.\n\n#### Core Information to Retrieve:\n-   **Local Services & Utilities:** Schedules for trash/recycling pickup, street cleaning dates, utility company contact information, power outage alerts.\n-   **Transportation:** Public transit schedules (bus, subway, train), route maps, fare information, service alerts, road closure notices, parking regulations, bike lane maps.\n-   **Housing:** Lease agreements, renters' rights documents, condo/HOA bylaws and announcements, building notices, property tax information.\n-   **Community & Events:** Schedules for farmers' markets, street festivals, community meetings, library programs, and free public events.\n-   **Local Governance:** City council meeting agendas/minutes, public hearing notices, zoning changes, contact information for local representatives, polling place locations.\n-   **Public Safety:** Local police non-emergency numbers, neighborhood watch newsletters, emergency preparedness guides, public safety alerts.\n-   **Local Businesses:** Menus for local restaurants, hours of operation for shops and services, announcements for new business openings.\n-   **Parks & Recreation:** Park hours, public pool schedules, recreation center class offerings, trail maps.\n\n#### Information to Ignore (Noise):\n-   National or international news and political analysis.\n-   Corporate financial reports (e.g., quarterly earnings, stock performance).\n-   Academic research papers or scientific journals.\n-   Abstract legal theory or federal case law.\n-   Marketing materials for non-local products or services.\n-   Internal corporate documents (e.g., HR policies, sales reports).\n-   Historical documents not relevant to current property, rights, or services."
}