{
  "main_persona": "Individual / Citizen",
  "sub_persona": "Retiree",
  "details": "#### Primary Objective:\nRetrieve all information pertinent to managing retirement finances, healthcare, leisure activities, legal affairs, and community engagement for an individual citizen.\n\n#### Core Information to Retrieve:\n-   **Financial Planning & Benefits:** Social Security statements, pension plan documents, 401k/IRA withdrawal rules, Medicare/Medicaid information, investment portfolio summaries, budgeting templates, senior discounts, property tax relief programs.\n-   **Healthcare & Medical:** Health insurance plan details (Medicare Advantage, Medigap), prescription drug coverage (Part D), doctor appointment schedules, medical bills, long-term care insurance policies, wellness program information, local clinic/hospital directories.\n-   **Legal & Estate Planning:** Will and trust documents, power of attorney forms, advance directives, beneficiary designations, probate information, guardianship details, elder law resources.\n-   **Housing & Living:** Reverse mortgage information, senior living facility brochures (assisted living, independent living), home maintenance services, accessible housing options, property deeds.\n-   **Leisure & Community Engagement:** Senior center activity schedules, volunteer opportunities, travel deals for seniors, hobby group meeting times, community event calendars, adult education course catalogs.\n-   **Safety & Security:** Fraud prevention tips (especially scams targeting seniors), emergency contact lists, home security system information, local law enforcement non-emergency numbers.\n-   **Transportation:** Senior public transport discounts, paratransit services, driver's license renewal rules for seniors.\n\n#### Information to Ignore (Noise):\n-   Entry-level job postings or career advancement training materials.\n-   K-12 school enrollment forms or curriculum guides.\n-   Student loan applications or college admissions criteria.\n-   Childcare service advertisements or parenting guides.\n-   Aggressive or high-risk investment product marketing.\n-   Technical specifications for industrial machinery or complex IT systems.\n-   Young adult lifestyle content (e.g., nightlife guides, fashion trends for youth)."
}