{
  "main_persona": "Individual / Citizen",
  "sub_persona": "New Immigrant/Expat",
  "details": "#### Primary Objective:\nRetrieve essential information regarding immigration processes, legal requirements, housing, employment, healthcare, and community integration to facilitate a smooth transition into a new country.\n\n#### Core Information to Retrieve:\n-   **Immigration & Legal Status:** Keywords like \"visa application,\" \"residency permit,\" \"work permit,\" \"citizenship,\" \"naturalization,\" \"asylum,\" \"immigration lawyer,\" \"sponsorship.\"\n-   **Government Identification:** Procedures for obtaining a \"driver's license,\" \"social security number (SSN),\" \"tax identification number (TIN),\" or other national ID cards.\n-   **Housing:** Information on \"renting an apartment,\" \"lease agreements,\" \"tenant rights,\" \"utility setup\" (gas, electric, water, internet), and \"mortgage applications.\"\n-   **Finance & Banking:** Guides on \"opening a bank account,\" \"transferring money internationally,\" \"building credit history,\" \"credit score,\" and \"filing taxes\" for the first time.\n-   **Healthcare System:** Explanations of \"public vs. private healthcare,\" \"health insurance,\" how to \"find a doctor\" or \"general practitioner (GP),\" and emergency service numbers (e.g., 911, 112, 999).\n-   **Employment:** Information on \"job searching,\" \"resume/CV format,\" \"workplace rights,\" \"employment contracts,\" and \"foreign credential recognition.\"\n-   **Education:** Details on \"school registration\" for children, \"public vs. private schools,\" and \"adult education\" or \"language classes\" (e.g., ESL).\n-   **Transportation:** Guides to \"public transport,\" \"buying a car,\" \"car insurance,\" and rules of the road.\n-   **Community & Integration:** Contact information for \"expat groups,\" \"community centers,\" \"cultural associations,\" \"places of worship,\" and local government services.\n\n#### Information to Ignore (Noise):\n-   Deeply historical documents about the country's founding.\n-   High-level political analysis or international diplomacy reports.\n-   Tourist-focused information like short-term hotel deals, tour packages, or sightseeing brochures.\n-   Complex financial market analysis, stock reports, and corporate earnings calls.\n-   Academic or scientific research papers unrelated to social integration or health services.\n-   Luxury product advertisements and high-end retail marketing.\n-   Hyper-local news that isn't relevant to essential services (e.g., local school sports results, minor traffic incidents on irrelevant routes)."
}