{
  "main_persona": "Individual / Citizen",
  "sub_persona": "Parent/Guardian",
  "details": "#### Primary Objective:\nRetrieve all practical information concerning a child's education, health, activities, and general family management.\n\n#### Core Information to Retrieve:\n-   **School & Education:**\n    -   School calendars, holiday schedules, teacher workdays.\n    -   Class schedules, bell schedules, supply lists.\n    -   Homework assignments, project due dates, reading lists.\n    -   Report cards, progress reports, test scores.\n    -   Permission slips for field trips or activities.\n    -   Contact information for teachers, principals, and school staff.\n    -   Announcements for Parent-Teacher conferences, PTA/PTO meetings, and school events (e.g., bake sales, book fairs).\n    -   School policies on attendance, dress code, or behavior.\n-   **Health & Wellness:**\n    -   Appointment dates and times (doctor, dentist, orthodontist).\n    -   Vaccination and immunization records.\n    -   Medical forms, sports physical forms, consent for treatment forms.\n    -   Allergy information and action plans.\n    -   Contact information for pediatricians, dentists, and specialists.\n    -   Health insurance policy numbers and contact information.\n-   **Extracurricular Activities:**\n    -   Schedules for sports practices and games.\n    -   Schedules for music, dance, or art lessons.\n    -   Team rosters and coach contact information.\n    -   Invitations to birthday parties, playdates, or social events.\n    -   Information on summer camps, community classes, and library programs.\n-   **Household Management:**\n    -   Emergency contact lists.\n    -   Contact information for babysitters or childcare providers.\n    -   User manuals for children's products or toys.\n    -   Receipts or registration forms for childcare, camps, or activities.\n\n#### Information to Ignore (Noise):\n-   Abstract academic research or university-level studies.\n-   Corporate financial reports, stock market analysis, or business-to-business marketing materials.\n-   Highly technical schematics or engineering documents.\n-   Internal administrative documents from a school or organization not intended for parents (e.g., internal staff memos, detailed budget allocations).\n-   Political campaign literature or polling data.\n-   Jargon-heavy legal or financial documents unrelated to household management.\n-   Alumni newsletters or fundraising campaigns from institutions with no family connection."
}