{
  "main_persona": "Individual / Citizen",
  "sub_persona": "Freelancer/Gig Worker",
  "details": "#### Primary Objective:\nRetrieve all actionable information related to securing new projects, managing client relationships, handling finances and taxes, and understanding legal obligations specific to freelance work.\n\n#### Core Information to Retrieve:\n-   **Contracts and Agreements:** Phrases like \"freelance agreement,\" \"independent contractor agreement,\" \"scope of work (SOW),\" \"deliverables,\" \"terms and conditions,\" \"non-disclosure agreement (NDA),\" \"intellectual property rights.\"\n-   **Financial and Tax Documents:** Keywords such as \"invoice,\" \"Form 1099-NEC,\" \"Form W-9,\" \"quarterly estimated tax,\" \"self-employment tax,\" \"business expenses,\" \"deductions,\" \"receipts.\"\n-   **Project Opportunities:** Phrases like \"request for proposal (RFP),\" \"call for freelancers,\" \"gig available,\" \"project brief,\" \"job posting,\" \"scope of work.\"\n-   **Client Communication:** Contact information (email, phone), meeting notes, project feedback, change requests, project timelines.\n-   **Invoicing and Payments:** Payment terms (e.g., \"Net 30,\" \"upon receipt\"), bank transfer details, payment confirmations, project rates, hourly rates, late fees.\n-   **Professional Development:** Information on workshops, certifications, online courses, industry trend reports, webinars relevant to their field.\n-   **Business Tools:** Recommendations or discussions of software for time tracking, project management (e.g., Asana, Trello), invoicing (e.g., FreshBooks, Wave), or client management (CRM).\n\n#### Information to Ignore (Noise):\n-   Internal corporate documents for W-2 employees (e.g., employee handbooks, 401k plans, PTO policies, performance reviews).\n-   Company-wide announcements or memos from clients not directly related to a project.\n-   General marketing spam and unsolicited sales pitches.\n-   Highly technical or academic research outside of the freelancer's professional domain.\n-   Personal, non-business-related documents (e.g., utility bills for a non-home office, personal correspondence, vacation planning).\n-   Corporate annual reports or shareholder information for client companies."
}