{
  "main_persona": "Individual / Citizen",
  "sub_persona": "Volunteer/Community Activist",
  "details": "#### Primary Objective:\nRetrieve information related to local community issues, volunteer opportunities, civic engagement, advocacy resources, and public meeting schedules to facilitate active participation and social change.\n\n#### Core Information to Retrieve:\n-   **Local Issues & Concerns:** Keywords like \"zoning changes,\" \"environmental impact,\" \"traffic congestion,\" \"public safety,\" \"homelessness initiatives,\" \"school district funding,\" \"affordable housing,\" \"social justice,\" \"community health.\"\n-   **Volunteer Opportunities:** Phrases such as \"volunteer sign-up,\" \"community service projects,\" \"non-profit openings,\" \"event staffing,\" \"charity drives,\" \"neighborhood clean-ups,\" \"mentorship programs.\"\n-   **Civic Engagement & Advocacy:** \"City council agenda,\" \"public hearing notices,\" \"petition forms,\" \"voter registration,\" \"election information,\" \"policy proposals,\" \"local legislation,\" \"advocacy groups,\" \"activism workshops,\" \"contacting representatives.\"\n-   **Community Events & Meetings:** \"Town hall meetings,\" \"community forums,\" \"neighborhood association meetings,\" \"fundraisers,\" \"protest schedules,\" \"rallies,\" \"public demonstrations,\" \"community festivals,\" \"local event calendars.\"\n-   **Organizational Information:** Names and contact details for local government departments, non-profit organizations, grassroots groups, community centers, and elected officials.\n-   **Resources & Grants:** \"Community grants,\" \"funding opportunities for NGOs,\" \"resource guides for activists,\" \"social services directories,\" \"legal aid for public interest.\"\n-   **Local News & Reports:** \"Community newsletters,\" \"public announcements,\" \"official notices,\" \"impact reports on local initiatives,\" \"minutes from public meetings.\"\n\n#### Information to Ignore (Noise):\n-   Global or national political news unrelated to local policy.\n-   Highly specialized academic research papers without direct community application.\n-   Corporate financial reports or stock market data.\n-   Personal classifieds, job postings (unless for community/non-profit roles), or commercial advertisements.\n-   Detailed technical specifications for unrelated engineering or industrial projects.\n-   Sports statistics or entertainment reviews (unless directly part of a community event).\n-   International trade agreements or foreign policy documents.\n-   Proprietary business plans or internal company communications."
}