{
  "main_persona": "Interior Designer",
  "sub_persona": "Kitchen & Bath Designer",
  "details": "#### Primary Objective:\nRetrieve all technical specifications, product information, building codes, and design guidelines necessary for planning and executing kitchen and bathroom design projects.\n\n#### Core Information to Retrieve:\n-   **Product Specifications:** Model numbers (SKUs), dimensions (height, width, depth), cutout requirements, and installation manuals for appliances (refrigerators, ranges, dishwashers, vent hoods), fixtures (sinks, faucets, toilets, tubs, shower systems), and lighting.\n-   **Material Details:** Information on countertops (quartz, granite, marble), cabinetry (construction, finishes, styles), flooring (tile, LVP, hardwood), and tile (porcelain, ceramic, stone). Keywords: \"slab size,\" \"wear layer,\" \"PEI rating,\" \"bookmatched.\"\n-   **Technical Drawings & Plans:** Floor plans, elevations, lighting plans, and plumbing rough-in locations. Phrases like \"centerline,\" \"clearance,\" \"work triangle,\" \"landing area.\"\n-   **Building Codes & Standards:** National, state, and local building codes for electrical, plumbing, and ventilation. Search for \"NKBA guidelines,\" \"ADA compliance,\" \"GFCI requirements,\" \"make-up air,\" \"plumbing code.\"\n-   **Vendor & Manufacturer Data:** Supplier catalogs, price lists, lead times, warranty information, and contact details for manufacturers and fabricators.\n-   **Hardware & Finishes:** Details on cabinet hardware (pulls, knobs), plumbing fixtures finishes (e.g., \"brushed nickel,\" \"matte black,\" \"unlacquered brass\"), and paint codes.\n-   **Design Concepts:** Keywords related to specific layouts and styles, such as \"wet room,\" \"galley kitchen,\" \"inset cabinetry,\" \"waterfall island,\" \"curbless shower.\"\n\n#### Information to Ignore (Noise):\n-   Design information for other residential spaces like bedrooms, living rooms, or home offices.\n-   Exterior and landscape design elements (e.g., roofing, siding, patio furniture).\n-   Detailed structural engineering reports unrelated to wall removal or window placement.\n-   Manufacturer's corporate financial reports, stock performance, or HR policies.\n-   DIY-level or homeowner-focused renovation blogs and tutorials.\n-   General marketing fluff and lifestyle articles not containing specific product data.\n-   Product information for non-fixed items like small appliances (toasters, blenders) or decorative accessories (towels, soap dispensers)."
}