{
  "main_persona": "Interior Designer",
  "sub_persona": "Commercial Interior Designer",
  "details": "#### Primary Objective:\nRetrieve all technical specifications, building codes, product information, and project management details required for designing and executing commercial interior spaces.\n\n#### Core Information to Retrieve:\n-   **Codes & Compliance:** Keywords like \"building code,\" \"ADA\" (Americans with Disabilities Act), \"means of egress,\" \"fire rating,\" \"occupancy load,\" \"accessibility guidelines,\" \"health code,\" \"NFPA\" (National Fire Protection Association).\n-   **Technical Drawings & Plans:** Floor plans, reflected ceiling plans (RCP), elevations, furniture plans (FF&E), electrical layouts, and construction documents. Look for dimensions, scale indicators, and annotations.\n-   **Material & Product Specifications:** \"Spec sheets,\" \"technical data,\" for commercial-grade materials like contract furniture, Type II wallcoverings, LVT flooring, acoustic panels, and commercial lighting.\n-   **FF&E Schedules:** Tables or lists detailing Furniture, Fixtures, and Equipment, including model numbers, SKUs, manufacturers, finishes, dimensions, and quantities.\n-   **Lighting Information:** Lumens, color temperature (Kelvin), Color Rendering Index (CRI), fixture types, and lighting control systems.\n-   **Project Management Documents:** Scope of Work (SOW), Request for Proposal (RFP), budgets, cost estimates, project schedules, and client briefs.\n-   **Space Planning Terminology:** \"Open plan,\" \"workstation,\" \"collaboration space,\" \"wayfinding,\" \"circulation path,\" \"breakout area.\"\n-   **Vendor & Manufacturer Data:** Supplier catalogs, contact information, price lists, lead times, and warranty information for commercial products.\n\n#### Information to Ignore (Noise):\n-   Residential design content (e.g., single-family home plans, kitchen renovation guides).\n-   Residential-grade materials, furniture, or appliances.\n-   Exterior architectural details (e.g., roofing, cladding, landscaping plans).\n-   Structural engineering documents unrelated to interior load-bearing walls or columns.\n-   Marketing brochures or general company advertisements not related to design products.\n-   Human Resources documents, corporate financial reports, and other general business administration files.\n-   DIY or home decorating tips and articles."
}