{
  "main_persona": "Interior Designer",
  "sub_persona": "Home Stager",
  "details": "#### Primary Objective:\nRetrieve actionable advice, design principles, and best practices for arranging and decorating a property to maximize its appeal to potential buyers and facilitate a quick sale.\n\n#### Core Information to Retrieve:\n-   **Staging Principles & Checklists:** Keywords like \"home staging,\" \"property styling,\" \"staging checklist,\" \"room-by-room guide,\" \"curb appeal.\"\n-   **Depersonalization & Decluttering:** Phrases such as \"depersonalize your space,\" \"decluttering tips,\" \"creating a blank canvas,\" \"storage solutions.\"\n-   **Color Palettes:** Search for \"neutral paint colors,\" \"staging color palette,\" \"greige,\" \"off-white,\" \"accent color,\" \"color psychology in sales.\"\n-   **Furniture & Layout:** Terms like \"furniture arrangement,\" \"creating flow,\" \"defining zones,\" \"focal point,\" \"scaling furniture,\" \"rental furniture.\"\n-   **Lighting:** Concepts such as \"layered lighting,\" \"maximizing natural light,\" \"lumens,\" \"warm vs. cool light,\" \"light fixture updates.\"\n-   **Accessorizing & Decor:** Keywords including \"vignettes,\" \"art placement,\" \"throw pillows,\" \"area rugs,\" \"minimalist decor,\" \"textiles,\" \"styling bookshelves.\"\n-   **Target Market Analysis:** Phrases like \"appeal to the broadest audience,\" \"target buyer,\" \"lifestyle merchandising.\"\n-   **Return on Investment (ROI):** Search for \"ROI of staging,\" \"cost vs. value report,\" \"impact of staging on sale price,\" \"staging statistics.\"\n-   **Quick Fixes:** Terms like \"quick updates,\" \"hardware replacement,\" \"paint recommendations,\" \"minor cosmetic repairs.\"\n\n#### Information to Ignore (Noise):\n-   Long-term, personalized interior design projects for a specific client's taste.\n-   Structural or architectural plans (e.g., blueprints, electrical schematics, plumbing diagrams).\n-   Major renovation or construction guides that go beyond cosmetic updates.\n-   Real estate legal documents (e.g., purchase agreements, title deeds, escrow information).\n-   Detailed property appraisal reports or tax records.\n-   Appliance user manuals or warranty information.\n-   Information on highly personal or niche decor styles (e.g., \"gothic,\" \"bohemian maximalism\").\n-   Building codes, zoning laws, and permit applications."
}