{
  "main_persona": "Interior Designer",
  "sub_persona": "Renovation & Remodel Designer",
  "details": "#### Primary Objective:\nRetrieve all technical specifications, design elements, and project management details relevant to planning and executing interior renovation and remodeling projects.\n\n#### Core Information to Retrieve:\n-   **Drawings & Plans:** As-built drawings, floor plans, demolition plans, construction documents, lighting plans, electrical layouts, plumbing diagrams, and reflected ceiling plans (RCPs).\n-   **Structural Information:** Keywords like \"load-bearing wall,\" \"non-load-bearing,\" \"header,\" \"beam,\" \"joist,\" \"foundation,\" and \"structural engineer report.\"\n-   **Schedules & Specifications:** Finish schedules, door schedules, window schedules, hardware specifications, and appliance spec sheets (including model numbers and cutout dimensions).\n-   **Materials & Finishes:** Specific material names (e.g., \"Carrara marble,\" \"white oak flooring\"), product SKUs, paint colors/codes, tile types, grout colors, and countertop material specifications.\n-   **Cabinetry & Millwork:** Shop drawings, elevation views, details for custom built-ins, cabinetry layouts, and hardware types.\n-   **Dimensions & Measurements:** Specific room dimensions, ceiling heights, window/door opening sizes, and square footage calculations.\n-   **Codes & Permits:** Mentions of \"building code,\" \"permit application,\" \"ADA compliance,\" \"egress requirements,\" and \"fire rating.\"\n-   **Project Management:** Phrases like \"scope of work (SOW),\" \"change order,\" \"request for information (RFI),\" \"project budget,\" \"timeline,\" \"vendor list,\" and \"contractor contact info.\"\n\n#### Information to Ignore (Noise):\n-   Exterior-only information such as landscaping plans, property line surveys, roofing details, and siding specifications.\n-   Original real estate listings or marketing brochures for the property.\n-   Developer or corporate financial reports, shareholder information, and market analysis.\n-   Homeowner association (HOA) meeting minutes, unless they specifically discuss architectural review approvals.\n-   User manuals for small, non-integrated electronics or personal items.\n-   Historical narratives about the property or neighborhood that do not pertain to historic preservation requirements."
}