{
  "main_persona": "Interior Designer",
  "sub_persona": "Luxury Interior Designer",
  "details": "#### Primary Objective:\nRetrieve information on high-end materials, bespoke furnishings, exclusive suppliers, and inspirational luxury projects to design opulent and customized interiors.\n\n#### Core Information to Retrieve:\n-   **High-End Brands & Designers:** Specific names like \"Kelly Wearstler,\" \"Jean-Louis Deniot,\" \"B&B Italia,\" \"Minotti,\" \"Poliform,\" \"Fendi Casa,\" \"Ligne Roset,\" \"Cassina,\" \"Waterworks,\" \"Sub-Zero,\" \"Wolf,\" \"La Cornue.\"\n-   **Luxury Materials & Finishes:** \"Bookmatched marble,\" \"Calacatta gold,\" \"quartzite countertops,\" \"exotic woods,\" \"unlacquered brass,\" \"bronze fixtures,\" \"Venetian plaster,\" \"artisanal tile,\" \"hand-scraped wood floors,\" \"leathered granite.\"\n-   **Bespoke & Custom Elements:** Phrases like \"custom millwork,\" \"bespoke cabinetry,\" \"custom furniture,\" \"hand-knotted rugs,\" \"artisan-made,\" \"custom fabrication.\"\n-   **High-End Textiles:** \"Bouclé,\" \"performance velvet,\" \"mohair,\" \"cashmere,\" \"high-grade leather,\" \"designer wallpaper,\" \"grasscloth.\"\n-   **Lighting & Fixtures:** \"Statement chandelier,\" \"sculptural lighting,\" \"art glass,\" \"designer sconces,\" \"architectural lighting,\" \"freestanding tub.\"\n-   **Furniture, Fixtures, and Equipment (FF&E):** \"FF&E schedule,\" \"specification sheets,\" \"spec sheets,\" product SKUs from luxury vendors.\n-   **Art & Antiques:** \"Art curation,\" \"gallery contacts,\" \"antique sourcing,\" \"collectible design,\" \"limited edition pieces.\"\n-   **Suppliers & Showrooms:** \"Trade-only showroom,\" \"to the trade,\" \"specialty vendor,\" \"artisan contact,\" \"fabricator quotes.\"\n-   **Technical Documents:** \"Floor plans,\" \"renderings,\" \"elevations,\" \"space planning,\" \"lighting plans,\" \"client proposals,\" \"budgets,\" \"invoices.\"\n\n#### Information to Ignore (Noise):\n-   Budget-focused terms: \"DIY,\" \"affordable,\" \"budget-friendly,\" \"look for less,\" \"on sale,\" \"clearance.\"\n-   Mass-market retailers: \"IKEA,\" \"Wayfair,\" \"Target,\" \"Home Depot,\" \"Lowe's.\"\n-   Low-end materials: \"Laminate,\" \"vinyl flooring,\" \"MDF,\" \"particle board,\" \"melamine.\"\n-   General real estate listings or market reports.\n-   Generic product installation manuals (unless for a specified luxury appliance).\n-   Company financial reports or HR documents.\n-   Basic tutorials for general interior design (e.g., \"How to choose a paint color\")."
}