{
  "main_persona": "Interior Designer",
  "sub_persona": "Workplace Interior Designer",
  "details": "#### Primary Objective:\nRetrieve all specifications, guidelines, and product information required for planning and executing commercial office interior design projects.\n\n#### Core Information to Retrieve:\n-   **Codes & Standards:** Keywords like \"ADA\" (Americans with Disabilities Act), \"building code,\" \"fire code,\" \"egress requirements,\" \"LEED,\" \"WELL Building Standard,\" \"BIFMA.\"\n-   **Furniture, Fixtures & Equipment (FF&E):** Product specifications for systems furniture, workstations, task chairs, conference tables, and ancillary/lounge furniture. Manufacturer names like Herman Miller, Steelcase, Knoll, Haworth.\n-   **Materials & Finishes:** Specifications for commercial-grade materials such as carpet tile, LVT flooring, acoustic panels, wallcoverings, low-VOC paint, and laminate. Look for metrics like \"LRV\" (Light Reflectance Value) and fire ratings.\n-   **Space Planning & Layouts:** Floor plans, test fits, adjacency matrices, and programming documents. Phrases like \"open office,\" \"private office,\" \"collaboration space,\" \"huddle room,\" \"wellness room,\" \"activity-based working.\"\n-   **Lighting Information:** Luminaire specifications (recessed, pendant, linear), lighting layouts, reflected ceiling plans (RCP), and technical data such as \"lumens,\" \"Kelvin temperature,\" and \"CRI\" (Color Rendering Index).\n-   **Acoustics:** Data related to sound control, including \"STC\" (Sound Transmission Class) and \"NRC\" (Noise Reduction Coefficient) ratings for partitions, ceiling tiles, and panels.\n-   **Technical Drawings & Details:** Millwork details, construction details, power/data plans, and MEP (Mechanical, Electrical, Plumbing) coordination documents.\n-   **Budget & Schedules:** Project timelines, FF&E budgets, installation schedules, and product lead times.\n\n#### Information to Ignore (Noise):\n-   Residential design content (e.g., bedroom furniture, kitchen appliances, home decor).\n-   Retail design elements (e.g., storefronts, merchandising displays, point-of-sale counters).\n-   Hospitality-specific design (e.g., hotel guest room layouts, public restaurant design).\n-   Corporate financial reports, stock performance, or annual summaries.\n-   Human Resources documents like employee benefit packages or internal memos not related to space use.\n-   Exterior architectural details, landscaping plans, or civil engineering site plans.\n-   General marketing brochures or advertising campaigns for the client company."
}