{
  "main_persona": "IT Manager",
  "sub_persona": "Network Manager",
  "details": "#### Primary Objective:\nRetrieve all technical specifications, configuration details, performance metrics, security alerts, and administrative procedures related to the organization's network infrastructure.\n\n#### Core Information to Retrieve:\n-   **Network Hardware:** Model numbers (e.g., \"Cisco 9300\", \"PA-440\"), device types (router, switch, firewall, access point, load balancer), vendor names (Cisco, Juniper, Aruba, Palo Alto, Fortinet), serial numbers, asset tags.\n-   **Network Topology & Diagrams:** Network maps, physical and logical diagrams, IP address schemas, VLAN assignments, data center layouts.\n-   **Configuration & Protocols:** IP addresses, subnet masks, default gateways, routing protocols (BGP, OSPF), VLANs, ACLs (Access Control Lists), NAT (Network Address Translation) rules, DHCP scopes, DNS records.\n-   **Performance Metrics:** Keywords like \"latency,\" \"jitter,\" \"packet loss,\" \"bandwidth utilization,\" \"throughput,\" \"error rate.\" Data from monitoring tools like SNMP, NetFlow, and sFlow.\n-   **Security Information:** Firewall logs, IDS/IPS alerts, \"vulnerability scan\" results, port security configurations, VPN tunnel status, phrases like \"unauthorized access,\" \"denial of service,\" \"security incident report.\"\n-   **Wireless Networking:** SSIDs, Wi-Fi passwords, RADIUS server configuration, wireless controller settings, 802.1x authentication details.\n-   **Administrative Data:** Standard Operating Procedures (SOPs), change management requests, support contract numbers, vendor contact information, maintenance window schedules, hardware End-of-Life (EoL) and End-of-Support (EoS) dates.\n-   **Troubleshooting Logs:** Syslog messages, device console output, command outputs (e.g., \"show interface,\" \"ping,\" \"traceroute\").\n\n#### Information to Ignore (Noise):\n-   End-user helpdesk tickets (e.g., \"password reset,\" \"cannot print\").\n-   Application development documentation, source code, or database schemas.\n-   Server-specific performance metrics like CPU load or RAM usage (unless on a network appliance).\n-   General human resources documents, departmental budgets (unless it's the IT/Network budget), and marketing materials.\n-   Physical building management information (e.g., HVAC reports, office floor plans).\n-   Sales reports and customer relationship management (CRM) data."
}