{
  "main_persona": "IT Manager",
  "sub_persona": "IT Service Delivery Manager",
  "details": "#### Primary Objective:\nRetrieve all information related to IT service performance, operational processes, user support, and service level agreements to ensure effective and reliable delivery of IT services.\n\n#### Core Information to Retrieve:\n-   **Service Level Agreements (SLAs):** Documents defining SLAs, Operational Level Agreements (OLAs), and Underpinning Contracts (UCs).\n-   **Performance Metrics & KPIs:** Phrases like \"uptime,\" \"downtime,\" \"availability,\" \"Mean Time To Resolution\" (MTTR), \"Mean Time Between Failures\" (MTBF), \"First Call Resolution\" (FCR).\n-   **Incident & Problem Management:** Keywords such as \"major incident report,\" \"Root Cause Analysis\" (RCA), \"post-incident review,\" \"ticket volume,\" \"escalation procedures,\" \"P1/P2/P3 incidents.\"\n-   **Change Management:** Information on \"Change Advisory Board\" (CAB) meetings, \"Request for Change\" (RFC) documents, \"change calendar,\" \"maintenance window.\"\n-   **Reporting:** Service performance reports, weekly/monthly operational reviews, dashboard screenshots, availability reports, customer satisfaction (CSAT) scores.\n-   **ITIL Processes:** Documents related to \"Incident Management,\" \"Problem Management,\" \"Change Management,\" \"Service Request Management,\" and \"Service Level Management.\"\n-   **Service Desk/Help Desk:** Ticket data, support team rosters, on-call schedules, support tier definitions (L1, L2, L3), knowledge base articles.\n-   **Service Catalog:** Lists and descriptions of available IT services offered to the business.\n-   **Customer & Stakeholder Communication:** Service outage notifications, maintenance announcements, user feedback surveys, service review meeting minutes.\n\n#### Information to Ignore (Noise):\n-   Detailed source code, code commits, and software development sprint plans.\n-   Raw server logs, network packet captures, or deep-dive technical diagnostics.\n-   Hardware procurement invoices and detailed vendor price negotiations.\n-   Corporate-wide financial statements (e.g., P&L, balance sheets) not related to IT service costing.\n-   Individual employee performance reviews or general HR policies.\n-   Marketing materials, sales forecasts, and non-IT business unit reports.\n-   Detailed project plans (Gantt charts) for projects not yet in production/operation."
}