{
  "main_persona": "IT Manager",
  "sub_persona": "IT Project Manager",
  "details": "#### Primary Objective:\nRetrieve all documents and data related to project plans, timelines, budgets, resource allocation, risk management, and stakeholder communication for IT projects.\n\n#### Core Information to Retrieve:\n-   **Project Planning Documents:** Keywords like \"Project Charter,\" \"Statement of Work (SOW),\" \"Project Plan,\" \"Work Breakdown Structure (WBS),\" \"Scope Definition.\"\n-   **Schedules and Timelines:** Gantt charts, project timelines, milestone dates, sprint schedules, release plans, and terms like \"critical path,\" \"deadline,\" \"phase gate.\"\n-   **Budget and Financial Data:** Cost estimates, budget approvals, expense tracking spreadsheets, purchase orders, and keywords like \"budget,\" \"forecast,\" \"variance,\" \"ROI,\" \"capital expenditure (CapEx),\" \"operational expenditure (OpEx).\"\n-   **Resource Management:** Team rosters, RACI charts (Responsible, Accountable, Consulted, Informed), resource allocation plans, vendor contracts, Service Level Agreements (SLAs).\n-   **Risk and Issue Tracking:** Risk registers, issue logs, mitigation plans, dependency lists, and change request forms.\n-   **Communication and Reporting:** Meeting minutes (especially for \"Steering Committee\" or \"Project Kickoff\"), status reports, stakeholder communication plans, executive summaries, project dashboards.\n-   **Technical Requirements:** High-level system architecture diagrams, functional requirements documents, non-functional requirements, security compliance checklists.\n-   **Methodology Terms:** References to specific methodologies like \"Agile,\" \"Scrum,\" \"Kanban,\" \"Waterfall,\" and related terms such as \"user story,\" \"backlog,\" \"sprint,\" \"velocity.\"\n\n#### Information to Ignore (Noise):\n-   Detailed technical source code, commit logs, and pull requests.\n-   Low-level system logs, error reports, and server performance metrics.\n-   Individual employee performance reviews or general HR policy documents.\n-   Company-wide marketing materials, press releases, and sales reports.\n-   End-user support tickets and routine help desk requests.\n-   Generic IT security alerts not specific to a project's technology stack.\n-   Catering invoices or documents related to general office management."
}