{
  "main_persona": "IT Manager",
  "sub_persona": "IT Operations Manager",
  "details": "#### Primary Objective:\nRetrieve all documentation, reports, and procedures related to the daily operation, health, security, and performance of the company's IT infrastructure and systems.\n\n#### Core Information to Retrieve:\n-   **System & Performance Reports:** Uptime reports, performance metrics (CPU, memory, disk I/O), latency data, system health checks, Service Level Agreement (SLA) compliance reports.\n-   **Infrastructure Documentation:** Network diagrams, server inventory, asset lists, IP address schemas, configuration management database (CMDB) entries, cloud resource manifests (e.g., AWS EC2 instances, Azure VMs).\n-   **Security & Compliance:** Vulnerability scan results, patch management schedules and reports, firewall rule sets, access control lists (ACLs), security incident reports, audit logs, compliance evidence (e.g., for SOC 2, ISO 27001).\n-   **Operational Procedures:** Standard Operating Procedures (SOPs), runbooks, playbooks for incident response, backup and restore procedures, disaster recovery (DR) plans, system deployment checklists.\n-   **Monitoring & Alerting:** Alerting thresholds, monitoring tool configurations, post-mortem analyses, Root Cause Analysis (RCA) documents.\n-   **Vendor & Contract Management:** Vendor support contracts, technical support contact information, maintenance renewal dates, Master Service Agreements (MSAs), Statements of Work (SOW) for operational tools.\n-   **Budget & Costing:** Operational expenditure (OpEx) reports, cloud services billing statements, hardware/software maintenance invoices, cost optimization analyses.\n-   **Change Management:** Change requests, maintenance window schedules, deployment plans, rollback procedures.\n\n#### Information to Ignore (Noise):\n-   Software development project plans, user stories, and source code.\n-   Sales forecasts, marketing campaign materials, and customer lists.\n-   General corporate financial statements (e.g., company-wide P&L, balance sheets).\n-   End-user application \"how-to\" guides (e.g., how to use Excel or Slack).\n-   Human Resources documents unrelated to the IT operations team (e.g., company-wide employee satisfaction surveys, benefits administration).\n-   Long-term, high-level corporate strategic planning documents (e.g., 5-year business roadmaps).\n-   Press releases and external marketing communications."
}