{
  "main_persona": "IT Manager",
  "sub_persona": "Cloud Operations Manager",
  "details": "#### Primary Objective:\nRetrieve all operational data, security alerts, cost reports, and technical documentation required to manage and optimize the company's cloud services.\n\n#### Core Information to Retrieve:\n-   **Performance & Monitoring Data:** Metrics like \"CPU utilization,\" \"memory usage,\" \"disk I/O,\" \"network latency,\" \"uptime/downtime,\" and \"application response time.\"\n-   **Cloud Service Status:** Keywords like \"service health,\" \"outage,\" \"incident report,\" \"root cause analysis (RCA),\" and status updates for specific services (e.g., \"AWS EC2 status,\" \"Azure Storage availability\").\n-   **Cost & Billing Information:** Reports containing phrases like \"monthly invoice,\" \"cost breakdown by service,\" \"cost allocation,\" \"tags,\" \"budget alert,\" \"reserved instances,\" and \"savings plan recommendations.\"\n-   **Security & Compliance Reports:** Terms like \"security alert,\" \"vulnerability scan,\" \"penetration test results,\" \"IAM policy,\" \"security group rule,\" \"firewall logs,\" \"audit trail,\" and compliance keywords (e.g., \"SOC 2,\" \"HIPAA,\" \"GDPR\").\n-   **Automation & Deployment Artifacts:** CI/CD pipeline logs (\"build successful,\" \"deployment failed\"), Infrastructure as Code (IaC) files (Terraform, CloudFormation), configuration management scripts (Ansible, Puppet), and runbooks/playbooks for incident response.\n-   **Backup & Disaster Recovery:** Information on \"backup jobs,\" \"restore points,\" \"recovery time objective (RTO),\" \"recovery point objective (RPO),\" and disaster recovery test results.\n-   **Technical Architecture Documents:** Diagrams and documentation describing \"network topology,\" \"VPC layout,\" \"subnet configuration,\" \"load balancer setup,\" and system interdependencies.\n-   **Vendor Communication:** Technical bulletins, service update notifications, security advisories, and pricing changes from cloud providers (AWS, Azure, GCP).\n\n#### Information to Ignore (Noise):\n-   General corporate financial reports (e.g., quarterly earnings, stock performance).\n-   Marketing materials, sales figures, and customer relationship management (CRM) data.\n-   Human Resources documents like employee performance reviews, company-wide announcements, or benefits information (unless pertaining to the Cloud Ops team).\n-   End-user application bug reports that are not related to underlying infrastructure performance.\n-   Detailed application-level source code (except for Infrastructure as Code).\n-   Physical data center information (e.g., cooling, power, physical server hardware specifications).\n-   High-level business strategy documents that do not have direct infrastructure implications."
}