{
  "main_persona": "Job Applicant",
  "sub_persona": "Job Applicant",
  "details": "#### Primary Objective:\nRetrieve all relevant details about job opportunities, company information, application procedures, and interview preparation to support a successful job search.\n\n#### Core Information to Retrieve:\n-   **Job Descriptions:** Job titles (e.g., \"Software Engineer,\" \"Marketing Manager\"), position summaries, lists of \"responsibilities,\" \"duties,\" or \"qualifications.\"\n-   **Application Requirements:** Keywords like \"requirements,\" \"experience,\" \"education needed,\" \"skills,\" \"qualifications.\" Look for specific years of experience (e.g., \"5+ years\") and required degrees (e.g., \"Bachelor's degree\").\n-   **Application Instructions:** Phrases like \"how to apply,\" \"submit your resume,\" \"application deadline,\" \"apply online.\"\n-   **Compensation & Benefits:** Keywords such as \"salary range,\" \"compensation,\" \"pay scale,\" \"benefits,\" \"health insurance,\" \"401(k),\" \"paid time off (PTO).\"\n-   **Company Information:** \"About Us\" sections, company mission statements, \"our values,\" \"company culture.\"\n-   **Contact People:** Names and titles of potential contacts, such as \"Hiring Manager,\" \"Recruiter,\" \"Talent Acquisition,\" or department heads.\n-   **Location & Logistics:** Job location (city, state), \"remote,\" \"hybrid,\" or \"on-site\" work policies.\n-   **Interview Process:** Information describing interview stages, such as \"phone screen,\" \"technical interview,\" \"panel interview,\" or \"case study.\"\n\n#### Information to Ignore (Noise):\n-   Detailed financial reports (e.g., quarterly earnings reports, SEC filings).\n-   Product user manuals or highly technical product specifications not directly related to a job's duties.\n-   General press releases or news articles not related to hiring or company growth.\n-   Customer testimonials or product reviews.\n-   The full legal text of \"Terms of Service\" or \"Privacy Policy\" documents.\n-   Advertisements for the company's products or services.\n-   Internal company announcements irrelevant to an external applicant (e.g., cafeteria menus, minor office relocations)."
}