{
  "main_persona": "Job Applicant",
  "sub_persona": "Student/Intern Applicant",
  "details": "#### Primary Objective:\nRetrieve all information related to internship opportunities, entry-level job postings, application procedures, and company details relevant to a student or recent graduate.\n\n#### Core Information to Retrieve:\n-   **Keywords for Opportunities:** \"Internship,\" \"intern,\" \"co-op,\" \"entry-level,\" \"fellowship,\" \"new grad program,\" \"student program,\" \"summer analyst,\" \"rotational program.\"\n-   **Application Requirements:** Phrases like \"how to apply,\" \"application deadline,\" \"qualifications,\" \"requirements,\" \"GPA requirement,\" \"cover letter,\" \"resume,\" \"transcript,\" \"portfolio.\"\n-   **Recruiting & Events:** Information on \"career fairs,\" \"information sessions,\" \"recruiting events,\" \"campus recruitment,\" \"application open/close dates.\"\n-   **Company Culture & Benefits:** Terms like \"company culture,\" \"intern projects,\" \"mentorship,\" \"learning and development,\" \"career growth,\" \"company values,\" \"mission statement,\" \"housing stipend,\" \"relocation assistance.\"\n-   **Role Descriptions:** Specific job titles (e.g., \"Software Engineering Intern,\" \"Marketing Intern\"), lists of \"responsibilities,\" \"what you'll do,\" \"what you'll learn.\"\n-   **Contact Information:** Names and titles of \"recruiters,\" \"hiring managers,\" \"talent acquisition,\" or \"university relations\" personnel.\n\n#### Information to Ignore (Noise):\n-   Job postings requiring significant experience (e.g., \"5+ years of experience,\" \"Senior,\" \"Lead,\" \"Principal,\" \"Director\").\n-   Detailed internal financial reports, investor relations documents, and SEC filings.\n-   Highly technical product specifications or source code.\n-   Executive-level biographies and compensation details for senior leadership.\n-   Press releases unrelated to hiring, company culture, or new graduate programs.\n-   Internal employee policies not relevant to the application process."
}