{
  "main_persona": "Job Applicant",
  "sub_persona": "Executive/Senior Leader Applicant",
  "details": "#### Primary Objective:\nRetrieve high-level strategic, financial, and operational information to evaluate a company's health, culture, and market position for a senior leadership role.\n\n#### Core Information to Retrieve:\n-   **Corporate Strategy:** Phrases like \"strategic plan,\" \"mission statement,\" \"company vision,\" \"long-term goals,\" \"growth strategy,\" \"market expansion.\"\n-   **Financial Performance:** Annual reports, quarterly earnings reports (10-K, 10-Q), shareholder letters, revenue figures, profit margins, EBITDA, and stock performance summaries.\n-   **Leadership & Governance:** Names and biographies of the \"Board of Directors,\" \"C-suite,\" or \"Executive Leadership Team\"; organizational charts; corporate governance policies.\n-   **Market & Competitive Analysis:** \"Market share,\" \"competitive landscape,\" \"SWOT analysis,\" \"industry trends,\" major competitors' names.\n-   **Major Initiatives & News:** \"Press releases,\" \"mergers and acquisitions\" (M&A), \"new product launches,\" \"strategic partnerships,\" \"capital investments.\"\n-   **Culture & ESG:** \"Corporate culture,\" \"company values,\" \"diversity and inclusion reports,\" \"employee engagement\" summaries, \"Environmental, Social, and Governance (ESG)\" reports.\n-   **Operational Reports:** High-level summaries of business unit performance, annual operational reviews, supply chain overviews.\n\n#### Information to Ignore (Noise):\n-   Job descriptions for non-executive or entry-level positions.\n-   Low-level internal policies (e.g., travel expense forms, IT help desk guides).\n-   Product user manuals or customer-facing technical support documents.\n-   Marketing materials aimed at consumers (e.g., promotional flyers, social media campaigns).\n-   Daily or weekly internal team updates and meeting minutes.\n-   Raw, unprocessed data sets or detailed technical schematics.\n-   Campus recruiting information and internship program details."
}