{
  "main_persona": "Job Applicant",
  "sub_persona": "Return-to-Work Applicant",
  "details": "#### Primary Objective:\nRetrieve information about suitable job openings, company culture, professional development opportunities, and resources specifically designed to help an individual successfully re-enter the workforce after a career gap.\n\n#### Core Information to Retrieve:\n-   **Return-to-Work Programs:** Keywords like \"returnship,\" \"return to work,\" \"career re-entry,\" \"career relaunch,\" \"re-onboarding.\"\n-   **Job Descriptions:** Position titles, responsibilities, required qualifications, preferred skills, location (especially \"remote,\" \"hybrid\").\n-   **Company Culture & Flexibility:** Phrases like \"work-life balance,\" \"flexible schedule,\" \"parental leave,\" \"caregiver support,\" \"inclusive workplace,\" \"diversity and inclusion,\" \"employee resource groups (ERGs).\"\n-   **Professional Development:** Information on \"training programs,\" \"upskilling,\" \"reskilling,\" \"mentorship,\" \"professional development,\" \"certifications offered.\"\n-   **Application Guidance:** Tips or articles on addressing a \"career gap,\" \"resume gap,\" \"cover letter writing,\" \"interview preparation.\"\n-   **Company Values:** Sections titled \"About Us,\" \"Our Mission,\" \"Company Values,\" \"Life at [Company Name].\"\n-   **Benefits Information:** Details on \"health insurance,\" \"benefits package,\" \"retirement plans,\" \"401k,\" \"paid time off (PTO).\"\n\n#### Information to Ignore (Noise):\n-   Internship programs or roles explicitly labeled for \"new graduates\" or \"campus recruiting.\"\n-   Deeply technical documentation, schematics, or source code unless directly relevant to a specific technical role.\n-   Company financial reports, investor relations documents, and SEC filings.\n-   Press releases about product launches, marketing campaigns, or executive travel.\n-   Internal-only documents like cafeteria menus, low-level meeting minutes, or building maintenance notices.\n-   University research papers or academic studies."
}