{
  "main_persona": "Judge",
  "sub_persona": "Criminal Court Judge",
  "details": "#### Primary Objective:\nRetrieve all legal statutes, case precedents, procedural rules, and case-specific evidence relevant to adjudicating criminal court proceedings.\n\n#### Core Information to Retrieve:\n-   **Legal Codes and Statutes:** Phrases like \"Penal Code,\" \"Criminal Code,\" \"Statute,\" \"Section,\" specific crime names (e.g., \"burglary,\" \"assault,\" \"homicide\"), classifications like \"felony\" or \"misdemeanor.\"\n-   **Case Law and Precedent:** Citations (e.g., \"Miranda v. Arizona,\" \"384 U.S. 436\"), legal terms like \"holding,\" \"ruling,\" \"precedent,\" \"stare decisis,\" \"Court of Appeals,\" \"Supreme Court.\"\n-   **Procedural Rules:** \"Rules of Criminal Procedure,\" \"Rules of Evidence,\" \"motion to suppress,\" \"motion to dismiss,\" \"objection,\" \"hearsay,\" \"chain of custody,\" \"discovery.\"\n-   **Case Filings:** \"Indictment,\" \"complaint,\" \"information,\" \"arraignment documents,\" \"plea agreement,\" \"affidavit,\" \"warrant.\"\n-   **Evidence and Reports:** \"Police report,\" \"forensic report,\" \"toxicology analysis,\" \"expert witness testimony,\" \"exhibit list,\" \"witness statement,\" \"investigative summary.\"\n-   **Sentencing Information:** \"Sentencing guidelines,\" \"pre-sentence report,\" \"victim impact statement,\" \"aggravating factors,\" \"mitigating factors,\" \"recidivism.\"\n-   **Constitutional Law Terms:** \"Fourth Amendment,\" \"Fifth Amendment,\" \"Sixth Amendment,\" \"due process,\" \"unreasonable search and seizure,\" \"right to counsel,\" \"speedy trial.\"\n\n#### Information to Ignore (Noise):\n-   **Civil Law Matters:** Topics like \"contract disputes,\" \"torts,\" \"negligence,\" \"property law,\" \"landlord-tenant issues,\" \"lawsuit.\"\n-   **Family Law Cases:** Documents concerning \"divorce,\" \"child custody,\" \"alimony,\" \"adoption.\"\n-   **Administrative and Corporate Law:** \"SEC filings,\" \"bankruptcy proceedings,\" \"zoning regulations,\" \"mergers and acquisitions.\"\n-   **Media and Press Coverage:** News articles, press releases, public opinion polls, and journalist commentary about cases.\n-   **Internal Court Administrative Documents:** HR policies, judicial budget reports, IT procurement, general staff memos.\n-   **Redundant Procedural Notices:** Standard scheduling notices, duplicate filings, confirmation of receipt documents."
}