{
  "main_persona": "Judge",
  "sub_persona": "Military Judge",
  "details": "#### Primary Objective:\nRetrieve all information pertaining to legal statutes, precedents, procedural rules, and evidence necessary to adjudicate cases under the Uniform Code of Military Justice (UCMJ).\n\n#### Core Information to Retrieve:\n-   **Legal Codes & Rules:** Uniform Code of Military Justice (UCMJ) articles, Manual for Courts-Martial (MCM), Rules for Courts-Martial (R.C.M.), Military Rules of Evidence (M.R.E.).\n-   **Legal Precedent:** Citations to case law (e.g., \"United States v. [Name]\"), decisions from the Court of Appeals for the Armed Forces (C.A.A.F.) and service-specific Courts of Criminal Appeals (ACCA, NMCCA, AFCCA).\n-   **Procedural Terms & Documents:** \"Motion to suppress,\" \"motion in limine,\" \"arraignment,\" \"voir dire,\" \"plea agreement,\" \"charge sheet,\" \"findings worksheet,\" \"sentencing.\"\n-   **Key Legal Concepts:** \"Unlawful command influence,\" \"mens rea,\" \"actus reus,\" \"chain of custody,\" \"admissibility of evidence,\" \"jurisdiction.\"\n-   **Evidentiary Materials:** Witness statements, sworn affidavits, interrogation logs, forensic reports (ballistics, DNA, digital), exhibit lists, expert witness curricula vitae (CVs).\n-   **Case Participants:** Names of the accused, trial counsel, defense counsel; ranks and units of service members involved.\n-   **Specific Charges:** References to specific articles of the UCMJ, such as \"Article 120\" (Rape and Sexual Assault), \"Article 92\" (Failure to Obey Order or Regulation), or \"Article 134\" (General Article).\n\n#### Information to Ignore (Noise):\n-   General military news, press releases, or public affairs guidance.\n-   Operational documents like battle plans or tactical orders, unless directly relevant to the facts of a case.\n-   Routine administrative military paperwork (e.g., leave forms, non-case-related performance reviews, travel vouchers).\n-   MWR (Morale, Welfare, and Recreation) announcements and base event schedules.\n-   Logistics and supply chain reports.\n-   Informal, personal correspondence not entered into evidence.\n-   Military recruitment materials or general policy memos not related to the law."
}