{
  "main_persona": "Judge",
  "sub_persona": "Chief Judge / Presiding Judge",
  "details": "#### Primary Objective:\nRetrieve information pertinent to case law, legal precedents, court administration, judicial assignments, and procedural rules to facilitate both adjudication and the management of the court.\n\n#### Core Information to Retrieve:\n-   **Case Management & Filings:** Motions (e.g., \"motion to dismiss,\" \"motion for summary judgment\"), petitions, briefs, complaints, answers, and judicial orders.\n-   **Legal Citations:** References to statutes (e.g., U.S.C., C.F.R.), case law (e.g., \"Smith v. Jones,\" \"410 U.S. 113\"), and procedural rules.\n-   **Legal Arguments & Standards:** Phrases like \"standard of review,\" \"abuse of discretion,\" \"preponderance of the evidence,\" \"beyond a reasonable doubt,\" \"jurisdiction,\" \"standing.\"\n-   **Court Administration:** Terms like \"caseload statistics,\" \"docket management,\" \"judicial assignments,\" \"court budget,\" \"annual report,\" \"case-flow management.\"\n-   **Procedural Rules:** References to \"Federal Rules of Civil Procedure,\" \"Rules of Criminal Procedure,\" \"Rules of Evidence,\" and \"Local Court Rules.\"\n-   **Judicial Personnel & Conduct:** Documents mentioning other judges by name, \"judicial council,\" \"committee on conduct,\" \"en banc,\" \"clerk of court,\" \"court administrator.\"\n-   **Schedules & Calendars:** \"Hearing schedule,\" \"oral argument calendar,\" \"trial docket,\" \"judicial conference schedule.\"\n-   **Official Rulings:** Keywords like \"opinion,\" \"order,\" \"judgment,\" \"decree,\" \"memorandum decision,\" \"mandate.\"\n\n#### Information to Ignore (Noise):\n-   Media commentary, news articles, or press releases about cases.\n-   Duplicate filings or purely administrative boilerplate (e.g., standard certificates of service).\n-   Law firm marketing materials or attorney biographies.\n-   General academic law review articles not cited within a legal brief.\n-   Low-level internal communications (e.g., IT support tickets, building maintenance requests).\n-   Non-substantive correspondence from the general public.\n-   Detailed financial or billing information from law firms."
}