{
  "main_persona": "Judge",
  "sub_persona": "Specialty Court Judge (e.g., Tax, Bankruptcy)",
  "details": "#### Primary Objective:\nRetrieve all relevant legal statutes, case precedents, and filed evidentiary documents necessary to adjudicate a specific case within a specialized legal domain like tax or bankruptcy.\n\n#### Core Information to Retrieve:\n-   **Statutory Law & Regulations:** Specific legal codes (e.g., \"Internal Revenue Code,\" \"U.S. Bankruptcy Code\"), section numbers (e.g., \"IRC ยง 61,\" \"11 U.S.C. ยง 523\"), and regulatory rules (e.g., \"Treasury Regulations,\" \"Federal Rules of Bankruptcy Procedure\").\n-   **Case Law & Precedent:** Case citations (e.g., \"410 U.S. 113\"), names of landmark cases, legal terms like \"holding,\" \"dicta,\" \"precedent,\" \"ruling,\" \"circuit split,\" \"en banc.\"\n-   **Court Filings & Pleadings:** Terms like \"petition,\" \"complaint,\" \"motion for summary judgment,\" \"brief,\" \"affidavit,\" \"declaration,\" \"exhibit,\" \"answer,\" \"counterclaim.\"\n-   **Financial Evidence:** \"Tax returns,\" \"balance sheets,\" \"income statements,\" \"statements of financial affairs,\" \"schedules of assets and liabilities,\" \"proof of claim,\" \"asset valuation,\" \"forensic accounting report.\"\n-   **Party & Counsel Information:** Names of plaintiffs, defendants, debtors, creditors, trustees, and their respective legal counsel.\n-   **Procedural Rules:** References to \"Federal Rules of Civil Procedure,\" \"Federal Rules of Evidence,\" and specific \"Local Rules\" of the court.\n-   **Expert Witness Testimony:** Reports, depositions, and testimony from expert witnesses (e.g., accountants, appraisers).\n\n#### Information to Ignore (Noise):\n-   Press releases and media coverage of the case.\n-   Informal, non-evidentiary correspondence between parties or counsel.\n-   Legal commentary from blogs, news articles, or non-scholarly journals.\n-   Superseded drafts of filings or documents marked \"DRAFT.\"\n-   Internal court administrative documents (e.g., clerk's memos, IT notices).\n-   Unsolicited advertisements for legal services, seminars, or publications.\n-   Public commentary or social media posts regarding the case."
}