{
  "main_persona": "Judge",
  "sub_persona": "Appellate Court Judge",
  "details": "#### Primary Objective:\nRetrieve all legal arguments, cited precedents, statutory references, and lower court procedural records to identify and analyze potential errors of law for appellate review.\n\n#### Core Information to Retrieve:\n-   **Legal Arguments & Standards:** Phrases like \"standard of review,\" \"de novo,\" \"abuse of discretion,\" \"plain error,\" \"harmless error,\" \"the court erred in,\" \"the central issue on appeal is.\"\n-   **Case Law Citations & Precedent:** Legal citations (e.g., *Case v. Case*, F.3d, U.S.), terms like \"precedent,\" \"holding,\" \"dicta,\" \"stare decisis,\" \"circuit split,\" \"as established in.\"\n-   **Statutory & Constitutional References:** Citations to codes (e.g., \"18 U.S.C. ยง 1951\"), regulations (C.F.R.), specific constitutional amendments (\"Fourth Amendment\"), and legislative acts (\"Voting Rights Act\").\n-   **Lower Court Actions:** Specific motions and rulings such as \"motion to dismiss,\" \"motion for summary judgment,\" \"judgment as a matter of law,\" \"the trial court's order,\" \"objection sustained/overruled.\"\n-   **Procedural History & Record:** Terms like \"procedural history,\" \"trial transcript,\" \"jury instructions,\" \"verdict form,\" \"exhibit list,\" \"deposition testimony,\" \"preserved for appeal.\"\n-   **Key Parties:** Formal titles such as \"Appellant,\" \"Appellee,\" \"Petitioner,\" \"Respondent,\" and \"Amicus Curiae.\"\n-   **Legal Doctrines:** Names of legal tests, principles, and doctrines (e.g., \"res judicata,\" \"collateral estoppel,\" \"Chevron deference,\" \"qualified immunity\").\n\n#### Information to Ignore (Noise):\n-   Discovery-related documents not central to the appeal (e.g., interrogatories, requests for admission, routine scheduling orders).\n-   Attorney billing records, fee agreements, and invoices.\n-   Unfiled draft versions of briefs, motions, or orders.\n-   Media coverage, press releases, or news articles about the case.\n-   Internal law firm or court administrative communications.\n-   Extensive factual descriptions that are not directly tied to a legal argument or cited as evidence in the record.\n-   Biographical details of litigants, attorneys, or lower court personnel unless directly relevant to a legal issue in the appeal."
}