{
  "main_persona": "Lab Technician",
  "sub_persona": "Pathology Lab Technician",
  "details": "#### Primary Objective:\nRetrieve all technical procedures, safety protocols, equipment specifications, and sample handling guidelines relevant to pathology laboratory operations.\n\n#### Core Information to Retrieve:\n-   **Procedures & Protocols:** Standard Operating Procedures (SOPs), protocols for \"grossing,\" \"fixation,\" \"tissue processing,\" \"embedding,\" \"sectioning,\" and \"staining.\" Specific techniques like \"H&E stain,\" \"immunohistochemistry (IHC),\" \"special stains,\" \"frozen sections.\"\n-   **Specimen Handling:** Keywords like \"specimen,\" \"tissue,\" \"biopsy,\" \"cytology,\" \"histology,\" \"accessioning,\" \"labeling,\" \"chain of custody,\" \"storage requirements.\"\n-   **Equipment & Instruments:** Manuals, calibration instructions, and maintenance logs for \"microtome,\" \"cryostat,\" \"tissue processor,\" \"automatic stainer,\" \"microscope,\" and \"embedding center.\"\n-   **Reagents & Chemicals:** Preparation instructions, expiration dates, and lot numbers for \"formalin,\" \"xylene,\" \"alcohols,\" \"paraffin wax,\" \"hematoxylin,\" \"eosin,\" and specific antibodies for IHC.\n-   **Safety Protocols:** \"Safety Data Sheet (SDS),\" \"Material Safety Data Sheet (MSDS),\" \"Chemical Hygiene Plan,\" \"biohazard waste disposal,\" \"spill containment procedures,\" \"Personal Protective Equipment (PPE)\" guidelines.\n-   **Quality Control & Assurance:** \"Quality Control (QC)\" procedures, \"Quality Assurance (QA)\" metrics, information on \"control slides,\" \"reagent validation,\" \"corrective actions,\" and \"proficiency testing.\"\n-   **Documentation:** Templates or instructions for filling out \"maintenance logs,\" \"temperature logs,\" \"specimen logs,\" and \"reagent logs.\"\n\n#### Information to Ignore (Noise):\n-   Final pathology reports, diagnostic interpretations, patient prognoses, or treatment plans.\n-   Patient billing information, insurance codes (CPT codes), and hospital financial records.\n-   Clinical trial results or academic research papers not directly related to a lab technique.\n-   Information on unrelated laboratory disciplines like microbiology, clinical chemistry, or genetics.\n-   General hospital administration memos, HR documents, or marketing materials.\n-   Detailed patient histories or physician notes, except for information essential for specimen processing (e.g., site of biopsy)."
}