{
  "main_persona": "Lab Technician",
  "sub_persona": "Clinical Lab Technician",
  "details": "#### Primary Objective:\nRetrieve specific laboratory procedures, safety protocols, equipment manuals, and quality control standards required for performing clinical diagnostic tests on patient samples.\n\n#### Core Information to Retrieve:\n-   **Standard Operating Procedures (SOPs):** Documents titled \"SOP,\" \"Protocol,\" or \"Procedure\" for specific tests (e.g., \"CBC procedure,\" \"Urinalysis SOP,\" \"PCR protocol\").\n-   **Equipment & Instrumentation:** Manuals, calibration instructions, maintenance logs, and troubleshooting guides for specific instrument models (e.g., \"Sysmex XN-1000,\" \"Roche Cobas 8000\"). Keywords: \"calibration,\" \"maintenance,\" \"error code,\" \"troubleshooting.\"\n-   **Quality Control (QC):** QC ranges, Levey-Jennings charts, corrective action reports, proficiency testing instructions, and control material package inserts. Phrases like \"quality control log,\" \"control values,\" \"run acceptance criteria.\"\n-   **Safety Data:** Material Safety Data Sheets (MSDS/SDS), chemical handling instructions, biohazard waste disposal procedures, and Personal Protective Equipment (PPE) requirements. Keywords: \"biohazard,\" \"spill cleanup,\" \"chemical safety.\"\n-   **Reagents & Kits:** Preparation instructions, storage requirements (e.g., \"store at 2-8°C\"), lot numbers, and expiration dates from package inserts.\n-   **Reference Ranges:** Lists of \"normal values,\" \"reference intervals,\" \"critical values,\" or \"panic values\" for various analytes and tests.\n-   **Specimen Handling:** Instructions for sample collection, processing, storage, and rejection criteria. Keywords: \"specimen type\" (e.g., plasma, serum, whole blood), \"centrifuge speed,\" \"aliquot,\" \"sample stability.\"\n-   **Regulatory & Compliance:** Checklists and guidelines from accrediting bodies like \"CLIA,\" \"CAP,\" \"The Joint Commission,\" or \"COLA.\"\n\n#### Information to Ignore (Noise):\n-   **Patient-Specific Information:** Patient names, Medical Record Numbers (MRN), billing codes, insurance information, or detailed clinical histories.\n-   **Administrative & Financial Documents:** Departmental budgets, invoices, purchasing orders, staffing schedules, and general hospital annual reports.\n-   **Academic Research Papers:** Theoretical research, literature reviews, or grant proposals not directly related to a clinical testing procedure.\n-   **Marketing & Sales Materials:** Promotional brochures, competitive analyses, and sales literature for lab equipment or services.\n-   **General Hospital Policies:** Information unrelated to lab operations, such as visiting hours, cafeteria menus, or parking regulations.\n-   **Human Resources Documents:** Job descriptions, performance reviews, and employee benefits information."
}