{
  "main_persona": "Lab Technician",
  "sub_persona": "Veterinary Lab Technician",
  "details": "#### Primary Objective:\nRetrieve all technical information required to conduct veterinary diagnostic tests, handle biological samples, operate lab equipment, and maintain safety and quality control standards.\n\n#### Core Information to Retrieve:\n-   **Test Procedures & Protocols:** Standard Operating Procedures (SOPs), assay instructions, \"CBC\" (Complete Blood Count), \"urinalysis,\" \"fecal flotation,\" \"cytology,\" \"histopathology,\" \"blood chemistry panels,\" \"PCR,\" \"ELISA.\"\n-   **Sample Handling:** Phrases like \"specimen collection,\" \"sample preparation,\" \"storage temperature,\" \"transport media.\"\n-   **Sample Types:** Keywords like \"whole blood,\" \"serum,\" \"plasma,\" \"urine,\" \"tissue biopsy,\" \"fecal sample.\"\n-   **Reagents & Stains:** \"Reagent preparation,\" \"lot number,\" \"expiration date,\" \"Safety Data Sheet (SDS),\" \"Gram stain,\" \"Diff-Quik,\" \"Wright-Giemsa stain.\"\n-   **Equipment & Maintenance:** \"Calibration logs,\" \"quality control (QC),\" \"instrument maintenance,\" \"troubleshooting,\" and names of specific analyzers (e.g., \"hematology analyzer,\" \"centrifuge,\" \"microscope,\" \"autoclave\").\n-   **Reference Ranges:** Tables or lists of \"normal values\" or \"reference intervals\" for different species (e.g., \"canine,\" \"feline,\" \"equine,\" \"avian\").\n-   **Safety Protocols:** \"Biohazard,\" \"zoonotic disease,\" \"personal protective equipment (PPE),\" \"sharps disposal,\" \"chemical safety,\" \"OSHA guidelines.\"\n-   **Parasitology & Microbiology:** Identification guides for parasites (e.g., \"Giardia,\" \"Coccidia,\" \"hookworm\"), bacteria, and fungi; \"culture and sensitivity\" protocols.\n\n#### Information to Ignore (Noise):\n-   Client billing information, invoices, and insurance forms.\n-   Veterinarian's diagnostic interpretations, treatment plans, and surgical procedure notes.\n-   Front desk administrative tasks, appointment schedules, and client communication logs.\n-   Marketing materials, clinic newsletters, and social media content.\n-   General animal husbandry information (e.g., grooming, diet, breeding) not directly related to a diagnostic test.\n-   Pharmaceutical drug monographs and dosage calculations.\n-   Financial reports and general business administration documents for the clinic or hospital."
}