{
  "main_persona": "Lab Technician",
  "sub_persona": "Environmental Lab Technician",
  "details": "#### Primary Objective:\nRetrieve detailed analytical methods, quality control procedures, safety data, and instrument operating instructions relevant to environmental sample testing.\n\n#### Core Information to Retrieve:\n-   **Standard Operating Procedures (SOPs):** Phrases like \"SOP,\" \"analytical method,\" \"test procedure,\" \"sample preparation,\" \"extraction,\" \"digestion.\"\n-   **Regulatory Methods:** Specific method numbers and names from agencies like the EPA, ASTM, NIOSH (e.g., \"EPA Method 8260C,\" \"ASTM D2216\").\n-   **Analytes and Contaminants:** Keywords for specific chemicals and substances being tested for, such as \"lead,\" \"mercury,\" \"arsenic,\" \"pesticides,\" \"VOCs\" (Volatile Organic Compounds), \"PAHs\" (Polycyclic Aromatic Hydrocarbons), \"PCBs,\" \"nitrates,\" \"phosphates,\" \"TDS\" (Total Dissolved Solids), \"coliform.\"\n-   **Instrumentation & Equipment:** Names of lab instruments (\"Gas Chromatograph,\" \"Mass Spectrometer,\" \"ICP-MS,\" \"Atomic Absorption,\" \"spectrophotometer\") and related terms (\"calibration,\" \"maintenance,\" \"troubleshooting,\" \"operating parameters\").\n-   **Quality Assurance/Quality Control (QA/QC):** Terms like \"QA/QC,\" \"method blank,\" \"lab control sample,\" \"spike,\" \"duplicate,\" \"detection limit\" (MDL), \"quantitation limit\" (LOQ), \"control chart,\" \"chain of custody.\"\n-   **Safety Information:** Keywords such as \"Safety Data Sheet\" (SDS), \"Personal Protective Equipment\" (PPE), \"chemical hazard,\" \"waste disposal,\" \"spill procedure,\" \"fume hood.\"\n-   **Units and Measurements:** Specific units like \"mg/L,\" \"µg/kg,\" \"ppm\" (parts per million), \"ppb\" (parts per billion), \"pH,\" \"turbidity\" (NTU).\n-   **Reagents and Standards:** Chemical names, CAS numbers, \"certified reference material\" (CRM), \"standard solution,\" \"reagent preparation.\"\n\n#### Information to Ignore (Noise):\n-   Corporate financial reports, investor relations documents, and marketing materials.\n-   High-level environmental policy debates, legislative history, and public comments on regulations.\n-   Human Resources information, such as hiring policies, benefits packages, or general company-wide announcements.\n-   Broad scientific articles or research papers that are purely theoretical and do not contain specific, actionable lab procedures.\n-   Sales quotes or invoices for laboratory equipment or supplies.\n-   Environmental impact statements, except for the specific data tables or analytical methods sections."
}