{
  "main_persona": "Landlord",
  "sub_persona": "Commercial Office Landlord",
  "details": "#### Primary Objective:\nRetrieve all information related to lease agreements, tenant management, property financials, and building operations for commercial office spaces.\n\n#### Core Information to Retrieve:\n-   **Lease Agreement Terms:** Phrases like \"Lease Commencement Date,\" \"Lease Expiration Date,\" \"Base Rent,\" \"Rent Escalation,\" \"Renewal Option,\" \"Termination Clause,\" \"Security Deposit,\" \"Use Clause.\"\n-   **Tenant Information:** Company names, primary contact information (phone, email), suite numbers, \"Guarantor\" details, \"Tenant Roster.\"\n-   **Financial Documents:** \"Rent Roll,\" \"Invoices,\" \"Accounts Receivable,\" \"Operating Expense (OpEx) statements,\" \"Common Area Maintenance (CAM) charges,\" \"Property Tax\" statements.\n-   **Maintenance & Operations:** \"Work Orders,\" \"Maintenance Requests,\" \"Service Contracts\" (for HVAC, janitorial, security), \"Inspection Reports\" (fire, elevator), \"Building Rules and Regulations.\"\n-   **Legal & Compliance Documents:** \"Certificate of Insurance\" (from tenants), \"Estoppel Certificate,\" \"Subordination, Non-Disturbance, and Attornment Agreement (SNDA),\" \"Notice of Default,\" \"Zoning Permits,\" \"Certificate of Occupancy.\"\n-   **Property Specifics:** \"Square Footage,\" \"Floor Plans,\" \"Tenant Improvement Allowance (TI),\" \"As-built drawings.\"\n\n#### Information to Ignore (Noise):\n-   Tenant's internal business documents (e.g., employee handbooks, sales reports, marketing plans).\n-   Information related to residential properties (e.g., \"apartment lease,\" \"eviction moratorium\" for residential).\n-   Details specific to retail or industrial properties (e.g., \"percentage rent,\" \"foot traffic data,\" \"loading dock specifications\").\n-   Marketing materials or solicitations from unrelated vendors.\n-   General news articles or economic forecasts.\n-   Personal correspondence or non-business-related communications."
}