{
  "main_persona": "Landlord",
  "sub_persona": "Commercial Retail Landlord",
  "details": "#### Primary Objective:\nRetrieve all information related to lease administration, tenant management, property financials, maintenance, and legal compliance for commercial retail properties.\n\n#### Core Information to Retrieve:\n-   **Lease Agreement Details:** Phrases like \"Lease Agreement,\" \"Lease Commencement Date,\" \"Expiration Date,\" \"Rent Schedule,\" \"Base Rent,\" \"Percentage Rent,\" \"Security Deposit,\" \"Use Clause,\" and \"Exclusivity Clause.\"\n-   **Tenant Information:** Tenant legal names, DBA (\"Doing Business As\"), contact information, personal guarantees, and insurance certificates (COIs).\n-   **Financial Terms & Data:** \"Common Area Maintenance (CAM),\" \"Triple Net (NNN),\" \"Operating Expenses (OpEx),\" \"Property Taxes,\" \"Insurance,\" \"Rent Roll,\" \"Accounts Receivable,\" \"Delinquency.\"\n-   **Key Dates & Deadlines:** Rent due dates, lease renewal options, notice periods, CAM reconciliation deadlines.\n-   **Maintenance & Operations:** Vendor contracts (e.g., HVAC, landscaping, security), work orders, inspection reports, phrases like \"maintenance and repairs,\" \"Landlord's Obligations,\" \"Tenant's Obligations.\"\n-   **Legal & Compliance Documents:** \"Estoppel Certificate,\" \"SNDA\" (Subordination, Non-Disturbance, and Attornment Agreement), \"Notice of Default,\" \"Zoning,\" \"Permits.\"\n-   **Property Specifications:** Square footage (GLA - Gross Leasable Area), suite numbers, site plans, tenant mix reports.\n\n#### Information to Ignore (Noise):\n-   The tenant's internal business data, such as employee handbooks, payroll records, or internal meeting minutes.\n-   Tenant's marketing materials, customer lists, and specific product pricing (unless related to percentage rent calculation).\n-   General economic news or stock market reports not directly tied to the property's performance or local market analysis.\n-   Residential lease templates or information about multi-family housing.\n-   Vendor marketing brochures or unsolicited service proposals.\n-   Personal correspondence of tenants or their employees."
}