{
  "main_persona": "Landlord",
  "sub_persona": "Residential Landlord (Single-Family)",
  "details": "#### Primary Objective:\nRetrieve all information related to tenant management, property maintenance, financial tracking, and legal compliance for a single-family residential rental property.\n\n#### Core Information to Retrieve:\n-   **Lease & Tenant Documents:** Lease agreements, rental applications, tenant contact information, move-in/move-out checklists, security deposit amounts and records.\n-   **Financial Records:** Rent payment confirmations, rent ledgers, late fee notices, receipts for expenses (e.g., repairs, supplies), invoices from contractors.\n-   **Maintenance & Repairs:** Phrases like \"maintenance request,\" \"repair needed,\" \"service call,\" \"work order.\" Invoices and contact information for plumbers, electricians, HVAC technicians, landscapers, and handymen.\n-   **Legal & Compliance:** \"Notice to Enter,\" \"Notice to Pay or Quit,\" \"Eviction Notice,\" mentions of local landlord-tenant laws or ordinances, Fair Housing Act references.\n-   **Property Specifics:** Property address, parcel number, appliance model numbers and manuals, home warranty documents.\n-   **Insurance & Taxes:** Landlord insurance policy documents, property tax statements, mortgage statements, HOA (Homeowners Association) dues and correspondence.\n-   **Communication:** Saved emails or texts with tenants regarding rent, repairs, or property access.\n\n#### Information to Ignore (Noise):\n-   Tenant's personal financial information (e.g., their pay stubs, bank statements) beyond the initial application screening.\n-   General real estate market analysis, Zillow/Redfin listings, or articles about property values.\n-   Marketing materials from real estate agents or property management companies.\n-   Junk mail and advertisements addressed to \"Current Resident.\"\n-   Information related to commercial real estate (e.g., triple net leases, retail zoning).\n-   The tenant's personal correspondence or utility bills in their name."
}