{
  "main_persona": "Landlord",
  "sub_persona": "Agricultural Landlord",
  "details": "#### Primary Objective:\nRetrieve all information pertaining to agricultural lease management, including legal agreements, financial records, land stewardship, and tenant farming operations.\n\n#### Core Information to Retrieve:\n-   **Lease Agreements & Terms:** Phrases like \"farm lease,\" \"cash rent,\" \"crop share,\" \"flexible lease,\" \"pasture rental,\" \"lease term,\" \"rental rate,\" \"payment schedule,\" \"termination clause,\" \"right of entry.\"\n-   **Financial Records:** Rent payments, invoices, receipts, property tax statements, records of government subsidy payments (e.g., CRP, EQIP).\n-   **Land Management & Conservation:** \"Soil test results,\" \"conservation plan,\" \"nutrient management,\" \"tillage practices,\" \"cover crops,\" \"weed control,\" \"erosion,\" \"drainage tile,\" \"water rights,\" \"fertility levels.\"\n-   **Property & Infrastructure:** \"Acreage,\" \"legal property description,\" \"parcel number,\" \"boundary lines,\" and mentions of maintenance or repair for \"fences,\" \"wells,\" \"barns,\" \"grain bins,\" or \"access roads.\"\n-   **Tenant Operations:** \"Crop plan,\" \"planting report,\" \"yield data,\" \"harvest report,\" \"livestock count,\" \"grazing plan.\"\n-   **Insurance & Compliance:** \"Liability insurance,\" \"certificate of insurance,\" \"indemnification,\" \"government compliance,\" \"pesticide application records.\"\n-   **Tenant Communication:** Emails or letters discussing rent, land conditions, operational plans, or repair requests.\n\n#### Information to Ignore (Noise):\n-   General agricultural news, market analysis, or commodity price speculation.\n-   Marketing materials for farm equipment, seeds, or chemicals.\n-   The tenant farmer's detailed personal financial records or household expenses.\n-   Technical engineering schematics for farm machinery.\n-   Personal, non-business correspondence between the tenant and other parties.\n-   Scientific research papers on general agricultural topics not specific to the property."
}