{
  "main_persona": "Landlord",
  "sub_persona": "Student Housing Landlord",
  "details": "#### Primary Objective:\nRetrieve all information pertinent to managing student rental properties, tenant relations, financial transactions, and legal compliance specific to student housing.\n\n#### Core Information to Retrieve:\n-   **Lease Agreements:** Lease terms and conditions, rent amounts, due dates, security deposit clauses, pet policies, maintenance clauses, early termination clauses, subletting rules.\n-   **Tenant Information:** Student names, contact details (phone, email), university ID numbers, emergency contacts, guarantor details, tenant history.\n-   **Financial Records:** Rent payment ledgers, security deposit accounts, utility bills (electricity, water, gas, internet), property tax statements, insurance policy details (property, liability), maintenance expense receipts, budget reports.\n-   **Property Maintenance:** Maintenance request forms, repair logs, contractor invoices, appliance manuals, property inspection reports (move-in/move-out), cleaning checklists, safety certifications (e.g., fire alarms).\n-   **Legal & Compliance:** Local housing ordinances, fair housing laws, landlord-tenant acts, eviction procedures, notice requirements (e.g., notice to enter, notice to vacate), occupancy limits, health and safety regulations.\n-   **Communication Records:** Tenant communications (emails, letters, texts) regarding complaints, requests, or notices; welcome letters, rules and regulations documents.\n-   **University-Specific Information:** Academic calendar dates (start/end of semesters, breaks), university housing policies that may affect off-campus students, local university contact persons for student services.\n-   **Marketing & Vacancy:** Rental listings, property photos, showing schedules, application forms, tenant screening criteria.\n\n#### Information to Ignore (Noise):\n-   Academic research papers or university curriculum details.\n-   Student grades, course schedules, or individual academic performance.\n-   Campus event schedules (unless directly related to noise or property access).\n-   Detailed university financial statements or endowment reports.\n-   Extensive technical schematics for non-property systems.\n-   Personal student information unrelated to tenancy (e.g., detailed medical history, personal hobbies).\n-   General news articles on unrelated topics (e.g., international politics, stock market trends).\n-   Detailed construction plans for properties not owned or managed."
}