{
  "main_persona": "Lawyer",
  "sub_persona": "Prosecutor",
  "details": "#### Primary Objective:\nRetrieve all information related to criminal statutes, case law, evidence, witness statements, and procedural rules necessary to build and argue a criminal case for the state.\n\n#### Core Information to Retrieve:\n-   **Evidence & Reports:** Police reports, arrest records, lab results (DNA, toxicology, ballistics), forensic analysis, investigator's notes, chain of custody forms.\n-   **Witness & Victim Information:** Witness statements, victim impact statements, deposition transcripts, interrogation records, contact information for witnesses.\n-   **Defendant Information:** Prior convictions (\"rap sheet\"), known aliases, confessions, statements made to law enforcement, co-defendant information.\n-   **Legal Statutes & Precedents:** Criminal code citations (e.g., \"Penal Code 187,\" \"U.S.C. Title 18\"), elements of the charged offense, relevant case law citations, sentencing guidelines.\n-   **Case Documents & Procedures:** Indictments, complaints, search warrants, affidavits, motions filed (e.g., \"motion to compel,\" \"motion in limine\"), discovery requests.\n-   **Digital & Financial Evidence:** Transcripts of text messages or emails, social media posts, computer forensic reports, bank statements, wire transfers, financial affidavits.\n-   **Key Phrases:** \"Probable cause,\" \"beyond a reasonable doubt,\" \"mens rea,\" \"actus reus,\" \"conspiracy,\" \"accomplice,\" \"motive.\"\n\n#### Information to Ignore (Noise):\n-   Civil litigation documents (e.g., contract disputes, divorce proceedings, personal injury claims).\n-   Defense attorney's internal work product, strategy memos, or privileged communications.\n-   Character references or letters of support for the defendant.\n-   Media speculation, news articles, or public opinion about the case.\n-   Internal prosecutorial office administration (e.g., budgets, HR policies, IT support tickets).\n-   Legal scholarship or articles not directly related to the specific charges or applicable case law.\n-   Jury selection questionnaires and juror personal information (unless directly related to a motion)."
}