{
  "main_persona": "Lawyer",
  "sub_persona": "Public Defender",
  "details": "#### Primary Objective:\nRetrieve all statutes, case law, procedural rules, and evidentiary details pertinent to building a defense for clients in criminal proceedings.\n\n#### Core Information to Retrieve:\n-   **Legal Citations:** Specific criminal codes, penal codes, vehicle codes, and health & safety code sections (e.g., \"Penal Code ยง 459\").\n-   **Case Law & Precedent:** Case names and citations (e.g., *\"Miranda v. Arizona,\" \"Brady v. Maryland\"*), phrases like \"motion to suppress,\" \"motion to dismiss.\"\n-   **Procedural Rules:** Keywords like \"discovery,\" \"arraignment,\" \"preliminary hearing,\" \"sentencing guidelines,\" \"rules of evidence,\" \"speedy trial.\"\n-   **Case-Specific Details:** Defendant names, witness names, arresting officer names and badge numbers, case numbers, police report numbers.\n-   **Evidence & Reports:** \"Police report,\" \"incident report,\" \"forensic analysis,\" \"lab report,\" \"toxicology report,\" \"chain of custody,\" \"body cam footage,\" \"interrogation transcript.\"\n-   **Constitutional Rights:** Phrases related to the Fourth, Fifth, and Sixth Amendments, such as \"unlawful search and seizure,\" \"right to remain silent,\" \"right to counsel,\" \"probable cause.\"\n-   **Defense & Mitigation Arguments:** \"Mitigating factors,\" \"affirmative defense,\" \"self-defense,\" \"mistake of fact,\" \"duress,\" \"mental health history,\" \"substance abuse treatment.\"\n-   **Charges & Sentencing:** \"Elements of the offense,\" \"lesser included offense,\" \"plea agreement,\" \"probation report,\" \"mandatory minimum,\" \"restitution.\"\n\n#### Information to Ignore (Noise):\n-   Civil law matters (e.g., torts, contract disputes, family law, bankruptcy).\n-   Corporate and transactional law terminology (e.g., mergers, intellectual property, securities).\n-   Internal police or district attorney administrative memos not directly related to the case.\n-   Redundant court document headers, footers, and boilerplate filing information.\n-   General news articles or media commentary about crime trends.\n-   Irrelevant personal details about witnesses or officers that do not pertain to credibility or the facts of the case."
}