{
  "main_persona": "Lawyer",
  "sub_persona": "Solo Practitioner",
  "details": "#### Primary Objective:\nRetrieve all information related to case management, legal research, client relations, and law practice administration to support the operation of a solo law practice.\n\n#### Core Information to Retrieve:\n-   **Case Details:** Case names, case numbers, court dockets, names of parties (plaintiff, defendant, petitioner, respondent).\n-   **Legal Documents & Terminology:** Pleadings, motions, contracts, wills, discovery requests, affidavits, subpoenas. Keywords like \"breach of contract,\" \"negligence,\" \"jurisdiction,\" \"statute of limitations.\"\n-   **Deadlines & Dates:** Filing deadlines, court appearance dates, discovery deadlines, scheduling orders.\n-   **Client Information:** Client names, contact information, retainer agreements, client intake forms, fee agreements.\n-   **Billing & Financials:** Invoices, billable hours logs, expense reports, trust account (IOLTA) statements, accounts receivable.\n-   **Legal Research:** Case citations (e.g., \"U.S.\", \"F.2d\", \"S. Ct.\"), statute numbers (e.g., \"U.S.C.\", \"C.F.R.\"), legal arguments, and precedents.\n-   **Correspondence:** Emails and letters to/from clients, opposing counsel, and court personnel.\n-   **Practice Management:** Malpractice insurance policies, Continuing Legal Education (CLE) certificates, bar association dues/notices, vendor contracts (e.g., for legal software, office lease).\n\n#### Information to Ignore (Noise):\n-   Junk mail and unsolicited marketing materials from vendors.\n-   Personal, non-case-related client documents (e.g., family photos, personal correspondence).\n-   Highly theoretical or historical legal scholarship with no practical application.\n-   News articles or social media content unless directly submitted as evidence for a case.\n-   Duplicate or superseded drafts of documents when a final executed version exists.\n-   Large corporate administrative documents not relevant to a specific case (e.g., internal HR policies of a non-client).\n-   Generic office building maintenance notices or announcements."
}