{
  "main_persona": "Lawyer",
  "sub_persona": "Immigration Lawyer",
  "details": "#### Primary Objective:\nRetrieve all legal statutes, regulations, application forms, case law, and policy updates related to immigration, nationality, and citizenship law.\n\n#### Core Information to Retrieve:\n-   **Legal Statutes & Codes:** References to the \"Immigration and Nationality Act\" (INA), \"Title 8 of the Code of Federal Regulations\" (8 CFR), and \"U.S. Code\" (USC) sections on immigration.\n-   **Government Agencies:** Mentions of U.S. Citizenship and Immigration Services (USCIS), Department of Homeland Security (DHS), Immigration and Customs Enforcement (ICE), Customs and Border Protection (CBP), Department of State (DOS), Department of Labor (DOL).\n-   **Specific Forms & Petitions:** Form numbers like \"I-130,\" \"I-485,\" \"N-400,\" \"I-589,\" \"I-765,\" \"I-129,\" \"DS-160,\" \"I-601,\" and their corresponding names (e.g., \"Petition for Alien Relative,\" \"Application for Naturalization\").\n-   **Immigration Concepts & Case Types:** Terms like \"asylum,\" \"refugee,\" \"removal proceedings,\" \"deportation,\" \"adjustment of status,\" \"consular processing,\" \"lawful permanent resident,\" \"naturalization,\" \"visa,\" \"green card.\"\n-   **Visa Categories:** Specific visa types such as \"H-1B,\" \"L-1,\" \"O-1,\" \"E-2,\" \"F-1,\" \"K-1,\" and employment-based categories like \"EB-1,\" \"EB-2,\" \"PERM.\"\n-   **Procedural Terms:** Phrases like \"priority date,\" \"visa bulletin,\" \"Request for Evidence\" (RFE), \"Notice of Intent to Deny\" (NOID), \"waiver of inadmissibility,\" \"biometrics,\" \"Affidavit of Support.\"\n-   **Legal Authorities:** Citations and decisions from the \"Board of Immigration Appeals\" (BIA), \"Administrative Appeals Office\" (AAO), Federal Circuit Courts, and the Supreme Court.\n-   **Policy Documents:** \"Policy Memorandum,\" \"Foreign Affairs Manual\" (FAM), agency guidance documents, and field manuals.\n\n#### Information to Ignore (Noise):\n-   Areas of law not directly related to immigration status, such as corporate law, intellectual property, personal injury, or family law (unless it pertains to a family-based petition).\n-   General news articles, opinion pieces, or political commentary on immigration policy.\n-   Sociological or demographic studies about immigration trends.\n-   Internal law firm administrative documents like billing records, timesheets, and marketing materials.\n-   Client's personal financial statements, except for documents directly required for a petition (e.g., tax returns for an Affidavit of Support).\n-   General information about foreign countries unless it's specifically for an asylum claim (e.g., country conditions reports)."
}