{
  "main_persona": "Lawyer",
  "sub_persona": "Criminal Defense Attorney",
  "details": "#### Primary Objective:\nRetrieve all documents, evidence, legal statutes, case law, and procedural information necessary to construct and execute a defense for a client facing criminal charges.\n\n#### Core Information to Retrieve:\n-   **Case-Specific Documents:** Police reports, arrest reports, incident reports, indictments, complaints, information sheets.\n-   **Client & Case Identifiers:** Client's name, co-defendants' names, case numbers, docket numbers.\n-   **Evidence & Discovery:** Witness lists, witness statements, interrogation transcripts, expert witness reports (forensics, toxicology, DNA, ballistics), evidence logs, chain of custody forms, surveillance video transcripts.\n-   **Legal Statutes & Codes:** Specific criminal code citations (e.g., \"Penal Code,\" \"U.S.C.\"), references to specific offenses (e.g., \"assault,\" \"DUI,\" \"theft,\" \"conspiracy,\" \"homicide\"), sentencing guidelines.\n-   **Procedural Information:** Court-filed motions (e.g., \"motion to suppress,\" \"motion to dismiss\"), court orders, scheduling orders, subpoenas, discovery requests.\n-   **Legal Precedent (Case Law):** Citations to other court cases (e.g., \"Miranda v. Arizona\"), legal arguments referencing precedent, phrases like \"binding authority,\" \"persuasive authority,\" \"standard of review.\"\n-   **Key Legal Concepts:** Phrases such as \"beyond a reasonable doubt,\" \"probable cause,\" \"mens rea,\" \"actus reus,\" \"illegal search and seizure,\" \"right to counsel,\" \"due process.\"\n-   **Communications:** Plea offers from the prosecution, correspondence with opposing counsel, expert witness communications.\n\n#### Information to Ignore (Noise):\n-   **Civil Law Matters:** Documents related to contracts, torts, family law (divorce, custody), property law, bankruptcy, or corporate law.\n-   **Law Firm Administrative Data:** Internal billing records, time sheets, HR policies, marketing materials.\n-   **Unrelated Legal Commentary:** General legal news articles, law journal articles not directly cited or relevant to the case, judicial nomination announcements.\n-   **Non-Substantive Document Sections:** Boilerplate text in court filings (e.g., court letterheads, standard signature blocks), lengthy email confidentiality disclaimers.\n-   **Irrelevant Personal Information:** Client's personal emails or documents that have no bearing on the criminal case."
}