{
  "main_persona": "Lawyer",
  "sub_persona": "Lawyer",
  "details": "#### Primary Objective:\nRetrieve all legally significant information, including facts, evidence, contractual obligations, potential liabilities, legal arguments, and procedural data relevant to a case or transaction.\n\n#### Core Information to Retrieve:\n-   **Parties and Entities:** Names of individuals, corporations, trusts, and government agencies; terms like \"plaintiff,\" \"defendant,\" \"appellant,\" \"appellee,\" \"lessor,\" \"lessee,\" \"debtor,\" \"creditor.\"\n-   **Contractual Language:** Specific clauses and key phrases such as \"represents and warrants,\" \"indemnify and hold harmless,\" \"limitation of liability,\" \"confidentiality,\" \"force majeure,\" \"governing law,\" \"jurisdiction,\" \"termination for cause.\"\n-   **Obligations and Prohibitions:** Action words like \"shall,\" \"must,\" \"agrees to,\" \"is obligated to,\" versus \"shall not,\" \"must not,\" \"is prohibited from.\"\n-   **Legal Concepts:** Terms of art like \"negligence,\" \"breach of contract,\" \"fiduciary duty,\" \"estoppel,\" \"statute of limitations,\" \"liability,\" \"damages.\"\n-   **Dates and Timelines:** Specific event dates, execution dates, effective dates, deadlines, termination dates, notice periods.\n-   **Evidence and Factual Statements:** Admissions, allegations, witness statements, expert opinions, phrases like \"I admit,\" \"we deny,\" \"it is alleged.\"\n-   **Legal Citations:** References to statutes (e.g., U.S.C., C.F.R.), case law (e.g., \"Smith v. Jones,\" F.3d, U.S.), and regulations.\n-   **Procedural Information:** Court names, case numbers, docket numbers, filing dates, motion titles (e.g., \"Motion to Dismiss\").\n-   **Monetary Values:** Dollar amounts ($), payment terms, settlement offers, damage calculations, invoice details.\n-   **Communications:** Emails, letters, and memoranda discussing key events, decisions, or liabilities.\n\n#### Information to Ignore (Noise):\n-   Generic boilerplate text such as non-substantive headers, footers, page numbers, and standard copyright notices.\n-   Document metadata like file paths, authoring software, or printer details (unless directly relevant to an evidence issue).\n-   Non-substantive communication (e.g., meeting scheduling, lunch invitations, out-of-office replies).\n-   Purely administrative content like tables of contents, glossaries, and indexes (the content they point to is important, the index itself is not).\n-   Formatting artifacts and comments related to document drafting (e.g., \"Track Changes,\" \"style guide,\" \"font type\").\n-   Embedded marketing material or general news clippings that are not central to the legal matter."
}