{
  "main_persona": "Legal Counsel",
  "sub_persona": "Intellectual Property Counsel",
  "details": "#### Primary Objective:\nRetrieve all mentions of intellectual property, including patents, trademarks, copyrights, and trade secrets, to identify ownership, manage licenses, and assess potential infringement risks.\n\n#### Core Information to Retrieve:\n-   **IP Keywords:** \"Intellectual Property,\" \"IP,\" \"Intangible Assets,\" \"Proprietary.\"\n-   **Patent-Related Terms:** \"Patent,\" \"Patent Application,\" \"Patent Pending,\" \"Invention,\" \"Prior Art,\" \"Freedom to Operate,\" \"FTO,\" \"Claim,\" \"Specification.\"\n-   **Trademark-Related Terms:** \"Trademark,\" \"Service Mark,\" \"Trade Dress,\" \"Brand,\" \"Logo,\" \"Goodwill,\" \"Likelihood of Confusion,\" \"™,\" \"®,\" \"SM.\"\n-   **Copyright-Related Terms:** \"Copyright,\" \"Author,\" \"Work for Hire,\" \"Derivative Work,\" \"Source Code,\" \"Fair Use,\" \"Public Domain,\" \"DMCA,\" \"©.\"\n-   **Trade Secret-Related Terms:** \"Trade Secret,\" \"Confidential Information,\" \"Know-How.\"\n-   **Agreement Types:** \"License Agreement,\" \"Non-Disclosure Agreement,\" \"NDA,\" \"Assignment Agreement,\" \"Royalty Agreement,\" \"Master Service Agreement,\" \"Statement of Work.\"\n-   **Legal & Contractual Clauses:** \"Representations and Warranties,\" \"Indemnification,\" \"Limitation of Liability,\" \"Confidentiality,\" \"Ownership of Work Product.\"\n-   **Litigation & Dispute Terms:** \"Infringement,\" \"Cease and Desist,\" \"Litigation,\" \"Dispute,\" \"Opposition,\" \"Injunction.\"\n-   **Governmental Bodies:** \"USPTO\" (United States Patent and Trademark Office), \"U.S. Copyright Office.\"\n\n#### Information to Ignore (Noise):\n-   Standard financial reporting (e.g., balance sheets, income statements) unless specifically detailing royalty payments.\n-   General HR documents (e.g., benefits enrollment, vacation policy) that do not contain assignment of invention or confidentiality clauses.\n-   Facilities management documents (e.g., office leases, maintenance schedules).\n-   IT infrastructure details (e.g., server logs, network diagrams).\n-   Marketing campaign performance metrics and sales reports.\n-   Generic boilerplate text such as tables of contents, page numbers, or standard email signatures."
}