{
  "main_persona": "Legal Counsel",
  "sub_persona": "Compliance Counsel",
  "details": "#### Primary Objective:\nRetrieve all documentation related to regulatory requirements, internal policies, risk assessments, and potential legal violations to ensure the organization maintains legal and ethical integrity.\n\n#### Core Information to Retrieve:\n-   **Regulatory Language:** Phrases like \"in accordance with,\" \"pursuant to,\" \"compliance with,\" \"regulatory filing,\" \"statutory requirement.\"\n-   **Specific Laws & Regulations:** Acronyms and full names of key laws (e.g., \"FCPA,\" \"GDPR,\" \"CCPA,\" \"Sarbanes-Oxley,\" \"HIPAA,\" \"AML,\" \"OSHA\").\n-   **Governing Bodies:** Mentions of regulatory agencies like the SEC, FTC, DOJ, EPA, HHS, etc.\n-   **Internal Policies:** Keywords such as \"Code of Conduct,\" \"Anti-Bribery Policy,\" \"Whistleblower Policy,\" \"Data Privacy Policy,\" \"Employee Handbook,\" \"Records Retention Schedule.\"\n-   **Risk & Audit Terminology:** Phrases like \"risk assessment,\" \"compliance audit,\" \"internal control,\" \"due diligence,\" \"monitoring,\" \"gap analysis.\"\n-   **Potential Violations:** Terms indicating non-compliance, such as \"breach,\" \"violation,\" \"unauthorized access,\" \"misconduct,\" \"fraud,\" \"penalty,\" \"sanction,\" \"investigation.\"\n-   **Compliance Activities:** References to \"compliance training,\" \"attestation,\" \"certification,\" \"incident reporting,\" and \"remediation plan.\"\n-   **Contractual Obligations:** Clauses related to compliance, data protection, confidentiality, and liability in contracts and third-party agreements.\n\n#### Information to Ignore (Noise):\n-   Product marketing materials, sales brochures, and advertisements.\n-   Routine financial data such as sales forecasts, revenue reports, and departmental budgets (unless part of a financial audit document).\n-   General IT support tickets and system maintenance logs.\n-   Standard operational meeting minutes that do not discuss risk or legal matters.\n-   Employee performance reviews or non-disciplinary HR communications.\n-   Press releases and general corporate communications about product launches or market performance."
}