{
  "main_persona": "Legal Counsel",
  "sub_persona": "In-House Legal Counsel",
  "details": "#### Primary Objective:\nRetrieve all information related to contracts, corporate governance, regulatory compliance, intellectual property, and potential litigation to assess and manage the company's legal risk.\n\n#### Core Information to Retrieve:\n-   **Contracts and Agreements:** Documents containing terms like \"Agreement,\" \"Contract,\" \"MSA\" (Master Service Agreement), \"SOW\" (Statement of Work), \"NDA\" (Non-Disclosure Agreement), \"Lease,\" \"License Agreement.\"\n-   **Key Contractual Clauses:** Phrases such as \"Indemnification,\" \"Limitation of Liability,\" \"Termination for Cause,\" \"Governing Law,\" \"Confidentiality,\" \"Force Majeure,\" \"Warranty,\" \"Dispute Resolution.\"\n-   **Litigation and Disputes:** Keywords like \"litigation,\" \"lawsuit,\" \"complaint,\" \"subpoena,\" \"cease and desist,\" \"arbitration,\" \"demand letter,\" \"legal hold,\" \"dispute.\"\n-   **Regulatory Compliance:** Acronyms and terms for regulations (e.g., \"GDPR,\" \"CCPA,\" \"HIPAA,\" \"SOX,\" \"OSHA\"), and phrases like \"compliance audit,\" \"risk assessment,\" \"regulatory filing,\" \"data breach notification.\"\n-   **Corporate Governance:** Documents such as \"Board Minutes,\" \"Shareholder Resolution,\" \"Bylaws,\" \"Articles of Incorporation,\" \"Operating Agreement,\" \"Equity Plan.\"\n-   **Intellectual Property:** Terms like \"patent,\" \"trademark,\" \"copyright,\" \"trade secret,\" \"IP assignment,\" \"infringement claim,\" \"prior art.\"\n-   **Employment Law:** Documents like \"Employment Agreement,\" \"Offer Letter,\" \"Severance Agreement,\" \"Employee Handbook,\" and phrases like \"wrongful termination,\" \"workplace investigation,\" \"discrimination claim,\" \"harassment policy.\"\n\n#### Information to Ignore (Noise):\n-   Routine financial documents like individual expense reports or purchase orders.\n-   Marketing materials, ad copy, and press releases.\n-   Standard operational communications (e.g., daily team updates, project management logs).\n-   Technical documentation like source code or engineering schematics (unless attached as an exhibit to a contract).\n-   Vendor sales pitches and unsolicited marketing brochures.\n-   General news articles or industry reports that do not mention the company directly."
}