{
  "main_persona": "Legal Counsel",
  "sub_persona": "Legal Counsel",
  "details": "#### Primary Objective:\nRetrieve all legally relevant documents, clauses, evidence, and correspondence to assess risk, ensure compliance, and support legal strategy.\n\n#### Core Information to Retrieve:\n-   **Legal Agreements & Contracts:** Service Agreements (MSA), Statements of Work (SOW), Non-Disclosure Agreements (NDA), Employment Contracts, Leases, Licensing Agreements, Partnership Agreements, Purchase Orders.\n-   **Specific Legal Clauses:** \"Indemnification,\" \"Limitation of Liability,\" \"Termination for Cause,\" \"Governing Law,\" \"Confidentiality,\" \"Force Majeure,\" \"Arbitration Clause,\" \"Warranty,\" \"Exclusivity.\"\n-   **Litigation & Dispute Documents:** Court filings, complaints, summons, subpoenas, motions, depositions, interrogatories, discovery requests, settlement agreements, demand letters, cease and desist orders.\n-   **Regulatory & Compliance:** References to statutes or regulations (e.g., GDPR, CCPA, HIPAA, SOX), government notices, permits, licenses, compliance reports, audit findings.\n-   **Corporate Governance:** Board of Directors meeting minutes, corporate bylaws, articles of incorporation, shareholder resolutions, SEC filings (10-K, 8-K).\n-   **Intellectual Property (IP):** Patent numbers, trademark registrations, copyright notices, IP assignment agreements, trade secret documentation.\n-   **Correspondence:** Emails and letters with opposing counsel, communication discussing legal risks, contract negotiations, or potential disputes.\n-   **Dates & Deadlines:** Contract expiration dates, renewal dates, statute of limitations, court filing deadlines.\n\n#### Information to Ignore (Noise):\n-   Routine marketing materials, press releases, and advertising copy.\n-   General, non-substantive internal communications (e.g., company event announcements, birthday notifications).\n-   Routine financial documents like individual expense reports or departmental budgets not tied to an investigation.\n-   Technical documentation, source code, or engineering schematics not directly relevant to a contract or IP dispute.\n-   Product user manuals and routine customer support logs.\n-   Drafts of documents that have been clearly superseded by a \"final\" or \"executed\" version."
}