{
  "main_persona": "Legal Counsel",
  "sub_persona": "Real Estate Legal Counsel",
  "details": "#### Primary Objective:\nRetrieve all legally binding terms, clauses, definitions, compliance requirements, and risk factors related to real estate transactions and property law.\n\n#### Core Information to Retrieve:\n-   **Contractual Terms:** Phrases like \"Purchase Price,\" \"Earnest Money,\" \"Closing Date,\" \"Contingencies\" (financing, inspection, appraisal), \"Default,\" \"Remedies.\"\n-   **Property Descriptions:** Legal property descriptions (e.g., \"Lot 5, Block 3,\" metes and bounds), parcel numbers (APN/PIN), street addresses.\n-   **Title & Ownership Documents:** Terms such as \"Title Insurance,\" \"Deed\" (Warranty, Quitclaim), \"Chain of Title,\" \"Easement,\" \"Lien,\" \"Encumbrance,\" \"Covenant,\" \"CC&Rs.\"\n-   **Leasing Agreements:** Keywords like \"Rent,\" \"Lease Term,\" \"Renewal Option,\" \"Permitted Use,\" \"Common Area Maintenance (CAM),\" \"Sublease,\" \"Assignment,\" \"Landlord Obligations,\" \"Tenant Obligations.\"\n-   **Financing Documents:** Loan agreements, promissory notes, mortgages, deeds of trust, phrases like \"Interest Rate,\" \"Amortization,\" \"Prepayment Penalty,\" \"Foreclosure.\"\n-   **Legal & Compliance Phrases:** \"Representations and Warranties,\" \"Indemnification,\" \"Hold Harmless,\" \"Governing Law,\" \"Jurisdiction,\" \"Force Majeure,\" \"Time is of the Essence,\" \"Conditions Precedent.\"\n-   **Zoning & Land Use:** Zoning designations (e.g., \"R-1,\" \"C-2\"), building codes, permits, variances, certificates of occupancy, and references to environmental reports (e.g., \"Phase I ESA\").\n-   **Parties and Dates:** Full legal names of Buyer, Seller, Landlord, Tenant, Lender, Borrower; specific dates like \"Effective Date,\" \"Execution Date,\" \"Expiration Date.\"\n\n#### Information to Ignore (Noise):\n-   Marketing brochures, property flyers, and promotional descriptions (\"beautiful views,\" \"charming details\").\n-   Detailed architectural drawings, floor plans, or MEP (Mechanical, Electrical, Plumbing) schematics.\n-   Pro-forma financial projections, investment analysis, and market rent studies.\n-   Non-binding correspondence, such as emails scheduling meetings or informal status updates.\n-   Appraisal reports (except for the final value if referenced in a contingency).\n-   General property inspection reports (except for sections referenced in repair addendums).\n-   Agent bios and brokerage marketing materials."
}