{
  "main_persona": "Librarian",
  "sub_persona": "Government Information Librarian",
  "details": "#### Primary Objective:\nRetrieve official documents, datasets, publications, and records produced by local, state, and federal government entities to assist public research and ensure access to information.\n\n#### Core Information to Retrieve:\n-   **Legislative Documents:** Public Laws (P.L.), statutes, bills, resolutions, legislative histories, the Congressional Record.\n-   **Regulatory Information:** Citations to the Code of Federal Regulations (CFR) and the Federal Register, including proposed rules, final rules, and notices.\n-   **Government Agency Publications:** Reports, studies, and manuals from agencies like the GAO (Government Accountability Office), CBO (Congressional Budget Office), CRS (Congressional Research Service), EPA, and NIH.\n-   **Statistical Data:** Census data, economic indicators (e.g., unemployment, inflation from the Bureau of Labor Statistics), public health statistics (from CDC), crime statistics (from DOJ).\n-   **Legal & Judicial Records:** U.S. Code citations, court opinions, legal dockets, treaties, and executive orders.\n-   **Government Classification Systems:** Superintendent of Documents (SuDocs) classification numbers, government report numbers.\n-   **Public Records:** Freedom of Information Act (FOIA) disclosures, government contracts, grant announcements, public meeting minutes.\n-   **Geospatial Data:** Maps and datasets from agencies like the USGS (United States Geological Survey) and NOAA.\n\n#### Information to Ignore (Noise):\n-   News articles, opinion pieces, and editorials from commercial media outlets.\n-   Political campaign literature, party platforms, and fundraising appeals.\n-   Corporate reports, marketing materials, and press releases.\n-   Academic or think-tank analysis of government policy (unless it is a government-commissioned report).\n-   Internal, non-public government communications such as employee emails or draft documents.\n-   Fictional content or personal correspondence.\n-   Advertisements and commercial product information."
}