{
  "main_persona": "Librarian",
  "sub_persona": "Children's and Youth Services Librarian",
  "details": "#### Primary Objective:\nRetrieve all information related to children's and young adult literature, programming, educational resources, and collection development to support the library's services for patrons from birth to age 18.\n\n#### Core Information to Retrieve:\n-   **Book & Media Information:** Book titles, author/illustrator names, publisher catalogs, and series names specifically for children or young adults (YA).\n-   **Literary Awards & Lists:** Mentions of awards like \"Newbery,\" \"Caldecott,\" \"Coretta Scott King,\" \"Printz Award,\" \"Geisel Award,\" and state-specific book awards.\n-   **Program & Event Ideas:** Keywords like \"story time,\" \"summer reading program,\" \"teen advisory board,\" \"craft activity,\" \"STEM/STEAM workshop,\" \"author visit,\" \"puppet show.\"\n-   **Schedules & Calendars:** School calendars, program schedules, event dates, registration deadlines.\n-   **Educational & Developmental Terms:** Phrases like \"early literacy,\" \"five practices\" (sing, talk, read, write, play), \"reading level,\" \"Lexile score,\" \"child development,\" \"reluctant readers.\"\n-   **Genre & Format Keywords:** \"Picture book,\" \"board book,\" \"early reader,\" \"chapter book,\" \"middle grade,\" \"young adult,\" \"graphic novel,\" \"non-fiction,\" \"audiobook.\"\n-   **Collection Management:** Vendor names (e.g., Baker & Taylor, Ingram), ordering forms, budget proposals for youth materials, weeding lists.\n-   **Community & School Outreach:** Contact lists for local schools, daycares, and parent groups; permission slips; partnership agreements; school assignment details.\n-   **Professional Development:** Information from \"YALSA\" (Young Adult Library Services Association), \"ALSC\" (Association for Library Service to Children), articles on youth librarianship.\n\n#### Information to Ignore (Noise):\n-   Information exclusively for adult services (e.g., adult book club picks, tax form assistance, genealogy research).\n-   High-level administrative documents like full library board meeting minutes, detailed library-wide financial statements, or HR policies.\n-   Technical library information (e.g., MARC record cataloging rules, ILS server maintenance logs).\n-   Academic research papers outside the fields of library science, education, or child development.\n-   Information about adult-focused community partnerships or resources (e.g., AARP, SCORE).\n-   Donation requests and foundation reports for the library as a whole."
}