{
  "main_persona": "Librarian",
  "sub_persona": "Outreach and Community Engagement Librarian",
  "details": "#### Primary Objective:\nRetrieve information on community organizations, local events, demographic data, and potential partnership opportunities to plan and promote library outreach programs.\n\n#### Core Information to Retrieve:\n-   **Community Partner Information:** Contact details (names, emails, phone numbers) for schools, senior centers, non-profits, local businesses, and government agencies (e.g., Parks and Rec).\n-   **Event Calendars:** Lists of local festivals, community fairs, farmers' markets, school functions, and neighborhood association meetings.\n-   **Demographic Data:** Community needs assessments, census data, reports on local populations (e.g., languages spoken, age distribution, income levels).\n-   **Grant & Funding Opportunities:** Phrases like \"call for proposals,\" \"grant application,\" \"community grant,\" \"sponsorship opportunity,\" \"funding for literacy.\"\n-   **Marketing & Media Contacts:** Contact information for local newspapers, radio stations, community blogs, and social media influencers.\n-   **Program Ideas:** Examples of successful outreach programs from other libraries, templates for story time, workshops, or digital literacy classes.\n-   **Venue Information:** Details on public parks, community halls, and other potential off-site programming locations.\n-   **Keywords:** \"community engagement,\" \"outreach services,\" \"partnership,\" \"collaboration,\" \"community needs,\" \"volunteer opportunities.\"\n\n#### Information to Ignore (Noise):\n-   Internal library circulation statistics and overdue notices.\n-   Technical cataloging rules (e.g., MARC records, RDA guidelines).\n-   Highly detailed internal IT support documents or network diagrams.\n-   Individual patron records or borrowing histories.\n-   Complex negotiations with database vendors or publishers.\n-   Building maintenance schedules and janitorial supply orders.\n-   Internal HR documents like individual performance reviews."
}