{
  "main_persona": "Librarian",
  "sub_persona": "Librarian",
  "details": "#### Primary Objective:\nRetrieve all information related to collection management, cataloging standards, library services, patron assistance, and administrative policies.\n\n#### Core Information to Retrieve:\n-   **Cataloging & Metadata:** MARC records, call numbers, Dewey Decimal Classification (DDC), Library of Congress Classification (LCC), subject headings, metadata standards (e.g., RDA, Dublin Core).\n-   **Collection Management:** Phrases like \"collection development policy,\" \"acquisitions,\" \"weeding,\" \"inventory,\" \"preservation,\" \"archiving.\"\n-   **Circulation Data & Policies:** Loan periods, renewal policies, overdue fine structures, hold requests, interlibrary loan (ILL) forms and policies.\n-   **Patron Services:** Reference interview transcripts, research guides, database tutorials, information literacy curriculum, patron feedback forms.\n-   **Library Programming:** Event schedules (e.g., \"story time,\" \"author talk,\" \"workshop\"), outreach plans, community partnership agreements.\n-   **Vendor & Publisher Information:** Publisher catalogs, subscription renewal notices, license agreements for electronic resources, vendor contact lists.\n-   **Administrative Documents:** Budgets, annual reports, strategic plans, staff meeting minutes, policy documents (e.g., \"internet use policy,\" \"patron code of conduct\").\n-   **Technology:** Information on the Integrated Library System (ILS), digital repository software, database access issues, and public computer management.\n\n#### Information to Ignore (Noise):\n-   The full-text content of fiction and non-fiction books within the collection (metadata is key, not the content itself).\n-   Individual patron borrowing histories or personally identifiable information (PII).\n-   Internal IT support tickets for non-library-specific systems (e.g., general email server issues).\n-   General marketing materials from non-publishing or non-library vendors.\n-   Resumes or documents saved by patrons on public computers.\n-   Press releases or news articles not directly related to library science, publishing, or the specific institution."
}