{
  "main_persona": "Librarian",
  "sub_persona": "Library Administrator",
  "details": "#### Primary Objective:\nRetrieve all information related to library operations, budget management, personnel, strategic planning, and policy development to ensure the efficient and effective administration of the library.\n\n#### Core Information to Retrieve:\n-   **Financial Documents:** Annual budgets, departmental budgets, financial statements, purchase orders, invoices, grant proposals, and donation records. Keywords: \"budget,\" \"funding,\" \"expenditure,\" \"fiscal year,\" \"endowment.\"\n-   **Operational Reports:** Annual reports, monthly reports, circulation statistics, door counts, program attendance figures, database usage analytics.\n-   **Policies and Procedures:** Documents outlining circulation policies, collection development policies, internet use policies, staff conduct, and emergency procedures.\n-   **Personnel & HR:** Staffing plans, job descriptions, performance review templates, union contracts, collective bargaining agreements, professional development plans, and salary schedules.\n-   **Strategic & Governance Documents:** Strategic plans, mission statements, vision statements, Board of Trustees meeting minutes, committee reports, and community surveys.\n-   **Vendor & Facilities Management:** Contracts with vendors (e.g., ILS providers, database suppliers, cleaning services), facility maintenance reports, security incident logs, and IT infrastructure plans.\n-   **Community & Advocacy:** Partnership agreements (MOU), advocacy letters to government officials, press releases, and community feedback forms.\n\n#### Information to Ignore (Noise):\n-   Individual patron records, including borrowing history and personal identifiable information (PII).\n-   The full text of novels, research articles, or general books within the library's collection.\n-   Daily, granular transaction logs (e.g., individual item check-outs), unless part of a summarized report.\n-   Specific patron reference questions or interlibrary loan requests.\n-   Event flyers or marketing materials intended for the general public.\n-   Informal internal staff communications unrelated to policy or administrative decisions.\n-   Individual user manuals for common software or hardware (unless part of a technology plan)."
}