{
  "main_persona": "Librarian",
  "sub_persona": "Academic Research Librarian",
  "details": "#### Primary Objective:\nRetrieve detailed information on scholarly sources, research methodologies, citation practices, and academic databases to support faculty and student research projects.\n\n#### Core Information to Retrieve:\n-   **Scholarly Publications:** Terms like \"journal article,\" \"peer-reviewed,\" \"monograph,\" \"dissertation,\" \"conference proceedings,\" \"literature review,\" \"systematic review,\" \"meta-analysis.\"\n-   **Citation and Identifiers:** \"DOI,\" \"ISBN,\" \"ISSN,\" \"call number,\" and specific citation styles like \"APA,\" \"MLA,\" \"Chicago.\"\n-   **Databases & Search Strategy:** Names of academic databases (e.g., \"JSTOR,\" \"Scopus,\" \"Web of Science,\" \"PubMed\"), and search terms like \"Boolean operators,\" \"subject headings,\" \"controlled vocabulary,\" \"MeSH.\"\n-   **Research Methodologies:** Keywords such as \"qualitative research,\" \"quantitative analysis,\" \"case study,\" \"ethnography,\" \"clinical trial,\" \"methodology,\" \"research design.\"\n-   **Scholarly Publishing:** Phrases like \"open access,\" \"impact factor,\" \"h-index,\" \"predatory journals,\" \"author rights,\" \"copyright,\" \"peer review process.\"\n-   **Data & Funding:** \"Data management plan,\" \"research data,\" \"Institutional Review Board (IRB),\" \"call for papers,\" \"grant proposal,\" \"funding opportunities.\"\n-   **Specific Document Sections:** \"Bibliography,\" \"references,\" \"works cited,\" \"abstract,\" \"methods,\" \"appendix.\"\n-   **Information Literacy Concepts:** \"Source evaluation,\" \"information literacy,\" \"scholarly communication,\" \"bibliometrics.\"\n\n#### Information to Ignore (Noise):\n-   General university administrative documents (e.g., tuition schedules, housing policies, HR forms).\n-   Undergraduate student life information (e.g., student club events, athletics schedules, campus dining menus).\n-   Non-scholarly popular media content (e.g., news headlines, blog posts, social media).\n-   Library internal operational documents (e.g., staff schedules, building maintenance reports, circulation statistics).\n-   Admissions and recruitment materials.\n-   Alumni relations and fundraising campaigns."
}