{
  "main_persona": "Librarian",
  "sub_persona": "Public Services Librarian",
  "details": "#### Primary Objective:\nRetrieve information pertaining to patron assistance, library resources, community programs, and operational policies relevant to public access and services.\n\n#### Core Information to Retrieve:\n-   **Circulation & Lending Policies:** Loan periods, renewal rules, overdue fines, hold procedures, interlibrary loan guidelines.\n-   **Patron Account Information:** Registration procedures, lost card policies, privacy statements.\n-   **Collection Management (Public-facing):** New acquisitions lists, popular materials, genre classifications, display schedules, weeding lists for public review.\n-   **Digital Resources:** Access instructions for e-books, audiobooks, online databases (e.g., JSTOR, Ancestry.com), streaming services, digital archives.\n-   **Public Programs & Events:** Calendars for story times, workshops, book clubs, author readings, community meetings, registration details for events.\n-   **Technology Assistance:** Guides for computer use, printing, scanning, Wi-Fi access, software tutorials (e.g., Microsoft Office), device lending policies.\n-   **Reference & Research Aids:** Research guides, bibliography formats, database search tips, general reference questions FAQs, contact information for specialized assistance.\n-   **Library Facilities & Services:** Hours of operation, room booking procedures, study space availability, public computer lab rules, accessibility services (e.g., large print, assistive technology).\n-   **Community Information:** Local service directories, government agency contacts, educational opportunities, job search resources, health information resources.\n-   **Staff Schedules (Public Service Desks):** Desk coverage, breaks, meeting times affecting public availability.\n-   **Emergency Procedures:** Fire evacuation plans, shelter-in-place instructions, first aid locations.\n\n#### Information to Ignore (Noise):\n-   Deep technical IT infrastructure diagrams or server logs.\n-   Detailed budget allocations not directly related to public service programs or acquisitions.\n-   Internal HR policies (e.g., employee benefits, payroll processing, performance reviews) unless related to public-facing roles or staffing levels.\n-   Extensive building blueprints or maintenance schedules not impacting public access.\n-   Vendor specific licensing agreements or financial contracts for back-end systems.\n-   Highly specialized archival processing guides or cataloging rules (e.g., MARC format details) unless directly impacting public search functionality."
}