{
  "main_persona": "Librarian",
  "sub_persona": "Digital Resources Librarian",
  "details": "#### Primary Objective:\nRetrieve all information related to the acquisition, management, licensing, and user support for electronic resources like databases, e-books, streaming media, and digital archives.\n\n#### Core Information to Retrieve:\n-   **Vendor & Licensing Agreements:** \"License agreement,\" \"subscription terms,\" \"perpetual access,\" \"interlibrary loan rights\" (ILL), \"terms of use,\" \"consortium pricing,\" publisher names, vendor contacts.\n-   **Access & Authentication:** \"IP authentication,\" \"proxy server,\" \"EZproxy,\" \"Shibboleth,\" \"SAML,\" \"OpenAthens,\" \"login issues,\" \"off-campus access,\" \"authentication error.\"\n-   **Usage Statistics & Analytics:** \"COUNTER reports,\" \"SUSHI protocol,\" \"usage data,\" \"cost per use,\" \"turnaways,\" \"downloads,\" \"searches,\" \"analytics dashboard.\"\n-   **Resource Management Systems:** \"ERM\" (Electronic Resource Management), \"link resolver\" (e.g., SFX, 360 Link), \"knowledge base\" (KB), \"KBART,\" \"discovery layer\" (e.g., Primo, Summon, EDS).\n-   **Metadata & Cataloging:** \"MARC records\" for e-resources, \"metadata,\" \"DOI\" (Digital Object Identifier), \"ISBN/eISBN,\" \"ISSN/eISSN,\" \"OCLC.\"\n-   **Technical Issues & Troubleshooting:** \"Broken link,\" \"access issue,\" \"system downtime,\" \"help desk ticket,\" \"user support FAQ,\" \"maintenance window.\"\n-   **Collection Development & Trials:** \"New resource trial,\" \"database evaluation,\" \"faculty request,\" \"subject liaison communication,\" \"cancellation review.\"\n-   **Standards & Accessibility:** \"WCAG\" (Web Content Accessibility Guidelines), \"VPAT\" (Voluntary Product Accessibility Template), \"user interface (UI),\" \"user experience (UX).\"\n\n#### Information to Ignore (Noise):\n-   Information about physical book circulation, shelving, or inventory.\n-   Building maintenance reports, architectural plans, or physical security procedures.\n-   Schedules for in-person events like story time, physical book clubs, or author readings.\n-   Processing and preservation of physical archival materials (e.g., rare books, manuscripts).\n-   General university/municipal administrative documents (e.g., HR policies, campus parking, non-library financial reports).\n-   Marketing materials for non-academic community events.\n-   Patron records containing personally identifiable information (PII)."
}