{
  "main_persona": "Logistics Coordinator",
  "sub_persona": "Inbound Materials Coordinator",
  "details": "#### Primary Objective:\nRetrieve all documentation related to the ordering, shipping, receiving, inspection, and inventorying of incoming materials from suppliers.\n\n#### Core Information to Retrieve:\n-   **Shipment Identifiers:** Purchase Order (PO) numbers, Bill of Lading (BOL) numbers, packing slip numbers, container numbers, Advanced Shipping Notice (ASN) numbers, tracking numbers.\n-   **Supplier Information:** Supplier names, supplier codes, contact information, shipping addresses.\n-   **Carrier Details:** Carrier names (e.g., FedEx, XPO, Maersk), freight forwarder details, mode of transport (truck, air, sea), trailer numbers.\n-   **Material Details:** Part numbers, SKUs, material descriptions, lot numbers, batch codes, serial numbers.\n-   **Quantities:** Phrases like \"quantity ordered,\" \"quantity shipped,\" \"quantity received,\" \"unit of measure\" (e.g., cases, pallets, pieces, kg).\n-   **Key Documents & Forms:** Purchase Orders, Packing Lists, Commercial Invoices, Certificates of Conformance (CoC), Material Safety Data Sheets (MSDS/SDS).\n-   **Dates and Times:** Order dates, ship dates, Estimated Time of Arrival (ETA), delivery appointment times, receiving dates.\n-   **Receiving & Quality Control:** Dock numbers, receiving reports, goods receipt notes (GRN), damage reports, inspection results, discrepancy reports, quarantine notices.\n-   **Logistics Terms:** Incoterms (e.g., FOB, EXW, CIF), freight terms, customs clearance status.\n\n#### Information to Ignore (Noise):\n-   **Outbound Logistics:** Customer sales orders, finished goods picking lists, outbound shipping labels, proof of delivery to customers.\n-   **Marketing and Sales:** Sales forecasts, marketing materials, customer lists, advertising campaigns.\n-   **Human Resources:** Payroll documents, employee performance reviews, internal HR memos, job postings.\n-   **Production Floor Data:** Work-in-progress (WIP) reports, detailed manufacturing schedules, machine maintenance logs.\n-   **Corporate Finance:** Company-wide financial statements, profit & loss reports, shareholder communications, accounts payable/receivable summaries.\n-   **Product Development:** Engineering drawings (unless for quality inspection), R&D reports, product roadmaps."
}