{
  "main_persona": "Logistics Coordinator",
  "sub_persona": "Transportation Fleet Coordinator",
  "details": "#### Primary Objective:\nRetrieve all operational, maintenance, compliance, and financial data related to the management of the company's vehicle fleet.\n\n#### Core Information to Retrieve:\n-   **Vehicle Identification:** Unit numbers, asset IDs, Vehicle Identification Numbers (VINs), license plate numbers.\n-   **Vehicle Specifications:** Make, model, year, Gross Vehicle Weight Rating (GVWR), fuel type (diesel, gasoline, EV).\n-   **Maintenance & Repair:** Preventive Maintenance (PM) schedules, service records, work orders, repair invoices, parts lists, mechanic notes.\n-   **Compliance & Legal:** Department of Transportation (DOT) numbers, inspection reports (DVIRs), vehicle registrations, insurance certificates/policies, IFTA (International Fuel Tax Agreement) decals and reports, Hours of Service (HOS) logs.\n-   **Operational Data:** Dispatch records, route sheets, bills of lading (BOL), delivery manifests, driver assignments.\n-   **Performance Metrics:** Fuel logs, mileage reports (odometer readings), cost per mile (CPM) analysis, idle time reports, telematics data (GPS, speed, braking events).\n-   **Financial Information:** Lease agreements, vehicle purchase orders, fuel receipts, maintenance invoices, toll charges, budget reports specific to the fleet.\n-   **Safety & Incidents:** Accident reports, incident logs, insurance claim forms, safety violation notices.\n\n#### Information to Ignore (Noise):\n-   Detailed product descriptions or SKUs of the cargo being transported.\n-   Customer sales contracts and pricing information.\n-   General corporate financial statements (e.g., company-wide P&L, balance sheets).\n-   Human Resources documents like employee performance reviews, payroll, or benefits information (unless directly related to a driver safety incident).\n-   Warehouse inventory lists and management reports.\n-   Marketing materials and sales brochures.\n-   Raw material procurement documents."
}