{
  "main_persona": "Logistics Coordinator",
  "sub_persona": "E-commerce Fulfillment Coordinator",
  "details": "#### Primary Objective:\nRetrieve all operational data and documentation required to manage inventory, process customer orders, coordinate shipping, and handle returns within an e-commerce fulfillment center.\n\n#### Core Information to Retrieve:\n-   **Order & Shipment Identifiers:** Phrases like \"order number,\" \"tracking number,\" \"SKU\" (Stock Keeping Unit), \"RMA\" (Return Merchandise Authorization), \"Bill of Lading\" (BOL), \"Air Waybill\" (AWB).\n-   **Shipping & Carrier Data:** Shipping manifests, carrier names (e.g., \"FedEx,\" \"UPS,\" \"DHL,\" \"USPS\"), shipping rates, service levels (e.g., \"Ground,\" \"2-Day Air\"), customs declarations, freight classifications.\n-   **Warehouse Operations Documents:** Pick lists, packing slips, inventory count sheets, cycle count reports, receiving reports, put-away instructions.\n-   **Inventory Management Terms:** \"Bin location,\" \"stock levels,\" \"on-hand quantity,\" \"replenishment,\" \"safety stock,\" \"inventory adjustment,\" \"stock-out.\"\n-   **Performance Metrics (KPIs):** Data related to \"on-time shipping,\" \"order accuracy,\" \"fill rate,\" \"dock-to-stock time,\" \"cost per shipment,\" \"order cycle time.\"\n-   **Systems & Equipment:** References to \"WMS\" (Warehouse Management System), \"TMS\" (Transportation Management System), \"RF scanner,\" \"conveyor system,\" \"forklift.\"\n-   **Returns Processing:** Information on \"return reason codes,\" \"product inspection,\" \"restocking procedures,\" \"customer credit memo.\"\n-   **Contact Information:** Contact details for freight carriers, shipping brokers, packaging suppliers, and warehouse team leads.\n\n#### Information to Ignore (Noise):\n-   Customer-facing marketing materials, promotional emails, and ad campaigns.\n-   Product reviews, customer satisfaction surveys, and social media comments.\n-   Corporate financial reports, investor relations documents, and stock performance data.\n-   Product development roadmaps, engineering specifications, or manufacturing processes.\n-   Company-wide human resources policies, employee benefit packages, or corporate announcements.\n-   Sales forecasts and high-level strategic business plans.\n-   Legal contracts not directly related to shipping, warehousing, or logistics services."
}