{
  "main_persona": "Logistics Coordinator",
  "sub_persona": "Outbound Distribution Coordinator",
  "details": "#### Primary Objective:\nRetrieve all operational data, documentation, and communications required to manage the preparation, dispatch, and tracking of shipments from the warehouse to the final customer.\n\n#### Core Information to Retrieve:\n-   **Order Fulfillment Documents:** Sales orders, pick lists, packing slips, customer purchase order numbers (PO#).\n-   **Shipment & Carrier Data:** Shipping labels, tracking numbers (e.g., AWB, BOL), carrier names (e.g., \"UPS,\" \"FedEx,\" \"DHL\"), freight forwarder details, carrier pickup schedules, and rate sheets.\n-   **Shipping Instructions:** Phrases like \"ship to,\" \"delivery address,\" \"special handling instructions,\" \"liftgate required,\" \"delivery appointment.\"\n-   **Warehouse Operations:** Dock schedules, loading bay assignments, staging area reports, \"ready to ship\" notifications.\n-   **Export & Customs Documentation:** Commercial invoices, pro forma invoices, Harmonized System (HS) codes, certificate of origin, export declarations, AES filings.\n-   **Inventory Status:** \"Finished goods inventory\" levels, stock on hand for specific SKUs, lot numbers, \"available to ship\" reports.\n-   **Performance Metrics:** On-time delivery (OTD) reports, shipping cost analysis, carrier performance data, fill rate percentages, \"delivery exception\" reports.\n-   **Communication Records:** Emails or messages regarding shipment status, carrier delays, customer delivery confirmations, and address corrections.\n\n#### Information to Ignore (Noise):\n-   **Inbound Logistics:** Purchase orders (for raw materials), receiving reports, supplier invoices, inbound container manifests.\n-   **Internal Production:** Manufacturing schedules, work-in-progress (WIP) reports, bill of materials (BOM), raw material specifications.\n-   **Sales & Marketing:** Sales forecasts, marketing campaign materials, lead generation reports, customer prospecting data.\n-   **Corporate Finance:** Company-wide financial statements (P&L, balance sheets), accounts payable/receivable reports not directly tied to freight payment.\n-   **Human Resources:** Payroll information, employee performance reviews, internal HR announcements.\n-   **Procurement:** Sourcing information for raw materials, supplier contract negotiations."
}