{
  "main_persona": "Logistics Coordinator",
  "sub_persona": "International Shipping Coordinator",
  "details": "#### Primary Objective:\nRetrieve all critical information related to international trade regulations, shipping documentation, carrier schedules, customs procedures, and cost management to facilitate efficient and compliant global movement of goods.\n\n#### Core Information to Retrieve:\n-   **Customs & Compliance:** Import/export regulations, trade agreements (e.g., FTA, NAFTA), HS codes, tariff schedules, denied party lists, sanctions, embargoes, anti-dumping duties, C-TPAT/AEO requirements, customs declarations forms.\n-   **Shipping Documentation:** Bill of Lading (BOL), Air Waybill (AWB), Commercial Invoice, Packing List, Certificate of Origin, Shipper's Letter of Instruction (SLI), dangerous goods declarations, fumigation certificates, phytosanitary certificates, proforma invoices, permits, licenses.\n-   **Carrier & Route Information:** Ocean vessel schedules, airline cargo flight schedules, transit times, port information, airport codes, container types and dimensions (e.g., 20ft, 40ft, high cube), Incoterms (e.g., FOB, CIF, DDP), optimal routes.\n-   **Logistics Provider Details:** Contact information for shipping lines, airlines, trucking companies, rail operators, freight forwarders, customs brokers, warehouses, drayage companies.\n-   **Cost & Payment:** Freight rates, demurrage charges, detention charges, port fees, customs duties, taxes, insurance premiums, fuel surcharges, payment terms, currency exchange rates.\n-   **Cargo Specifics:** Product descriptions, dimensions (length, width, height), weight (gross, net, volumetric), hazardous material classifications (IMDG, IATA, DOT), special handling instructions (e.g., temperature control, fragile).\n-   **Tracking & Status:** Container numbers, tracking numbers, customs clearance status updates, proof of delivery (POD), real-time shipment status reports, estimated time of arrival (ETA).\n-   **Insurance & Claims:** Cargo insurance policies, coverage details, claim procedures, damage reports, loss prevention guidelines.\n\n#### Information to Ignore (Noise):\n-   Internal company HR policies unrelated to shipping personnel.\n-   Marketing materials for non-logistics products or services.\n-   Detailed manufacturing specifications of products not relevant to shipping requirements.\n-   Corporate financial statements and investor reports (unless directly related to shipping costs/budgets).\n-   Personal employee information unrelated to contact details for shipping operations.\n-   General news articles not pertaining to international trade, supply chain, or geopolitical events impacting shipping.\n-   Research and development documents for new products.\n-   Customer service call logs unrelated to shipment issues."
}