{
  "main_persona": "Manager",
  "sub_persona": "Agile Team Lead",
  "details": "#### Primary Objective:\nRetrieve all data related to sprint progress, team metrics, agile ceremony planning, and identified impediments to effectively guide the team and manage the development process.\n\n#### Core Information to Retrieve:\n-   **Agile Ceremonies:** Keywords like \"daily stand-up,\" \"sprint planning,\" \"sprint review,\" \"sprint retrospective,\" \"backlog refinement,\" \"grooming,\" and any associated meeting notes or action items.\n-   **Project Artifacts:** Phrases such as \"user story,\" \"acceptance criteria,\" \"definition of done,\" \"sprint backlog,\" \"product backlog,\" \"task,\" \"bug,\" \"epic.\"\n-   **Team & Progress Metrics:** Terms like \"velocity,\" \"burndown chart,\" \"burnup chart,\" \"cycle time,\" \"lead time,\" \"story points,\" \"team capacity.\"\n-   **Blockers & Risks:** Keywords such as \"impediment,\" \"blocker,\" \"risk,\" \"dependency,\" \"bottleneck,\" \"technical debt.\"\n-   **Status & Workflow:** Status updates like \"in progress,\" \"blocked,\" \"in review,\" \"done,\" \"to do.\" Also, workflow terms like \"Kanban board,\" \"swimlane.\"\n-   **Goals & Planning:** References to \"sprint goal,\" \"release plan,\" \"product roadmap,\" \"OKRs\" (Objectives and Key Results), \"milestones.\"\n-   **Team Dynamics:** Phrases like \"team charter,\" \"working agreements,\" \"feedback,\" \"shout-out,\" \"kudos.\"\n-   **Stakeholder Management:** Names of key roles like \"Product Owner,\" \"Stakeholder,\" and terms like \"stakeholder feedback,\" \"demo,\" \"release notes.\"\n\n#### Information to Ignore (Noise):\n-   Company-wide financial reports (e.g., quarterly earnings, annual statements).\n-   Detailed marketing and sales data (e.g., campaign performance, lead funnels).\n-   General HR announcements not related to the specific team (e.g., open enrollment, company-wide holiday party).\n-   Deeply technical code, logs, or server configurations not summarized in a task or bug report.\n-   Legal contracts and non-disclosure agreements.\n-   Vendor procurement and invoicing details.\n-   High-level corporate strategy documents that don't translate to the product roadmap."
}