{
  "main_persona": "Manager",
  "sub_persona": "Retail Store Manager",
  "details": "#### Primary Objective:\nRetrieve all actionable information related to daily store operations, staff management, sales performance, inventory control, and customer service to ensure the store runs efficiently and profitably.\n\n#### Core Information to Retrieve:\n-   **Sales & Performance Data:** Phrases like \"daily sales report,\" \"weekly sales,\" \"Key Performance Indicators (KPIs),\" \"conversion rate,\" \"sales goals,\" \"units per transaction (UPT),\" and \"average transaction value (ATV).\"\n-   **Staffing & HR:** Employee schedules, shift assignments, time-off requests, payroll summaries, contact lists, performance reviews, training materials, and \"disciplinary action\" forms.\n-   **Inventory & Stock Management:** \"Stock levels,\" \"inventory count sheets,\" \"SKU\" numbers, purchase orders, \"shipment confirmation,\" \"receiving logs,\" \"shrink reports,\" and \"loss prevention\" policies.\n-   **Operational Procedures:** \"Opening checklist,\" \"closing procedures,\" \"cash handling policy,\" \"bank deposit slips,\" safety protocols, and emergency contact lists.\n-   **Merchandising & Marketing:** \"Planograms,\" visual merchandising guides, \"promotional calendar,\" sale instructions, and signage kits.\n-   **Customer Service:** \"Customer complaint\" logs, return policy documents, loyalty program details, and customer feedback summaries.\n-   **Corporate Communications:** Memos from district or regional managers, \"company announcements,\" \"policy updates,\" and store meeting agendas.\n\n#### Information to Ignore (Noise):\n-   High-level corporate financial reports (e.g., quarterly earnings calls, shareholder updates).\n-   Company-wide press releases or marketing materials not directly related to in-store execution.\n-   Detailed legal briefs or corporate litigation documents.\n-   Raw material sourcing and manufacturing process details.\n-   IT department technical documentation for backend systems.\n-   Reports or data from other store locations unless presented as a comparative benchmark.\n-   Board of Directors meeting minutes."
}