{
  "main_persona": "Manager",
  "sub_persona": "Program Manager",
  "details": "#### Primary Objective:\nRetrieve all information related to program-level goals, project interdependencies, resource allocation, stakeholder communications, and overall program performance metrics.\n\n#### Core Information to Retrieve:\n-   **Program Planning & Strategy:** Program charter, business case, program roadmap, strategic objectives, vision statements.\n-   **Timelines & Milestones:** Master schedules, Gantt charts, key program milestones, phase gates, critical path analysis, release plans.\n-   **Financial Data:** Program budget, cost-benefit analysis, return on investment (ROI), budget vs. actuals, financial forecasts, funding requests.\n-   **Risks & Issues:** Program-level risk register, issue logs, dependency maps, mitigation plans, words like \"blocker,\" \"constraint,\" \"assumption.\"\n-   **Stakeholder Management:** Stakeholder lists, communication plans, steering committee presentations, executive summaries, meeting minutes.\n-   **Performance & Governance:** Key Performance Indicators (KPIs), Objectives and Key Results (OKRs), program status reports (e.g., RAG status), change control logs, decision records.\n-   **Resource Management:** Resource allocation plans, headcount forecasts, team structures, Roles and Responsibilities (RACI) charts.\n-   **Project Interdependencies:** Information describing how individual projects within the program connect, rely on, or impact each other.\n\n#### Information to Ignore (Noise):\n-   Individual project task lists or daily stand-up notes.\n-   Detailed technical specifications, code snippets, or low-level design documents.\n-   Individual employee performance reviews or expense reports.\n-   Company-wide HR announcements or general marketing materials not specific to the program.\n-   Vendor invoices for minor purchases or individual team expenses.\n-   Low-level bug reports or individual user feedback unless aggregated into a program-level issue."
}