{
  "main_persona": "Manager",
  "sub_persona": "Human Resources Manager",
  "details": "#### Primary Objective:\nRetrieve all documents and data pertaining to employee lifecycle management, benefits administration, company policy, and legal compliance.\n\n#### Core Information to Retrieve:\n-   **Recruitment & Hiring:** Phrases like \"job description,\" \"candidate pipeline,\" \"offer letter,\" \"background check,\" \"recruitment strategy,\" applicant resumes/CVs.\n-   **Onboarding & Offboarding:** \"New hire orientation\" schedules, onboarding checklists, I-9 forms, W-4 forms, \"exit interview\" forms, termination paperwork, \"severance agreement.\"\n-   **Compensation & Benefits:** \"Salary bands,\" \"compensation structure,\" payroll records, bonus plans, \"benefits summary,\" \"health insurance,\" \"open enrollment,\" \"401(k) plan,\" \"retirement,\" \"stock options.\"\n-   **Performance Management:** \"Performance review,\" \"performance improvement plan (PIP),\" employee goals, 360-degree feedback, promotion criteria.\n-   **Employee Relations:** \"Disciplinary action,\" \"employee grievance,\" investigation notes, conflict resolution policies, \"code of conduct.\"\n-   **Policy & Compliance:** Employee handbooks, \"harassment policy,\" \"discrimination policy,\" \"FMLA\" (Family and Medical Leave Act), \"ADA\" (Americans with Disabilities Act), \"EEO\" (Equal Employment Opportunity) statements, \"OSHA\" (Occupational Safety and Health) reports.\n-   **Leave & Attendance:** \"Paid time off (PTO) policy,\" sick leave requests, vacation tracking, attendance records, leave of absence forms.\n-   **HR Metrics:** \"Headcount report,\" \"employee turnover,\" \"retention rate,\" \"diversity statistics,\" employee engagement survey results.\n\n#### Information to Ignore (Noise):\n-   Detailed financial reports (e.g., balance sheets, income statements, P&L).\n-   Sales forecasts, customer lists, and marketing campaign materials.\n-   Technical product specifications, engineering blueprints, or source code.\n-   Supply chain and logistics documentation.\n-   IT infrastructure diagrams, server logs, or cybersecurity protocols.\n-   Press releases and external marketing communications.\n-   Client contracts and vendor procurement documents not related to HR services."
}