{
  "main_persona": "Marketing Manager",
  "sub_persona": "Growth Marketing Manager",
  "details": "#### Primary Objective:\nRetrieve all quantifiable data, performance metrics, customer analytics, and experimental results to identify and optimize opportunities for business growth across the entire customer funnel.\n\n#### Core Information to Retrieve:\n-   **Performance Metrics:** Terms like \"KPI\" (Key Performance Indicator), \"OKR\" (Objectives and Key Results), \"CPA\" (Cost Per Acquisition), \"CAC\" (Customer Acquisition Cost), \"LTV\" (Lifetime Value), \"ROAS\" (Return on Ad Spend), \"churn rate,\" \"retention rate,\" \"conversion rate,\" \"CTR\" (Click-Through Rate).\n-   **Channel Performance Reports:** Data related to \"SEO,\" \"PPC,\" \"social media advertising,\" \"content marketing,\" \"email marketing,\" \"affiliate marketing,\" and \"referral programs.\"\n-   **Funnel Analytics:** Keywords such as \"acquisition funnel,\" \"onboarding flow,\" \"user activation,\" \"AARRR metrics,\" \"pirate metrics,\" \"cohort analysis.\"\n-   **Experimentation Data:** Phrases like \"A/B test results,\" \"multivariate testing,\" \"growth experiment,\" \"hypothesis,\" \"control group,\" \"variant,\" \"statistical significance,\" \"uplift.\"\n-   **Customer & Market Data:** \"Customer personas,\" \"user segments,\" \"market research,\" \"competitor analysis,\" \"total addressable market (TAM),\" \"user feedback,\" \"NPS scores.\"\n-   **Revenue and Monetization:** Data on \"MRR\" (Monthly Recurring Revenue), \"ARPU\" (Average Revenue Per User), \"pricing models,\" \"upsell rates,\" \"cross-sell performance.\"\n-   **Tools and Platforms:** Reports and dashboards from \"Google Analytics,\" \"Google Ads,\" \"Facebook Ads Manager,\" \"HubSpot,\" \"Salesforce,\" \"Mixpanel,\" \"Amplitude,\" \"Optimizely.\"\n\n#### Information to Ignore (Noise):\n-   General brand-building material without quantifiable metrics (e.g., brand story narratives, mission statements).\n-   Internal HR documents like employee performance reviews, benefits information, or company-wide memos.\n-   Deeply technical engineering documents, server logs, or API documentation not directly related to user-facing features.\n-   Legal and compliance documents unrelated to marketing practices (e.g., patent filings, corporate governance).\n-   Detailed financial accounting reports like balance sheets or income statements (except for top-line revenue and marketing budget figures).\n-   Press releases and media clips focused on brand awareness rather than measurable traffic or conversions."
}