{
  "main_persona": "Marketing Manager",
  "sub_persona": "Content Marketing Manager",
  "details": "#### Primary Objective:\nRetrieve all information related to content strategy, creation processes, performance analytics, and distribution channels to inform and optimize content marketing efforts.\n\n#### Core Information to Retrieve:\n-   **Strategic Concepts:** Phrases like \"content strategy,\" \"marketing plan,\" \"editorial calendar,\" \"content pillars,\" \"target audience,\" \"buyer persona,\" \"customer journey map.\"\n-   **Content Formats:** Keywords such as \"blog post,\" \"whitepaper,\" \"ebook,\" \"case study,\" \"webinar,\" \"infographic,\" \"video,\" \"podcast,\" \"newsletter.\"\n-   **Performance Metrics & KPIs:** \"Page views,\" \"unique visitors,\" \"time on page,\" \"bounce rate,\" \"conversion rate,\" \"click-through rate (CTR),\" \"engagement rate,\" \"shares,\" \"comments,\" \"leads generated,\" \"Marketing Qualified Lead (MQL),\" \"Return on Investment (ROI).\"\n-   **SEO & Search Terms:** \"Search Engine Optimization (SEO),\" \"keyword research,\" \"search volume,\" \"backlinks,\" \"domain authority,\" \"SERP,\" \"topic clusters,\" \"meta description,\" \"organic traffic.\"\n-   **Tools and Platforms:** Mentions of \"Google Analytics,\" \"SEMrush,\" \"Ahrefs,\" \"HubSpot,\" \"Google Search Console,\" \"WordPress,\" \"content management system (CMS).\"\n-   **Distribution & Promotion:** \"Social media schedule,\" \"email marketing campaign,\" \"content distribution,\" \"content promotion,\" \"syndication,\" \"influencer outreach.\"\n-   **Planning & Budgets:** \"Content marketing budget,\" \"Q1 plan,\" \"content calendar,\" \"resource allocation,\" \"freelancer costs,\" \"agency proposal.\"\n-   **Competitive Intelligence:** \"Competitor analysis,\" \"content gap analysis,\" \"industry trends,\" \"market research.\"\n\n#### Information to Ignore (Noise):\n-   Raw engineering documents, software source code, or API documentation.\n-   Detailed financial statements (e.g., balance sheets, cash flow statements) not directly related to marketing budgets.\n-   Human Resources documents like payroll records, employee benefits information, or non-marketing job descriptions.\n-   Supply chain and logistics reports.\n-   Individual sales team commission reports or raw CRM data logs.\n-   Legal documents unrelated to marketing compliance (e.g., patents, corporate litigation).\n-   IT infrastructure reports, server logs, or network diagrams."
}