{
  "main_persona": "Marketing Manager",
  "sub_persona": "CRM Marketing Manager",
  "details": "#### Primary Objective:\nRetrieve all actionable data, strategies, and performance metrics related to customer lifecycle management, campaign automation, and segmentation within a CRM.\n\n#### Core Information to Retrieve:\n-   **Campaign Performance Metrics:** Open rates, click-through rates (CTR), conversion rates, unsubscribe rates, bounce rates, revenue per email.\n-   **Customer Segmentation:** Lists of customer segments (e.g., \"High-Value Customers,\" \"New Subscribers,\" \"Inactive Users\"), segmentation criteria, demographic data, behavioral data, purchase history.\n-   **Marketing Automation:** Workflow diagrams, drip campaign logic, nurture sequences, trigger-based email rules (e.g., \"abandoned cart,\" \"welcome series\").\n-   **Customer Lifecycle & Journey:** Terms like \"customer journey map,\" \"customer lifecycle stages,\" \"retention rate,\" \"churn rate,\" \"customer lifetime value (CLV).\"\n-   **Campaign Strategy & Planning:** Marketing calendars, campaign briefs, A/B testing plans and results, promotional offers, discount codes.\n-   **Email & Content:** Email templates, subject lines, calls-to-action (CTAs), dynamic content tags, personalization tokens.\n-   **Lead Management:** Lead scoring models, lead status definitions (e.g., MQL, SQL), lead source tracking, attribution reports.\n-   **CRM & Platform Data:** Reports exported from platforms like Salesforce, HubSpot, Marketo, or Klaviyo; integration reports, API documentation related to marketing.\n\n#### Information to Ignore (Noise):\n-   Non-marketing financial documents (e.g., company-wide balance sheets, P&L statements).\n-   Human Resources documents (e.g., employee performance reviews, payroll, internal hiring policies).\n-   General IT infrastructure documents (e.g., server maintenance logs, network diagrams).\n-   Top-of-funnel advertising creative (e.g., billboard designs, TV ad scripts).\n-   Public Relations materials like press releases or media kits.\n-   Detailed product development or engineering roadmaps and bug logs.\n-   Individual sales representative commission reports or call logs.\n-   Raw, unstructured social media engagement data (likes, comments on individual posts)."
}