{
  "main_persona": "Marketing Manager",
  "sub_persona": "Field Marketing Manager",
  "details": "#### Primary Objective:\nRetrieve all actionable information for planning, executing, budgeting, and measuring the performance of regional marketing campaigns, events, and partnerships.\n\n#### Core Information to Retrieve:\n-   **Event Logistics:** Phrases like \"tradeshow,\" \"conference,\" \"roadshow,\" \"user group,\" \"exhibit schedule,\" \"booth number,\" \"venue contract,\" \"floor plan,\" \"run of show,\" \"AV order,\" \"catering menu.\"\n-   **Budget and Finance:** Keywords such as \"budget,\" \"forecast,\" \"spend,\" \"ROI,\" \"cost per lead,\" \"invoice,\" \"purchase order,\" \"expense report.\"\n-   **Lead Generation:** Attendee lists, registration reports, lead capture forms, MQL (Marketing Qualified Lead) definitions, post-event lead summary.\n-   **Sales Enablement:** Localized sales collateral, product one-pagers, regional case studies, presentation decks, talk tracks.\n-   **Vendor & Partner Management:** Vendor quotes, partner agreements, co-marketing plans, sponsorship packages, contact lists for suppliers.\n-   **Promotional Materials:** Swag inventory lists, shipping tracking numbers, brochure order forms, booth graphics specifications.\n-   **Performance Metrics:** Regional campaign performance reports, Key Performance Indicators (KPIs), event attendance numbers, pipeline influence reports.\n-   **Regional Strategy:** Territory plans, target account lists, local market analysis, competitor event schedules.\n\n#### Information to Ignore (Noise):\n-   High-level corporate financial reports (e.g., annual reports, shareholder letters).\n-   Product development roadmaps and detailed engineering specifications.\n-   Internal HR documents like company-wide performance reviews or benefits administration.\n-   National or global brand-level advertising campaign data not tied to a specific region or event.\n-   Technical SEO audit reports and website backlink analysis.\n-   Raw software code or IT infrastructure documentation.\n-   Board of directors meeting minutes."
}