{
  "main_persona": "Marketing Manager",
  "sub_persona": "Communications Marketing Manager",
  "details": "#### Primary Objective:\nRetrieve all information related to brand messaging, public relations, content performance, media contacts, and communication strategies to manage the company's public voice and narrative.\n\n#### Core Information to Retrieve:\n-   **Public Relations (PR) materials:** Keywords like \"press release,\" \"media alert,\" \"media inquiry,\" \"press kit,\" \"spokesperson,\" \"media training.\"\n-   **Content & Messaging Documents:** \"Content calendar,\" \"editorial calendar,\" \"messaging framework,\" \"brand voice guidelines,\" \"style guide,\" \"key messages,\" \"talking points.\"\n-   **Communication Performance Metrics:** Campaign reports, media monitoring reports, sentiment analysis, engagement rates, click-through rates (for newsletters/announcements), content reach, share of voice.\n-   **Media & Influencer Data:** Media contact lists, journalist names, outlet names, influencer collaboration details, partnership agreements.\n-   **Internal Communications:** Drafts and final versions of \"internal announcements,\" \"company newsletters,\" \"all-hands meeting\" scripts, employee communications.\n-   **Crisis Communications:** \"Crisis communication plan,\" \"holding statement,\" \"reactive statement,\" \"reputation management\" reports.\n-   **Social Media Content:** Social media copy, campaign hashtags, community management guidelines, social media listening reports.\n-   **Strategic Documents:** \"Communications strategy,\" \"PR plan,\" \"content strategy,\" \"go-to-market plan\" (communications section).\n\n#### Information to Ignore (Noise):\n-   Raw sales data, individual lead information, and CRM records.\n-   Detailed financial accounting documents (e.g., balance sheets, P&L statements) not directly related to the marketing budget.\n-   Highly technical product development documents, engineering schematics, or source code.\n-   Supply chain and logistics reports.\n-   Human Resources documents like payroll, individual performance reviews, or benefits administration.\n-    granular SEO data like backlink profiles or technical site audit reports.\n-   Configuration details for paid advertising campaigns (e.g., Google Ads bid strategies)."
}