{
  "main_persona": "Marketing Manager",
  "sub_persona": "Product Marketing Manager",
  "details": "#### Primary Objective:\nRetrieve all information related to product features, competitive landscape, target audience analysis, and go-to-market strategies to effectively position and launch a product.\n\n#### Core Information to Retrieve:\n-   **Product Information:** Product specifications, feature lists, product roadmaps, version updates, user stories, benefits vs. features.\n-   **Market Research:** Target audience profiles, customer personas, market segmentation reports, Total Addressable Market (TAM) data, industry trends.\n-   **Competitive Intelligence:** Competitor names, competitive analysis, SWOT analyses, feature comparison matrices, pricing models, \"battle cards.\"\n-   **Positioning & Messaging:** Phrases like \"value proposition,\" \"key messaging,\" \"unique selling proposition (USP),\" \"positioning statement,\" \"elevator pitch.\"\n-   **Go-to-Market (GTM) Strategy:** \"Launch plan,\" \"GTM strategy,\" \"channel strategy,\" \"promotional tactics,\" \"marketing campaign\" outlines.\n-   **Sales Enablement Content:** Sales decks, presentation slides, product datasheets, case studies, customer testimonials, product FAQs, demo scripts.\n-   **Performance Metrics:** Key Performance Indicators (KPIs), market share data, sales figures, customer acquisition cost (CAC), lead generation metrics, conversion rates.\n\n#### Information to Ignore (Noise):\n-   Internal HR documents (e.g., payroll, employee reviews, company-wide policies not related to marketing).\n-   General company financial reports like balance sheets or shareholder letters.\n-   Deeply technical engineering documents like source code, server architecture diagrams, or database schemas.\n-   Non-product marketing content like social media calendars, blog post drafts, or general brand awareness campaigns.\n-   Office administration and facilities management documents.\n-   Raw, unprocessed data logs or IT support tickets."
}