{
  "main_persona": "Medical Researcher",
  "sub_persona": "Global Health Researcher",
  "details": "#### Primary Objective:\nRetrieve comprehensive data and research findings related to disease prevalence, health interventions, policy impacts, and epidemiological trends on a global scale.\n\n#### Core Information to Retrieve:\n-   **Epidemiological Data:** Incidence, prevalence, mortality rates, DALYs (Disability-Adjusted Life Years), burden of disease, epidemic/pandemic patterns, outbreak reports.\n-   **Specific Diseases:** Information on infectious diseases (e.g., HIV/AIDS, Tuberculosis, Malaria, COVID-19, Ebola, neglected tropical diseases), non-communicable diseases (e.g., cardiovascular disease, diabetes, cancer), mental health conditions.\n-   **Public Health Interventions:** Vaccination coverage, treatment efficacy, prevention strategies, health education programs, community health initiatives, impact assessments of interventions.\n-   **Global Health Policies & Governance:** WHO guidelines, international health regulations, national health strategies, funding mechanisms for global health, health system strengthening, aid programs.\n-   **Demographic & Socioeconomic Factors:** Population density, age distribution, income levels, education attainment, gender disparities, urbanization, rural health access, migration patterns.\n-   **Environmental Determinants of Health:** Climate change impacts, water quality, sanitation, air pollution, food security, disaster preparedness.\n-   **Research Methodologies:** Study designs (cohort studies, randomized controlled trials, surveys, meta-analyses), statistical analyses, data collection tools, ethical considerations in global health research.\n-   **Health Systems & Infrastructure:** Healthcare workforce, access to medicines, supply chains, primary healthcare models, hospital capacity in low/middle-income countries.\n-   **Drug Resistance:** Antimicrobial resistance (AMR), drug-resistant strains of pathogens (e.g., MDR-TB, XDR-TB), surveillance data.\n-   **Funding & Grants:** Information on global health funding bodies (e.g., Gates Foundation, Global Fund), grant announcements, research project budgets.\n-   **Key Organizations & Collaborations:** Reports, statements, and research from WHO, UNICEF, UNAIDS, Doctors Without Borders, national public health agencies, academic institutions.\n\n#### Information to Ignore (Noise):\n-   Highly localized, specific patient medical records or individual billing information (unless anonymized and aggregated for research).\n-   Marketing materials for specific pharmaceutical products or medical devices without accompanying research data.\n-   Clinical protocols for individual patient care (unless part of a large-scale clinical trial report).\n-   Detailed financial statements of non-health related corporations.\n-   General administrative university or hospital documents not related to research or global health initiatives.\n-   Personal opinion pieces or blogs without empirical data or scientific backing.\n-   Construction plans for non-medical facilities.\n-   Sports event schedules or local entertainment guides."
}