{
  "main_persona": "Medical Researcher",
  "sub_persona": "Basic Science Medical Researcher",
  "details": "#### Primary Objective:\nRetrieve detailed information on fundamental biological mechanisms, experimental methodologies, molecular pathways, and genetic factors from scientific literature and research documents.\n\n#### Core Information to Retrieve:\n-   **Experimental Methods & Techniques:** Phrases like \"materials and methods,\" \"experimental procedures,\" \"protocol.\" Specific techniques like \"PCR,\" \"Western Blot,\" \"ELISA,\" \"immunohistochemistry,\" \"flow cytometry,\" \"CRISPR,\" \"mass spectrometry,\" \"next-generation sequencing (NGS),\" \"confocal microscopy.\"\n-   **Molecular & Cellular Components:** Keywords like \"gene,\" \"protein,\" \"receptor,\" \"enzyme,\" \"ligand,\" \"DNA,\" \"RNA,\" \"plasmid,\" \"vector,\" \"transcription factor.\"\n-   **Biological Pathways & Processes:** Terms like \"cell signaling,\" \"signal transduction,\" \"apoptosis,\" \"cell cycle,\" \"metabolic pathway,\" \"gene expression,\" \"protein synthesis,\" \"mechanism of action.\" Specific pathway names like \"mTOR pathway,\" \"MAPK signaling,\" \"NF-kB pathway.\"\n-   **Model Organisms & Cell Lines:** References to \"mouse model,\" \"zebrafish,\" \"C. elegans,\" \"Drosophila,\" and specific cell line names like \"HEK293,\" \"HeLa,\" \"Jurkat cells.\"\n-   **Data & Results:** Tables, graphs, figures, and charts showing quantitative data. Keywords like \"p-value,\" \"statistical significance,\" \"fold change,\" \"concentration,\" \"in vitro,\" \"in vivo.\"\n-   **Reagents and Equipment:** Names of specific antibodies, chemical compounds, growth media, and manufacturers (e.g., \"Thermo Fisher,\" \"Sigma-Aldrich,\" \"Promega\").\n-   **Scientific Concepts:** Phrases like \"hypothesis,\" \"proposed model,\" \"mechanism,\" \"discussion,\" \"future directions.\"\n\n#### Information to Ignore (Noise):\n-   **Clinical Trial Data:** Information on human trials, including \"Phase I,\" \"Phase II,\" \"Phase III,\" \"patient recruitment,\" \"inclusion/exclusion criteria,\" \"informed consent,\" \"placebo-controlled.\"\n-   **Epidemiological & Public Health Studies:** Population-level data, including \"incidence,\" \"prevalence,\" \"risk factors,\" \"cohort study,\" \"case-control study,\" \"meta-analysis.\"\n-   **Healthcare Administration & Policy:** Topics like \"hospital management,\" \"healthcare costs,\" \"insurance billing,\" \"medical coding (ICD-10),\" \"standard of care,\" \"treatment guidelines.\"\n-   **Patient-Facing Information:** Patient case reports, anecdotal evidence, drug marketing materials, and information intended for a lay audience.\n-   **Grant Administration & Budgets:** Sections on \"budget justification,\" \"financial statements,\" \"overhead costs,\" and administrative paperwork unrelated to the scientific methods or findings.\n-   **Press Releases & News Articles:** Summaries of research findings intended for the general public."
}