{
  "main_persona": "Medical Researcher",
  "sub_persona": "Medical Researcher",
  "details": "#### Primary Objective:\nRetrieve scientific articles, clinical trial data, research methodologies, and funding opportunities relevant to medical advancements and disease understanding.\n\n#### Core Information to Retrieve:\n-   **Research Publications:** Journal articles, preprints, systematic reviews, meta-analyses, clinical guidelines, conference abstracts, research protocols.\n-   **Clinical Trial Data:** Study designs (e.g., \"randomized controlled trial,\" \"cohort study\"), patient demographics, inclusion/exclusion criteria, efficacy outcomes, safety profiles, adverse events, statistical analysis, P-values, confidence intervals.\n-   **Disease Information:** Disease names (e.g., \"diabetes,\" \"cancer,\" \"Alzheimer's\"), pathophysiology, epidemiology, risk factors, diagnostic criteria, staging, prognosis, prevalence, incidence.\n-   **Therapeutics & Interventions:** Drug names, dosages, mechanisms of action, drug-drug interactions, treatment protocols, surgical techniques, device specifications, non-pharmacological interventions.\n-   **Biomarkers & Diagnostics:** Specific biomarker names, genetic markers, imaging techniques (e.g., \"MRI,\" \"CT scan\"), laboratory test parameters, diagnostic accuracy.\n-   **Methodology & Statistics:** Research methodologies, statistical methods (e.g., \"ANOVA,\" \"regression analysis\"), data collection methods, sample size calculations, power analysis.\n-   **Ethical & Regulatory:** IRB approvals, informed consent forms, ethical guidelines, FDA/EMA regulations, Good Clinical Practice (GCP) guidelines.\n-   **Funding & Grants:** Grant calls, funding agency guidelines, successful grant proposals (if publicly available), research collaboration opportunities.\n-   **Genomics & Proteomics:** Gene sequences, protein structures, gene expression data, single nucleotide polymorphisms (SNPs), CRISPR technology.\n-   **Pre-clinical Data:** In vitro studies, animal model data, toxicology reports, pharmacokinetics.\n\n#### Information to Ignore (Noise):\n-   Patient billing information or detailed financial records of healthcare providers.\n-   General hospital administrative documents unrelated to research or patient care.\n-   Marketing materials for pharmaceutical products or medical devices.\n-   Personal medical records without anonymization or specific research context.\n-   General news articles not originating from scientific journals or reputable health organizations.\n-   Political or lobbying documents related to healthcare policy without direct scientific impact.\n-   Employee handbooks or human resources documents for medical institutions.\n-   Construction plans or facility management reports for hospitals/labs."
}