{
  "main_persona": "Medical Researcher",
  "sub_persona": "Specialized Disease Researcher",
  "details": "#### Primary Objective:\nRetrieve comprehensive scientific and clinical data concerning the pathophysiology, molecular mechanisms, genetic factors, clinical trial results, and treatment protocols for a specific disease.\n\n#### Core Information to Retrieve:\n-   **Clinical Trial Data:** Phrases like \"clinical trial,\" \"Phase I/II/III,\" \"randomized controlled trial (RCT),\" \"study design,\" \"inclusion/exclusion criteria,\" \"primary/secondary endpoint.\"\n-   **Statistical & Outcome Data:** \"p-value,\" \"confidence interval,\" \"hazard ratio,\" \"Kaplan-Meier curve,\" \"survival rate,\" \"efficacy,\" \"safety profile,\" \"adverse events.\"\n-   **Pathophysiology & Molecular Biology:** Keywords such as \"pathophysiology,\" \"mechanism of action (MoA),\" \"molecular pathway,\" \"signaling cascade,\" \"etiology,\" \"biomarker.\"\n-   **Genetics & Genomics:** \"genetic mutation,\" \"gene expression,\" \"polymorphism,\" \"allele,\" \"genomic sequencing,\" \"proteomics,\" \"metabolomics.\"\n-   **Pharmacology:** Specific drug names (generic and brand), \"pharmacokinetics (PK),\" \"pharmacodynamics (PD),\" \"dosage,\" \"regimen,\" \"standard of care.\"\n-   **Methodology:** Descriptions of lab techniques (e.g., \"western blot,\" \"PCR,\" \"ELISA,\" \"mass spectrometry\"), animal models, and statistical analysis methods.\n-   **Key Study Sections:** Content from \"Abstract,\" \"Methods,\" \"Results,\" and \"Discussion\" sections of research papers.\n-   **Epidemiology:** \"incidence,\" \"prevalence,\" \"risk factors,\" \"cohort study.\"\n\n#### Information to Ignore (Noise):\n-   **Financial & Administrative Information:** University or hospital financial statements, investor relations reports, grant budget breakdowns, billing codes.\n-   **General Public-Facing Content:** Press releases, patient testimonials, marketing brochures for drugs or clinics, general news articles.\n-   **Non-Research Institutional Data:** Hospital staffing schedules, departmental memos, general policy documents unrelated to research ethics.\n-   **Ancillary Publication Details:** Author biographies, acknowledgments sections, conflict of interest statements, journal submission guidelines, copyright notices.\n-   **Medical Information for Unrelated Diseases:** Case studies, trial data, or biological mechanisms for diseases outside the specific research focus."
}