{
  "main_persona": "Medical Researcher",
  "sub_persona": "Translational Medical Scientist",
  "details": "#### Primary Objective:\nRetrieve detailed scientific data, experimental methodologies, and clinical trial information that connect fundamental biological discoveries to potential therapeutic applications in human disease.\n\n#### Core Information to Retrieve:\n-   **Molecular Targets & Pathways:** Gene names (e.g., \"TP53,\" \"BRAF\"), protein names, signaling pathways (e.g., \"mTOR pathway,\" \"Wnt signaling\"), \"drug target,\" \"biomarker,\" \"mechanism of action.\"\n-   **Experimental Models:** Terms like \"in vitro,\" \"in vivo,\" \"animal model,\" \"mouse model,\" \"xenograft,\" \"organoid,\" specific cell lines (e.g., \"HEK293,\" \"MCF-7\").\n-   **Laboratory Techniques & Assays:** \"CRISPR-Cas9,\" \"RNA-Seq,\" \"Western Blot,\" \"PCR,\" \"Flow Cytometry,\" \"Mass Spectrometry,\" \"High-Throughput Screening (HTS).\"\n-   **Therapeutic Modalities:** \"Small molecule,\" \"monoclonal antibody (mAb),\" \"ADC (antibody-drug conjugate),\" \"CAR-T,\" \"gene therapy,\" \"siRNA,\" \"vaccine.\"\n-   **Clinical Trial Data:** \"Phase I,\" \"Phase II,\" \"Phase III,\" \"clinical trial,\" \"protocol,\" \"NCT number,\" \"patient cohort,\" \"inclusion/exclusion criteria.\"\n-   **Pharmacology & Efficacy Metrics:** \"Pharmacokinetics (PK),\" \"pharmacodynamics (PD),\" \"dose-response,\" \"IC50,\" \"efficacy,\" \"toxicity,\" \"adverse events (AEs).\"\n-   **Clinical Endpoints:** \"Overall Survival (OS),\" \"Progression-Free Survival (PFS),\" \"Objective Response Rate (ORR),\" \"biomarker validation.\"\n-   **Regulatory & Funding Terms:** \"Investigational New Drug (IND),\" \"FDA,\" \"EMA,\" \"proof-of-concept,\" \"preclinical data,\" \"grant application,\" \"NIH.\"\n-   **Data & Figures:** Tables of results, statistical analyses (p-values, confidence intervals), dose-escalation charts, Kaplan-Meier curves.\n\n#### Information to Ignore (Noise):\n-   General hospital administration documents (e.g., staffing rosters, budget reports).\n-   Patient-facing educational materials and brochures.\n-   Medical billing codes and insurance claim forms.\n-   Basic science research with no stated or implied clinical relevance (e.g., ecology, plant biology, fundamental physics).\n-   Case reports that only describe clinical presentation without mechanistic investigation.\n-   Conference logistics (e.g., travel arrangements, session schedules).\n-   University press releases or general news articles not containing primary data.\n-   Ethical review board meeting minutes (unless directly tied to a specific study protocol of interest)."
}