{
  "main_persona": "Medical Researcher",
  "sub_persona": "Computational Biologist / Bioinformatician",
  "details": "#### Primary Objective:\nRetrieve detailed information on genomic, proteomic, and other high-throughput biological data, along with the algorithms, software tools, and statistical methods used for their analysis in a medical context.\n\n#### Core Information to Retrieve:\n-   **Omics Data & Techniques:** Keywords like \"genomics,\" \"transcriptomics,\" \"proteomics,\" \"metabolomics,\" \"epigenomics,\" \"RNA-Seq,\" \"ChIP-Seq,\" \"whole genome sequencing (WGS),\" \"whole exome sequencing (WES),\" \"mass spectrometry,\" \"microarray.\"\n-   **Algorithms & Models:** Phrases such as \"machine learning,\" \"deep learning,\" \"neural network,\" \"random forest,\" \"support vector machine (SVM),\" \"Hidden Markov Model (HMM),\" \"clustering algorithm,\" \"classification model.\"\n-   **Bioinformatics Processes:** \"Sequence alignment,\" \"variant calling,\" \"differential expression analysis,\" \"gene set enrichment analysis (GSEA),\" \"pathway analysis,\" \"genome-wide association study (GWAS),\" \"network analysis,\" \"protein-protein interaction (PPI).\"\n-   **Software & Databases:** Names of specific tools like \"R,\" \"Bioconductor,\" \"Python,\" \"Perl,\" \"GATK,\" \"BLAST,\" \"Bowtie,\" \"SAMtools.\" Names of databases like \"GenBank,\" \"Ensembl,\" \"UCSC Genome Browser,\" \"KEGG,\" \"Gene Ontology (GO),\" \"PDB.\"\n-   **Statistical Concepts:** \"p-value,\" \"q-value,\" \"false discovery rate (FDR),\" \"fold change,\" \"Bayesian statistics,\" \"log-likelihood ratio.\"\n-   **Data Formats & Identifiers:** File extensions like \".fasta\", \".fastq\", \".bam\", \".sam\", \".vcf\". Gene and protein identifiers (e.g., \"TP53,\" \"EGFR,\" \"UniProt ID\").\n-   **Biological Keywords:** \"Biomarker discovery,\" \"drug target,\" \"pharmacogenomics,\" \"gene regulation,\" \"single-nucleotide polymorphism (SNP),\" \"copy number variation (CNV),\" \"somatic mutation.\"\n-   **Data Visualization:** References to \"heatmap,\" \"volcano plot,\" \"Manhattan plot,\" \"Kaplan-Meier curve,\" \"network diagram.\"\n\n#### Information to Ignore (Noise):\n-   Detailed wet-lab experimental protocols (e.g., reagent mixing, cell culture maintenance, buffer recipes).\n-   Administrative information such as grant funding details, budget justifications, and institutional financial reports.\n-   Author contribution lists, acknowledgements, and conflict of interest statements.\n-   Clinical case studies or patient narratives that lack associated molecular or computational data.\n-   General public health announcements or hospital administration memos.\n-   Introductory, textbook-level definitions of basic biological concepts.\n-   Advertisements for lab equipment not directly related to data generation (e.g., centrifuges, incubators, pipettes)."
}