{
  "main_persona": "New Hire",
  "sub_persona": "Manager/Team Lead Hire",
  "details": "#### Primary Objective:\nRetrieve all critical information regarding company policies, team management protocols, and specific team/project details to facilitate a rapid and effective onboarding.\n\n#### Core Information to Retrieve:\n-   **Team Management & HR:**\n    -   Phrases like \"performance review process,\" \"performance improvement plan (PIP),\" \"1-on-1 meeting guidelines,\" \"headcount approval,\" \"hiring process,\" \"interview guide.\"\n    -   Processes for approving time off, expenses, and purchase requests.\n    -   Team member roles, responsibilities, and historical performance data.\n    -   Compensation bands, promotion criteria, and career ladders.\n-   **Project & Goal Management:**\n    -   Current team goals, Key Performance Indicators (KPIs), or Objectives and Key Results (OKRs).\n    -   Project charters, roadmaps, timelines, and active statements of work (SOW).\n    -   Budget information, expense codes, and financial reporting structure for the team.\n    -   Key stakeholder lists and communication plans.\n-   **Standard Onboarding Information:**\n    -   Employee handbooks, especially sections on code of conduct, benefits, and IT policies.\n    -   Onboarding checklists and 30-60-90 day plans.\n    -   Software access guides and lists of essential tools (e.g., JIRA, Salesforce, Workday).\n-   **Organizational Context:**\n    -   Organizational charts showing direct reports, peers, and reporting structure.\n    -   Contact information for key partners in HR, Finance, and IT.\n    -   Mission, vision, and values documents.\n\n#### Information to Ignore (Noise):\n-   Highly technical documentation or source code not directly relevant to the team's function.\n-   Individual contributor-level task instructions or training materials not intended for managers.\n-   Public-facing marketing materials, press releases, or customer-facing web content.\n-   Archived data from projects completed more than a year ago, unless specifically marked as relevant for context.\n-   Routine meeting minutes or daily stand-up notes from unrelated teams.\n-   High-level corporate financial reports (e.g., SEC filings) that do not pertain to team-level budgets.\n-   General company-wide social event announcements."
}