{
  "main_persona": "New Hire",
  "sub_persona": "Startup New Hire",
  "details": "#### Primary Objective:\nRetrieve all essential onboarding documents, company information, role-specific responsibilities, and operational procedures to facilitate a fast and effective integration into the startup.\n\n#### Core Information to Retrieve:\n-   **Onboarding Materials:** \"Onboarding checklist,\" \"new hire paperwork,\" \"IT setup,\" \"first week schedule,\" \"30-60-90 day plan.\"\n-   **Company Information:** \"Company mission,\" \"vision statement,\" \"company values,\" \"pitch deck,\" \"investor presentation,\" \"our story.\"\n-   **Organizational Structure:** \"Org chart,\" \"team structure,\" \"department heads,\" \"who's who,\" \"key contacts.\"\n-   **Role & Responsibilities:** \"Job description,\" \"responsibilities,\" \"OKRs\" (Objectives and Key Results), \"KPIs\" (Key Performance Indicators), \"performance review process.\"\n-   **HR & Benefits:** \"Employee handbook,\" \"PTO policy,\" \"vacation,\" \"expense policy,\" \"health insurance,\" \"benefits summary,\" \"stock option plan,\" \"equity grant,\" \"401k.\"\n-   **Product & Strategy:** \"Product roadmap,\" \"user personas,\" \"competitor analysis,\" \"market research,\" \"tech stack,\" \"brand guidelines.\"\n-   **Internal Processes & Tools:** \"Communication guidelines,\" \"Slack/Teams channels,\" \"Jira/Asana workflow,\" \"Confluence/Notion pages,\" \"meeting cadence,\" \"style guide.\"\n\n#### Information to Ignore (Noise):\n-   Deeply technical architectural diagrams or code from unrelated departments.\n-   Archived or deprecated documents (e.g., \"v1_old,\" \"archive,\" \"2019_roadmap\").\n-   Raw, unaudited financial data like detailed P&L statements or investor cap tables.\n-   Individual legal contracts with specific clients or vendors.\n-   Routine, day-to-day administrative chatter or meeting notes from other teams.\n-   Performance reviews or confidential information related to other employees."
}