{
  "main_persona": "New Hire",
  "sub_persona": "Administrative/Operations New Hire",
  "details": "#### Primary Objective:\nRetrieve all essential information about company policies, operational procedures, internal systems, and key contacts to facilitate rapid onboarding and job competency.\n\n#### Core Information to Retrieve:\n-   **Onboarding & HR Documents:** Employee handbook, new hire checklist, HR policies, benefits enrollment guides, code of conduct.\n-   **People & Organization:** Organizational charts (\"org chart\"), employee directories, contact lists, key personnel names and titles (e.g., \"Office Manager,\" \"Head of IT\").\n-   **Standard Operating Procedures (SOPs):** Phrases like \"how to submit,\" \"procedure for,\" \"guide to.\" Specific processes like travel booking, expense reporting, mail handling, and supply ordering.\n-   **Systems & Software:** Names of core software (e.g., Slack, Microsoft 365, Concur, Workday), login instructions, user guides, IT help desk contact information, and procedures for submitting support tickets.\n-   **Office & Facilities Information:** Office maps, seating charts, meeting room booking instructions, emergency procedures, evacuation plans, building access rules.\n-   **Administrative Forms & Templates:** Expense reports, purchase order forms, time-off request forms, official letterhead templates.\n-   **Vendor & Supplier Information:** Lists of approved vendors, contact information for catering, office supplies, couriers, and building management.\n-   **Company Calendars & Schedules:** Official holiday schedule, key company meeting dates, payroll schedule.\n\n#### Information to Ignore (Noise):\n-   Detailed financial reports, investor relations documents, or SEC filings.\n-   In-depth product development documentation, source code, or technical schematics.\n-   External marketing materials, press releases, and sales team reports.\n-   Board of Directors meeting minutes and high-level strategic planning documents.\n-   Client-specific project files and confidential customer data.\n-   Archived documents from more than 2 years ago (e.g., old versions of handbooks, expired vendor contracts)."
}