{
  "main_persona": "New Hire",
  "sub_persona": "Executive/Leadership Hire",
  "details": "#### Primary Objective:\nRetrieve critical onboarding information and high-level strategic documents to accelerate the new leader's integration and effectiveness.\n\n#### Core Information to Retrieve:\n-   **Strategic Documents:** Phrases like \"strategic plan,\" \"3-year plan,\" \"5-year plan,\" \"annual operating plan (AOP),\" \"mission and vision,\" \"company goals.\"\n-   **Organizational Structure:** Organizational charts (org charts), key stakeholder lists, bios for the executive leadership team (ELT) and Board of Directors.\n-   **Financial Performance:** Quarterly and annual financial reports, P&L statements, budget summaries, investor relations presentations.\n-   **Key Metrics:** Dashboards, KPI reports, OKR (Objectives and Key Results) documents.\n-   **Market & Competition:** Competitive analysis, market share reports, SWOT analysis, industry trend summaries.\n-   **Onboarding & HR:** First 30-60-90 day plan, employee handbook, code of conduct, benefits enrollment guides, retirement plan information (401k, pension).\n-   **Governance & Policy:** Board meeting minutes, executive committee meeting minutes, travel and expense policies, IT security policies.\n-   **Major Initiatives:** High-level project charters, product roadmaps, go-to-market (GTM) strategy documents, major partnership agreements.\n\n#### Information to Ignore (Noise):\n-   Individual contributor performance reviews.\n-   Low-level project management documents (e.g., daily stand-up notes, individual task lists).\n-   Raw data sets (e.g., transaction logs, server logs, raw survey data).\n-   Routine administrative communications (e.g., office maintenance notices, general IT help desk tickets).\n-   Department-level social event planning.\n-   Highly technical schematics or source code not relevant to strategic oversight.\n-   Archived or superseded policies and reports from more than 3-5 years prior, unless explicitly foundational."
}