{
  "main_persona": "New Hire",
  "sub_persona": "Technical New Hire",
  "details": "#### Primary Objective:\nRetrieve all technical documentation, onboarding materials, and internal process guides necessary for a new technical employee to integrate into their role and contribute to the codebase.\n\n#### Core Information to Retrieve:\n-   **Onboarding & Setup:** Phrases like \"new hire checklist,\" \"first week,\" \"30-60-90 day plan,\" \"dev environment setup,\" \"local machine configuration.\"\n-   **System Access:** Instructions for \"VPN setup,\" \"SSH key generation,\" \"requesting access\" to systems like GitHub, Jira, Confluence, AWS, Azure, or GCP.\n-   **Technical Architecture:** Documents titled \"System Architecture,\" \"Architecture Overview,\" \"Data Flow Diagram,\" \"Microservice map,\" \"Database Schema.\"\n-   **Code Standards & Practices:** Guides on \"coding standards,\" \"style guides,\" \"best practices,\" \"code review process,\" \"pull request template.\"\n-   **Development Workflow:** Information on the \"Software Development Life Cycle (SDLC),\" \"Agile methodology,\" \"Scrum process,\" \"sprint planning,\" \"ticketing workflow,\" \"Jira board.\"\n-   **CI/CD & Deployment:** Documentation for \"CI/CD pipeline,\" \"Jenkins jobs,\" \"build process,\" \"deployment steps,\" \"release schedule,\" \"hotfix process,\" \"rollback procedure.\"\n-   **API & Services:** \"API documentation,\" \"REST endpoints,\" \"GraphQL schema,\" \"service contracts,\" \"API keys.\"\n-   **Testing:** Information about \"testing strategy,\" \"unit tests,\" \"integration testing,\" \"end-to-end (E2E) tests,\" \"QA process.\"\n-   **Key Contacts & Resources:** \"Engineering Org Chart,\" \"team roster,\" \"tech lead,\" \"on-call schedule,\" key Slack/Teams channels (e.g., #dev-help, #infra-support).\n\n#### Information to Ignore (Noise):\n-   Company-wide financial reports (e.g., quarterly earnings, annual reports).\n-   Sales and marketing materials, including campaign plans, market analysis, and lead generation reports.\n-   Client-facing legal contracts and statements of work (SOWs).\n-   HR documents not relevant to personal onboarding (e.g., executive compensation plans, company-wide performance metrics).\n-   Archived documentation for deprecated projects or legacy systems no longer in use.\n-   Non-technical meeting minutes (e.g., sales meetings, marketing syncs)."
}