{
  "main_persona": "New Hire",
  "sub_persona": "Career Transitioner",
  "details": "#### Primary Objective:\nRetrieve all essential onboarding materials, company policies, role-specific duties, and foundational business context to facilitate a rapid and successful integration into a new company and industry.\n\n#### Core Information to Retrieve:\n-   **Onboarding & HR Documents:** Employee handbook, benefits summary (health, dental, 401k), PTO policy, 30-60-90 day plans, onboarding checklists, expense reporting guidelines.\n-   **Company Structure & Culture:** Organizational charts (\"org chart\"), team rosters, key personnel bios, mission/vision/values statements.\n-   **Role-Specific Responsibilities:** The user's specific job description, Standard Operating Procedures (SOPs), Key Performance Indicators (KPIs), performance review processes and forms.\n-   **Essential Terminology:** Glossaries of acronyms, definitions of industry-specific jargon, internal project code names.\n-   **Project & Process Information:** Current project documentation, examples of past successful projects, team workflow diagrams, recent team meeting minutes.\n-   **Key Contacts & Systems:** Company directory, IT support contact and procedures, software login instructions, guides for core platforms (e.g., Slack, Jira, Salesforce, MS Teams).\n-   **Business Context:** Product or service descriptions, primary customer profiles, lists of key competitors, recent company-wide announcements or \"all-hands\" meeting notes.\n-   **Training & Development:** Links to internal training portals (LMS), guides for professional development, available course materials or workshop schedules.\n\n#### Information to Ignore (Noise):\n-   Detailed financial reports, SEC filings, or shareholder communications.\n-   Highly technical documents unrelated to the new role (e.g., source code, engineering schematics, scientific data).\n-   Archived information from more than two years prior (e.g., old project files, deprecated policies).\n-   Granular, day-to-day operational data from unrelated departments.\n-   Board of Directors meeting minutes or confidential M&A strategy documents.\n-   External media coverage or press clippings about the company.\n-   Casual social event planning documents or non-essential announcements."
}