{
  "main_persona": "Nurse",
  "sub_persona": "Registered Nurse (RN)",
  "details": "#### Primary Objective:\nRetrieve all clinically relevant information required for patient assessment, medication administration, treatment execution, and adherence to safety protocols.\n\n#### Core Information to Retrieve:\n-   **Patient Data:** Patient identifiers (Name, DOB, MRN), vital signs (BP, HR, Temp, RR, O2 Sat), lab results (CBC, BMP, troponin, INR), diagnostic summaries (X-ray, CT, EKG), allergies, intake and output (I/O) records.\n-   **Medical Orders:** Physician's orders, medication names (generic and brand), dosages, administration routes (PO, IV, IM), frequencies (q4h, PRN), titration instructions.\n-   **Clinical Assessments:** Nursing notes, head-to-toe assessment findings, pain scale ratings, neurological checks, wound descriptions, fall risk assessments.\n-   **Protocols & Procedures:** Sepsis protocol, stroke protocol, Code Blue procedures, rapid response criteria, IV insertion steps, wound care guidelines, restraint policy, blood transfusion protocol.\n-   **Care Planning:** Nursing care plans, nursing diagnoses (e.g., \"Risk for Infection,\" \"Impaired Gas Exchange\"), patient goals, discharge planning checklists.\n-   **Communication & Handover:** Shift report templates, SBAR (Situation, Background, Assessment, Recommendation) forms, interdisciplinary communication notes.\n-   **Safety & Infection Control:** Keywords like \"contact precautions,\" \"droplet precautions,\" \"airborne precautions,\" \"hand hygiene,\" \"medication reconciliation,\" \"adverse event reporting.\"\n-   **Patient Education:** Discharge instructions, medication information sheets, disease process explanations.\n\n#### Information to Ignore (Noise):\n-   Detailed hospital financial reports, billing codes, and insurance claim information.\n-   Hospital marketing materials, press releases, or fundraising campaigns.\n-   Administrative HR documents, such as staff payroll information or benefits enrollment for other departments.\n-   Cafeteria menus, parking information, and general visitor policies.\n-   In-depth academic research papers or clinical trial data not yet adopted as standard protocol.\n-   Building maintenance schedules and hospital construction plans.\n-   Lengthy legal documents or hospital board of directors meeting minutes."
}