{
  "main_persona": "Nurse",
  "sub_persona": "Nurse Educator",
  "details": "#### Primary Objective:\nRetrieve comprehensive information pertaining to nursing education curriculum development, pedagogical strategies, clinical competencies, accreditation standards, and professional development for nurses.\n\n#### Core Information to Retrieve:\n-   **Curriculum Development:** \"Course outlines,\" \"syllabus,\" \"learning objectives,\" \"competency-based education,\" \"curriculum design,\" \"program evaluation,\" \"student learning outcomes.\"\n-   **Pedagogical Strategies:** \"Simulation scenarios,\" \"active learning strategies,\" \"case studies,\" \"experiential learning,\" \"clinical teaching methods,\" \"formative assessment,\" \"summative assessment,\" \"clinical reasoning.\"\n-   **Clinical Content & Best Practices:** \"Evidence-based practice guidelines,\" \"nursing protocols,\" \"patient safety initiatives,\" \"clinical competencies,\" \"skill checklists,\" \"pharmacology updates,\" \"disease management.\"\n-   **Accreditation & Regulatory:** \"Accreditation standards\" (e.g., CCNE, ACEN), \"licensure requirements,\" \"state board of nursing regulations,\" \"nursing practice acts,\" \"continuing education units (CEUs).\"\n-   **Student Assessment & Evaluation:** \"Rubrics,\" \"grading criteria,\" \"clinical performance evaluation,\" \"remediation plans,\" \"NCLEX pass rates,\" \"test item analysis.\"\n-   **Educational Technology:** \"Learning management systems (LMS),\" \"simulation equipment,\" \"virtual reality in nursing education,\" \"e-learning modules.\"\n-   **Professional Development:** \"Faculty development workshops,\" \"teaching methodologies for healthcare professionals,\" \"mentor programs for nursing faculty,\" \"scholarly activities in nursing education.\"\n-   **Research in Nursing Education:** \"Educational research methodologies,\" \"outcomes research in nursing education,\" \"trends in nursing education.\"\n-   **Ethical & Legal Aspects:** \"Ethical considerations in nursing education,\" \"academic integrity policies,\" \"patient privacy (HIPAA) in teaching contexts.\"\n\n#### Information to Ignore (Noise):\n-   Individual patient medical charts and highly specific patient treatment plans (unless anonymized and presented as a case study for educational purposes).\n-   Detailed financial reports of healthcare institutions unrelated to educational budgeting.\n-   Marketing and advertising materials for non-medical products or services.\n-   Non-nursing specific academic research papers (e.g., pure physics, literature reviews of non-health topics).\n-   Union negotiation documents or labor disputes unrelated to academic employment terms.\n-   Specific building construction plans or facilities management details unless directly related to educational lab or simulation center design.\n-   Personal employee performance reviews for non-educational staff."
}