{
  "main_persona": "Nurse",
  "sub_persona": "Emergency Room (ER) Nurse",
  "details": "#### Primary Objective:\nRetrieve critical medical protocols, drug information, patient assessment guides, and emergency procedures to support immediate and effective patient care in the emergency room.\n\n#### Core Information to Retrieve:\n-   **Emergency Protocols & Algorithms:** Triage guidelines (e.g., ESI levels), stroke alerts, sepsis protocols, cardiac arrest algorithms (ACLS, PALS, NRP), trauma activation criteria, rapid sequence intubation (RSI) checklists.\n-   **Medication Information:** Emergency drug dosages (including mg/kg for pediatrics), administration routes (IV, IO, IM), contraindications, antidotes/reversal agents, infusion/drip rate charts (e.g., for vasopressors).\n-   **Assessment Tools & Scales:** Glasgow Coma Scale (GCS), NIH Stroke Scale (NIHSS), pain scales, vital sign parameters for all age groups (neonate, pediatric, adult, geriatric), signs and symptoms of critical conditions (e.g., MI, PE, CVA, DKA).\n-   **Clinical Procedures:** Instructions for IV/IO access, wound care and closure, splinting and immobilization, EKG lead placement, catheter insertion, chest tube management.\n-   **Critical Lab Values:** Normal and critical ranges for Troponin, D-Dimer, Lactate, ABG, CBC, BMP, and blood glucose.\n-   **Equipment Use:** Defibrillator energy settings, IV pump settings, ventilator basics, pacemaker functions.\n-   **Contact Information:** Phone numbers for on-call specialists (Cardiology, Neurology, Surgery), poison control, and transfer centers.\n\n#### Information to Ignore (Noise):\n-   Long-term patient care plans or chronic disease management guides.\n-   Hospital billing codes, insurance information, and administrative paperwork.\n-   In-depth academic research papers, dissertations, and theoretical medical studies.\n-   Hospital marketing materials, press releases, or community newsletters.\n-   Non-clinical hospital policies (e.g., HR, IT, vacation policies).\n-   Detailed patient discharge instructions (unless specifically for ER discharge).\n-   Schedules for non-emergent, elective procedures."
}