{
  "main_persona": "Nurse",
  "sub_persona": "Public Health Nurse",
  "details": "#### Primary Objective:\nRetrieve all information on community health trends, disease surveillance, preventative care guidelines, public health policies, and available community resources to promote and protect the health of the population.\n\n#### Core Information to Retrieve:\n-   **Disease Surveillance & Epidemiology:** Data on \"outbreaks,\" \"case rates,\" \"morbidity,\" \"mortality,\" \"communicable diseases,\" \"epidemiological reports,\" \"disease clusters.\" Specific diseases like influenza, tuberculosis, measles, COVID-19.\n-   **Health Promotion & Education:** Materials on \"health education,\" \"vaccination clinics,\" \"immunization schedules,\" \"health fairs,\" \"smoking cessation programs,\" \"nutrition guidelines,\" \"substance abuse prevention.\"\n-   **Community Resources:** Contact information, locations, and services for \"community health centers,\" \"WIC programs,\" \"food banks,\" \"homeless shelters,\" \"mental health services,\" \"low-cost clinics,\" and \"support groups.\"\n-   **Vulnerable Populations:** Information related to \"maternal and child health,\" \"geriatric health,\" \"low-income families,\" \"homeless populations,\" \"immigrant and refugee health,\" and \"social determinants of health.\"\n-   **Public Health Policy & Guidelines:** Documents from the \"CDC,\" \"WHO,\" \"local health department.\" Phrases like \"public health law,\" \"reporting requirements,\" \"mandated reporting,\" \"environmental health standards,\" \"screening guidelines.\"\n-   **Health Statistics:** \"Community health assessments,\" \"demographic data,\" \"health indicators,\" \"risk factor surveys,\" \"birth and death rates.\"\n\n#### Information to Ignore (Noise):\n-   Individual patient medical charts, surgical notes, or hospital admission/discharge summaries.\n-   Detailed information on acute, in-hospital patient care (e.g., ICU protocols, anesthesia records).\n-   Hospital financial reports, billing codes, and insurance claim details for individual patients.\n-   Highly specialized bench research or lab-based biomedical studies (e.g., cellular biology, genetic sequencing).\n-   Pharmaceutical company marketing materials and stock performance reports.\n-   Internal hospital administrative documents like staff schedules or committee meeting minutes."
}