{
  "main_persona": "Nurse",
  "sub_persona": "Operating Room (OR) Nurse",
  "details": "#### Primary Objective:\nRetrieve critical information related to surgical procedures, patient safety protocols, operating room equipment, and sterile techniques to support patient care during the perioperative phases.\n\n#### Core Information to Retrieve:\n-   **Surgical Procedures:** Names of surgeries (e.g., \"appendectomy,\" \"craniotomy,\" \"total hip arthroplasty\"), step-by-step procedural guides, surgeon preference cards, anatomical landmarks.\n-   **Patient Safety Protocols:** Phrases like \"Surgical Safety Checklist,\" \"Time Out,\" \"Sign In,\" \"Sign Out,\" patient identification procedures, wrong-site surgery prevention.\n-   **Sterile & Aseptic Technique:** Guidelines for \"surgical scrub,\" \"gowning and gloving,\" \"maintaining the sterile field,\" \"draping,\" and sterilization methods (autoclave, Sterrad).\n-   **Instrumentation & Equipment:** Names of surgical instruments (e.g., \"Metzenbaum,\" \"DeBakey,\" \"Bovie\"), setup guides for equipment (e.g., laparoscopy tower, surgical microscope), and equipment troubleshooting.\n-   **Medications:** Common OR drugs (e.g., \"Propofol,\" \"Rocuronium,\" \"Ancef,\" \"Lidocaine\"), local anesthetics, reversal agents, antibiotic administration times, and medication labeling standards.\n-   **Emergency Procedures:** Protocols for \"malignant hyperthermia,\" \"cardiac arrest,\" \"Code Blue,\" \"massive hemorrhage protocol,\" fire safety in the OR.\n-   **Specimen Handling:** Procedures for collecting, labeling, and sending surgical specimens to pathology.\n-   **Surgical Counts:** Policies and procedures for \"sponge count,\" \"sharps count,\" and \"instrument count.\"\n-   **Patient Positioning:** Guides for supine, prone, lithotomy, and lateral positions, including pressure point protection and nerve injury prevention.\n-   **OR Roles & Communication:** Definitions of \"circulating nurse,\" \"scrub nurse,\" RNFA (Registered Nurse First Assistant), and communication handoffs (e.g., to PACU).\n\n#### Information to Ignore (Noise):\n-   Hospital financial reports, billing codes, and insurance information.\n-   Long-term patient care plans for chronic conditions unrelated to the immediate surgery.\n-   Outpatient clinic schedules and non-surgical floor nursing protocols.\n-   Hospital marketing materials, newsletters, or press releases.\n-   Human Resources documents regarding payroll, benefits, or general hospital staff policies.\n-   Information on non-surgical departments like pediatrics, psychiatry, or long-term care facilities.\n-   Minutes from hospital administrative or board meetings."
}