{
  "main_persona": "Nurse",
  "sub_persona": "School Nurse",
  "details": "#### Primary Objective:\nRetrieve all critical information related to student health records, emergency protocols, medication administration, health education, and school-wide health policies to ensure student well-being and a safe learning environment.\n\n#### Core Information to Retrieve:\n-   **Student Health Records:** Individual health plans (IHPs), emergency action plans (EAPs), allergy information, chronic disease management (diabetes, asthma, epilepsy), immunization records, medication authorization forms, health assessment results.\n-   **Medical Protocols & Procedures:** First aid guidelines, CPR/AED protocols, emergency medical response procedures (anaphylaxis, seizures, head injuries), infectious disease control guidelines (e.g., lice, flu, COVID-19), wound care instructions.\n-   **Medication Management:** Specific medication dosages, administration schedules, storage requirements, parental consent forms for medication, controlled substance logs.\n-   **Health Education Materials:** Public health advisories, nutrition guidelines, hygiene practices, mental health resources for students, puberty education materials, substance abuse prevention information.\n-   **Communication & Reporting:** Parent/guardian contact information, physician notes and prescriptions, incident reports (injuries, illnesses), confidential student health alerts for teachers, communication logs.\n-   **School Policies & Regulations:** Medication administration policies, exclusion criteria for illness, accident reporting procedures, emergency preparedness plans (fire drills, lockdowns), HIPAA/FERPA guidelines related to health information, state health department regulations for schools.\n-   **Supply & Inventory Management:** Lists of medical supplies, first aid kit contents, AED locations and maintenance logs, stock of over-the-counter medications.\n-   **Staff Training:** Requirements for CPR/First Aid certification, EpiPen training, diabetes management training for staff.\n\n#### Information to Ignore (Noise):\n-   General academic curricula (e.g., math, history lesson plans, reading lists).\n-   Non-health related school event flyers (e.g., sports team schedules, drama club announcements, unless related to injury or physical activity).\n-   School financial statements or budget reports not directly related to health services.\n-   Detailed construction plans for new school buildings (unless related to health office layout or accessibility).\n-   Extensive human resources documentation for non-medical staff (e.g., payroll, benefits unrelated to health insurance forms).\n-   Fundraising reports or alumni newsletters.\n-   Cafeteria menus without specific allergy or nutritional breakdowns."
}