{
  "main_persona": "Nurse",
  "sub_persona": "Home Health Nurse",
  "details": "#### Primary Objective:\nRetrieve all patient-specific clinical data, treatment orders, and care plan information required to deliver medical care and support within a patient's home environment.\n\n#### Core Information to Retrieve:\n-   **Patient-Specific Data:** Patient name, date of birth (DOB), address, emergency contacts, primary diagnosis, comorbidities, and known allergies.\n-   **Physician's Orders:** Explicit instructions for care, including phrases like \"Plan of Care,\" \"MD Orders,\" \"Treatment Protocol.\"\n-   **Medication Administration Record (MAR):** Lists of medications, dosages, frequency, and route of administration (e.g., \"PO,\" \"IM,\" \"IV\").\n-   **Vital Signs History:** Tables or logs of blood pressure (BP), heart rate (HR), temperature, respiratory rate (RR), and oxygen saturation (SpO2).\n-   **Wound Care Instructions:** Specifics on dressing changes, type of dressing, wound location, measurements, and appearance (e.g., \"Stage 3 pressure ulcer,\" \"wet-to-dry dressing\").\n-   **Lab & Test Results:** Recent blood work (CBC, BMP, INR), culture results, and imaging summaries.\n-   **Therapy Notes:** Orders and progress notes from Physical Therapy (PT), Occupational Therapy (OT), or Speech-Language Pathology (SLP).\n-   **Dietary Requirements:** Specific diet orders such as \"Low Sodium Diet,\" \"1800 Calorie ADA,\" \"NPO,\" or \"Thickened Liquids.\"\n-   **Patient & Family Education:** Documentation of topics taught, like \"diabetic self-care,\" \"medication management,\" or \"fall prevention.\"\n-   **Advance Directives:** Information on \"DNR\" (Do Not Resuscitate), \"Living Will,\" or \"Healthcare Power of Attorney.\"\n-   **Contact Information:** Phone numbers for the Primary Care Physician (PCP), specialists, pharmacy, and Durable Medical Equipment (DME) supplier.\n\n#### Information to Ignore (Noise):\n-   **Billing and Insurance Details:** Insurance claim forms, billing codes, explanation of benefits (EOB), and patient account statements.\n-   **Hospital/Agency Administrative Memos:** Internal staff meeting minutes, departmental memos not related to patient care, employee HR information.\n-   **General Medical Research:** Academic articles or clinical trial data not directly related to the current patient's plan of care.\n-   **Detailed Equipment Manuals:** Technical repair guides or engineering specifications for medical equipment.\n-   **Pharmaceutical Marketing:** Promotional materials or advertisements for medications.\n-   **Hospitality Information:** Hospital cafeteria menus, gift shop information, or visitor policies from a previous hospital stay."
}