{
  "main_persona": "Nurse",
  "sub_persona": "Certified Registered Nurse Anesthetist (CRNA)",
  "details": "#### Primary Objective:\nRetrieve critical clinical information for the safe administration of anesthesia, patient monitoring, and management during perioperative periods.\n\n#### Core Information to Retrieve:\n-   **Anesthetic Agents & Drugs:**\n    -   Specific drug names: Propofol, Sevoflurane, Desflurane, Etomidate, Ketamine, Fentanyl, Remifentanil, Midazolam, Rocuronium, Vecuronium, Succinylcholine, Lidocaine, Bupivacaine.\n    -   Drug classes: Volatile anesthetics, intravenous hypnotics, neuromuscular blocking agents, opioids, benzodiazepines, local anesthetics, vasopressors (e.g., phenylephrine, ephedrine).\n    -   Pharmacological data: \"Dosage,\" \"concentration,\" \"contraindications,\" \"adverse effects,\" \"drug interactions,\" \"half-life,\" \"onset,\" \"duration.\"\n-   **Anesthesia Techniques & Procedures:**\n    -   Phrases: \"General anesthesia,\" \"regional anesthesia,\" \"spinal,\" \"epidural,\" \"nerve block\" (e.g., \"brachial plexus block\"), \"total intravenous anesthesia (TIVA),\" \"monitored anesthesia care (MAC).\"\n    -   Airway management: \"Intubation,\" \"laryngoscopy,\" \"endotracheal tube (ETT),\" \"laryngeal mask airway (LMA),\" \"difficult airway,\" \"Mallampati score,\" \"rapid sequence induction (RSI).\"\n-   **Patient Monitoring & Physiology:**\n    -   Keywords: \"Hemodynamics,\" \"EKG/ECG,\" \"blood pressure,\" \"SpO2,\" \"pulse oximetry,\" \"capnography,\" \"end-tidal CO2 (ETCO2),\" \"bispectral index (BIS),\" \"temperature monitoring.\"\n    -   Physiological concepts: \"Mean arterial pressure (MAP),\" \"cardiac output,\" \"central venous pressure (CVP),\" \"gas exchange.\"\n-   **Patient Assessment & Safety:**\n    -   Preoperative data: \"ASA physical status,\" \"NPO status,\" \"allergies,\" \"comorbidities\" (e.g., \"hypertension,\" \"diabetes,\" \"COPD\"), \"medication list.\"\n    -   Emergency protocols: \"Malignant hyperthermia protocol,\" \"local anesthetic systemic toxicity (LAST),\" \"anaphylaxis,\" \"ACLS/PALS algorithms.\"\n    -   Postoperative care: \"PACU discharge criteria,\" \"pain scales,\" \"post-operative nausea and vomiting (PONV),\" \"emergence delirium.\"\n-   **Surgical & Procedural Context:**\n    -   Case types: \"Cardiac surgery,\" \"neurosurgery,\" \"obstetric,\" \"pediatric,\" \"trauma.\"\n    -   Surgical instruments that may impact anesthesia (e.g., \"electrocautery\").\n\n#### Information to Ignore (Noise):\n-   Hospital administrative and financial documents (e.g., billing codes, insurance forms, departmental budgets, marketing materials).\n-   Human resources information (e.g., staff schedules, payroll, benefits information).\n-   General hospital policies unrelated to clinical care (e.g., parking, cafeteria menus).\n-   Long-term patient care plans outside the perioperative window (e.g., long-term rehab, social work notes).\n-   Detailed research methodologies or statistical analyses in academic papers; focus on conclusions and clinical application summaries.\n-   Information related to other medical specialties that do not directly impact anesthetic management (e.g., dermatology, psychiatry notes, routine physical therapy)."
}