{
  "main_persona": "Nurse",
  "sub_persona": "Nurse Practitioner (NP)",
  "details": "#### Primary Objective:\nRetrieve evidence-based clinical guidelines, diagnostic criteria, treatment protocols, and pharmacological information to support patient diagnosis, treatment, and management.\n\n#### Core Information to Retrieve:\n-   **Pharmacology:** Drug names (generic and brand), dosages, indications, contraindications, side effects, drug interactions, and formulary status.\n-   **Clinical Guidelines:** Evidence-based practice guidelines (e.g., from AAFP, ACC/AHA), standard of care protocols, and treatment algorithms.\n-   **Diagnostics:** Differential diagnoses lists, interpretation of lab results (normal/abnormal values), imaging report summaries, and physical exam findings.\n-   **Patient Information:** Patient charts, medical histories, allergy lists, SOAP notes, and current medication lists.\n-   **Disease & Condition Data:** Pathophysiology, signs and symptoms, and prognostic information for acute and chronic illnesses.\n-   **Screening Tools:** Standardized screening questionnaires (e.g., PHQ-9 for depression), developmental screening milestones, and preventative health schedules (e.g., USPSTF recommendations).\n-   **Billing & Coding:** ICD-10 codes (diagnosis) and CPT codes (procedures).\n-   **Procedures:** Instructions or refreshers for common clinical procedures (e.g., suturing, incision and drainage, joint injections).\n-   **Referral Criteria:** Guidelines on when to refer patients to specialists.\n\n#### Information to Ignore (Noise):\n-   Hospital administration documents (e.g., budget reports, marketing materials, departmental meeting minutes).\n-   Human Resources policies and general hospital staff announcements.\n-   Basic science or preclinical research not yet applied in clinical practice.\n-   Detailed insurance claim processing data and patient billing disputes.\n-   Vendor advertisements for non-medical equipment.\n-   Architectural plans or facility maintenance logs.\n-   IT support manuals for non-clinical software."
}