{
  "main_persona": "Operations Manager",
  "sub_persona": "Logistics Operations Manager",
  "details": "#### Primary Objective:\nRetrieve all operational data and documentation concerning inventory management, warehousing, transportation, and carrier performance to ensure efficient and cost-effective logistics.\n\n#### Core Information to Retrieve:\n-   **Shipping & Transportation Documents:** Keywords like \"bill of lading\" (BOL), \"shipping manifest,\" \"packing slip,\" \"proof of delivery\" (POD), \"freight invoice,\" \"rate confirmation.\"\n-   **Inventory Management:** Phrases like \"inventory levels,\" \"stock on hand,\" \"cycle count report,\" \"SKU velocity,\" \"safety stock,\" \"inventory turnover.\"\n-   **Carrier & Vendor Data:** Carrier names, tracking numbers, \"on-time performance,\" \"carrier scorecard,\" freight rates, fuel surcharges, service level agreements (SLAs).\n-   **Warehouse Operations:** \"Receiving reports,\" \"picking lists,\" \"put-away records,\" \"warehouse layout,\" \"bin locations,\" \"dock schedule.\"\n-   **Performance Metrics (KPIs):** \"Cost per shipment,\" \"on-time delivery percentage,\" \"order fill rate,\" \"dock-to-stock time,\" \"order accuracy,\" \"damaged goods report.\"\n-   **Logistics Systems & Technology:** References to \"TMS\" (Transportation Management System), \"WMS\" (Warehouse Management System), \"ERP\" (Enterprise Resource Planning), \"RFID,\" and \"barcode scanner\" reports or errors.\n-   **Compliance & Regulations:** \"Customs documents,\" \"import/export declarations,\" \"tariffs,\" \"HAZMAT\" (Hazardous Materials) forms, \"OSHA\" safety reports.\n\n#### Information to Ignore (Noise):\n-   Marketing and sales reports, customer demographic data, and advertising campaign details.\n-   General corporate financial statements (e.g., annual reports, profit/loss statements not specific to logistics costs).\n-   Human Resources documents like employee reviews, payroll information, or company-wide social event announcements.\n-   Product research and development (R&D) specifications.\n-   High-level corporate strategy memos that do not discuss supply chain operations.\n-   IT department reports unrelated to logistics systems (e.g., email server updates, cybersecurity policies for corporate finance)."
}