{
  "main_persona": "Operations Manager",
  "sub_persona": "Healthcare Operations Manager",
  "details": "#### Primary Objective:\nRetrieve all information pertaining to the efficient, compliant, and patient-centered management of daily operations within a healthcare facility.\n\n#### Core Information to Retrieve:\n-   **Operational Metrics & Performance:** Patient flow data, bed utilization rates, surgical suite turnover times, waiting times (ER, clinic), appointment scheduling efficiency, productivity reports, throughput analysis.\n-   **Regulatory Compliance:** HIPAA guidelines, OSHA regulations, CMS requirements, JCAHO/The Joint Commission accreditation standards, state health department licensing, infection control protocols, medical waste disposal procedures.\n-   **Resource Management:** Staffing schedules, physician credentialing status, equipment inventory, supply chain logistics, vendor contracts, budget reports, cost-benefit analyses of new technologies or services.\n-   **Quality Improvement Initiatives:** Patient satisfaction scores, HCAHPS data, readmission rates, incident reports, root cause analyses, quality dashboards, continuous improvement methodologies (Lean, Six Sigma in healthcare).\n-   **Facility & Equipment Management:** Preventative maintenance schedules for medical equipment, facility safety inspection reports, emergency preparedness plans, HVAC system reports, space utilization studies.\n-   **Staffing & Training:** Employee schedules, staffing ratios, training requirements for new procedures/equipment, mandatory compliance training records, HR policies related to healthcare staff.\n-   **Information Technology (IT) & Systems:** EMR/EHR system performance reports, system downtime logs, IT security policies, telemedicine implementation plans, data integration specifications.\n-   **Patient Experience:** Patient feedback surveys, complaint logs, discharge planning procedures, patient education materials (from an operational standpoint).\n-   **Clinical Support Operations:** Lab turnaround times, radiology scheduling protocols, pharmacy inventory management, transport service efficiency.\n\n#### Information to Ignore (Noise):\n-   Deep clinical research papers or medical journal articles unrelated to operational processes.\n-   Individual patient medical records or highly specific diagnostic imaging (unless aggregated for operational metrics).\n-   Pharmaceutical drug development pipelines or detailed chemical compound analyses.\n-   Marketing materials for non-healthcare products or services.\n-   General financial market news or stock performance outside of healthcare industry trends.\n-   Abstract academic theories unrelated to healthcare management.\n-   Political campaign literature not directly impacting healthcare policy or funding.\n-   Detailed architectural blueprints of buildings not yet under operational consideration."
}