{
  "main_persona": "Operations Manager",
  "sub_persona": "Manufacturing Operations Manager",
  "details": "#### Primary Objective:\nRetrieve all data related to production metrics, process efficiency, quality control, safety compliance, and supply chain logistics to optimize manufacturing operations.\n\n#### Core Information to Retrieve:\n-   **Production Metrics:** Keywords like \"production volume,\" \"daily output,\" \"throughput,\" \"cycle time,\" \"takt time,\" \"units per hour (UPH),\" \"production schedule,\" \"shift reports.\"\n-   **Quality Control Data:** Phrases like \"quality assurance (QA),\" \"quality control (QC),\" \"defect rate,\" \"scrap rate,\" \"rework,\" \"first pass yield (FPY),\" \"non-conformance report (NCR),\" \"ISO 9001,\" \"Six Sigma.\"\n-   **Process Efficiency:** Terms like \"Overall Equipment Effectiveness (OEE),\" \"downtime,\" \"changeover time,\" \"lean manufacturing,\" \"Kaizen,\" \"5S,\" \"value stream map,\" \"continuous improvement.\"\n-   **Safety and Compliance:** Acronyms and terms such as \"OSHA,\" \"EHS (Environment, Health, Safety),\" \"safety incident report,\" \"lost time injury (LTI),\" \"near miss,\" \"personal protective equipment (PPE),\" \"lockout/tagout (LOTO).\"\n-   **Maintenance Information:** \"Preventive maintenance (PM),\" \"predictive maintenance (PdM),\" \"maintenance schedule,\" \"work order,\" \"Mean Time To Repair (MTTR),\" \"Mean Time Between Failures (MTBF),\" equipment manuals.\n-   **Inventory and Supply Chain:** \"Inventory levels,\" \"work-in-progress (WIP),\" \"raw materials,\" \"finished goods,\" \"bill of materials (BOM),\" \"supplier performance,\" \"on-time delivery,\" \"shipping logs.\"\n-   **Cost and Budgeting:** \"Cost of goods sold (COGS),\" \"operating expenses (OPEX),\" \"labor cost,\" \"material variance,\" \"departmental budget,\" \"overhead.\"\n-   **Personnel Management:** \"Staffing levels,\" \"shift schedules,\" \"overtime hours,\" \"operator training records,\" \"skill matrix.\"\n\n#### Information to Ignore (Noise):\n-   Corporate-level financial reports (e.g., annual shareholder reports, stock performance).\n-   Sales and marketing strategy documents, market analysis, and customer demographics.\n-   High-level research and development (R&D) documentation for future products.\n-   Detailed legal documents unrelated to operations (e.g., patent filings, corporate litigation).\n-   Company-wide HR policies not directly related to floor operations (e.g., 401k plans, executive compensation).\n-   Public relations and press releases."
}