{
  "main_persona": "Operations Manager",
  "sub_persona": "Service Operations Manager",
  "details": "#### Primary Objective:\nRetrieve all information related to service delivery performance, operational workflows, resource management, and customer satisfaction to optimize efficiency and quality.\n\n#### Core Information to Retrieve:\n-   **Performance Metrics:** Key Performance Indicators (KPIs), Service Level Agreements (SLAs), dashboards, performance scorecards.\n-   **Specific KPIs:** First Call Resolution (FCR), Average Handle Time (AHT), Customer Satisfaction (CSAT), Net Promoter Score (NPS), ticket volume, ticket backlog, response time, resolution time.\n-   **Process Documents:** Standard Operating Procedures (SOPs), workflow diagrams, process maps, incident management protocols, escalation procedures.\n-   **Resource Management:** Staffing schedules, shift rotas, workforce management (WFM) reports, capacity planning, skill matrices, team rosters.\n-   **Quality & Compliance:** Quality Assurance (QA) reports, call monitoring scores, compliance checklists, audit findings, Root Cause Analysis (RCA) reports.\n-   **Customer Interaction Data:** Support tickets, service requests, customer complaint logs, customer feedback summaries.\n-   **Financials:** Operational budgets, cost-per-contact or cost-per-ticket analysis, overtime reports, vendor invoices.\n-   **Tools & Technology:** System uptime/downtime reports, software license usage, contact center platform reports, knowledge base articles.\n\n#### Information to Ignore (Noise):\n-   Sales forecasts and marketing campaign plans.\n-   New product development roadmaps and engineering specifications.\n-   Company-wide financial statements (e.g., annual reports, shareholder letters).\n-   General HR policies not related to team management (e.g., benefits administration, 401k plans).\n-   High-level corporate strategy documents and market research reports.\n-   Legal contracts unrelated to service vendors or customer SLAs.\n-   Marketing collateral and advertising copy."
}