{
  "main_persona": "Paralegal",
  "sub_persona": "In-House Corporate Legal Paralegal",
  "details": "#### Primary Objective:\nRetrieve all legal and business documents pertinent to corporate governance, compliance, contracts, litigation, and intellectual property to support the company's legal department.\n\n#### Core Information to Retrieve:\n-   **Corporate Governance Documents:** Phrases like \"Board of Directors meeting minutes,\" \"corporate resolutions,\" \"bylaws,\" \"articles of incorporation,\" \"shareholder notices,\" \"proxy statements,\" \"subsidiary list,\" \"entity management.\"\n-   **Contracts and Agreements:** Document titles such as \"Master Service Agreement (MSA),\" \"Non-Disclosure Agreement (NDA),\" \"Vendor Agreement,\" \"Employment Agreement,\" \"Lease Agreement,\" \"Licensing Agreement,\" \"Statement of Work (SOW).\"\n-   **Specific Contract Clauses:** \"Indemnification,\" \"limitation of liability,\" \"term and termination,\" \"confidentiality,\" \"governing law,\" \"force majeure.\"\n-   **Compliance & Regulatory Filings:** Keywords like \"SEC filing,\" \"10-K,\" \"10-Q,\" \"8-K,\" \"regulatory inquiry,\" \"compliance audit,\" \"privacy policy,\" \"GDPR,\" \"CCPA,\" \"code of conduct,\" \"Sarbanes-Oxley (SOX).\"\n-   **Litigation & Dispute Records:** Terms such as \"litigation hold,\" \"legal hold notice,\" \"subpoena,\" \"complaint,\" \"discovery request,\" \"deposition,\" \"settlement agreement,\" \"case number,\" \"outside counsel.\"\n-   **Intellectual Property (IP):** Terms like \"trademark registration,\" \"patent application,\" \"copyright notice,\" \"IP license,\" \"trade secret policy,\" \"infringement claim.\"\n-   **Employment & HR Legal:** \"Employee handbook,\" \"offer letter,\" \"separation agreement,\" \"non-compete clause,\" \"HR investigation,\" \"discrimination complaint.\"\n-   **Legal Department Administration:** \"Legal spend,\" \"invoice from law firm,\" \"matter number,\" \"document retention policy.\"\n\n#### Information to Ignore (Noise):\n-   Marketing materials, press releases, and advertising copy.\n-   Raw sales data, customer relationship management (CRM) entries, and sales forecasts.\n-   Technical documents like source code, engineering schematics, or IT support tickets.\n-   Routine financial documents such as individual expense reports, purchase orders, or departmental budgets.\n-   Day-to-day HR documents like payroll stubs, PTO requests, or individual performance reviews (unless part of a specific legal matter).\n-   General industry news articles or analyst reports."
}