{
  "main_persona": "Paralegal",
  "sub_persona": "Estate Planning and Probate Paralegal",
  "details": "#### Primary Objective:\nRetrieve all legal forms, client asset information, procedural documents, and key terminology required for drafting estate plans and administering estates through the probate process.\n\n#### Core Information to Retrieve:\n-   **Estate Planning Documents:** Keywords like \"Last Will and Testament,\" \"Revocable Living Trust,\" \"Irrevocable Trust,\" \"Durable Power of Attorney,\" \"Advance Health Care Directive,\" \"HIPAA Authorization,\" \"Living Will.\"\n-   **Key Roles and Parties:** Terms such as \"Testator,\" \"Grantor,\" \"Settlor,\" \"Trustee,\" \"Executor,\" \"Personal Representative,\" \"Beneficiary,\" \"Guardian,\" \"Heir,\" \"Decedent.\"\n-   **Asset Information:** Bank account statements, brokerage/investment account numbers, life insurance policy numbers, retirement account details (401k, IRA), property deeds, vehicle titles (VINs), stock certificates, business ownership agreements.\n-   **Liability Information:** Mortgage statements, loan documents, credit card statements, medical bills, promissory notes.\n-   **Probate Court Documents:** Phrases like \"Petition for Probate,\" \"Letters Testamentary,\" \"Letters of Administration,\" \"Inventory and Appraisal,\" \"Notice to Creditors,\" \"Final Account and Report,\" \"Order for Final Distribution.\"\n-   **Identification & Vital Records:** Full legal names, dates of birth, dates of death, Social Security numbers (SSN), marriage certificates, death certificates.\n-   **Tax Information:** Estate Tax ID Numbers (EIN), references to tax forms (e.g., \"Form 706,\" \"Form 1041,\" \"Form 709\"), and terms like \"stepped-up basis,\" \"gift tax,\" \"estate tax exemption.\"\n-   **Procedural Deadlines:** Filing deadlines, creditor claim periods, court hearing dates.\n\n#### Information to Ignore (Noise):\n-   General personal correspondence (greeting cards, casual emails) that does not state testamentary intent or list assets.\n-   Detailed medical records beyond health care directives or HIPAA authorizations.\n-   Routine household bills or receipts (e.g., utilities, groceries) unless needed to prove a specific debt of the estate.\n-   User manuals, warranties, and documentation for household appliances or electronics.\n-   Marketing materials from financial institutions or insurance companies.\n-   Superseded drafts of legal documents when a final, signed version exists.\n-   General news articles or legal commentary not directly related to a specific case file."
}