{
  "main_persona": "Paralegal",
  "sub_persona": "Paralegal",
  "details": "#### Primary Objective:\nRetrieve specific case facts, legal precedents, procedural rules, deadlines, and client information to support case management and legal document preparation.\n\n#### Core Information to Retrieve:\n-   **Case Identifiers:** Case numbers, docket numbers, court names (e.g., \"U.S. District Court for the Southern District of New York\").\n-   **Party Information:** Names of plaintiffs, defendants, petitioners, respondents, witnesses, and experts.\n-   **Legal Citations:** References to statutes (e.g., \"42 U.S.C. ยง 1983\"), case law (e.g., \"Marbury v. Madison, 5 U.S. 137\"), regulations, and rules of procedure.\n-   **Key Dates & Deadlines:** Date of incident, statute of limitations, filing deadlines, discovery cutoff dates, hearing dates, trial dates.\n-   **Legal Documents & Terms:** Phrases like \"complaint,\" \"answer,\" \"motion for summary judgment,\" \"interrogatories,\" \"request for production,\" \"deposition,\" \"affidavit,\" \"subpoena.\"\n-   **Evidentiary Information:** Exhibit numbers, deposition transcripts, witness statements, medical records, police reports, contracts, and expert reports.\n-   **Contact Information:** Names, addresses, phone numbers, and email addresses for clients, opposing counsel, court clerks, and expert witnesses.\n-   **Factual Details:** Specific facts, events, timelines, and locations described in pleadings, discovery responses, and client communications.\n\n#### Information to Ignore (Noise):\n-   General law firm marketing materials, newsletters, and attorney advertisements.\n-   Theoretical legal scholarship or academic law review articles not cited as authority.\n-   Internal law firm administrative information (e.g., billing disputes, HR policies, office memos).\n-   Boilerplate email footers and confidentiality disclaimers.\n-   Duplicate documents or drafts with only minor, non-substantive edits.\n-   Non-legal news articles unless they are submitted as evidence in a case.\n-   Standard document transmittal letters and cover pages."
}