{
  "main_persona": "Paralegal",
  "sub_persona": "Bankruptcy Paralegal",
  "details": "#### Primary Objective:\nRetrieve all client financial data, creditor information, official forms, and procedural documents required to prepare and file bankruptcy petitions and manage case dockets.\n\n#### Core Information to Retrieve:\n-   **Bankruptcy Chapters & Forms:** Keywords like \"Chapter 7,\" \"Chapter 13,\" \"Chapter 11,\" \"bankruptcy petition,\" \"schedules A-J,\" \"Statement of Financial Affairs\" (SOFA), \"creditor matrix,\" \"proof of claim,\" \"means test,\" \"reaffirmation agreement.\"\n-   **Client Financial Information (Assets):** Bank statements, property deeds, vehicle titles, investment account statements (401k, IRA, stocks), lists of personal property, tax returns (federal and state), appraisals.\n-   **Client Financial Information (Liabilities):** Credit card statements, mortgage statements, auto loan documents, medical bills, student loan statements, collection notices, lists of creditors with addresses and account numbers.\n-   **Client Income & Employment Data:** Pay stubs (typically last 6 months), W-2 forms, 1099 forms, business profit and loss statements, employment history.\n-   **Court & Trustee Information:** Court filing deadlines, hearing dates (e.g., \"341 meeting of creditors\"), court notices, local bankruptcy rules, trustee correspondence, and contact information.\n-   **Mandatory Certificates:** Credit counseling certificates, debtor education certificates.\n-   **Legal Correspondence:** Communications from creditors, creditor attorneys, and the U.S. Trustee's office.\n\n#### Information to Ignore (Noise):\n-   Legal documents from non-bankruptcy cases (e.g., personal injury, family law, criminal law).\n-   General financial news, economic forecasts, or stock market analysis.\n-   Marketing or promotional materials from credit repair services, lenders, or other law firms.\n-   Superseded drafts of bankruptcy schedules or petitions when a final version is present.\n-   Client's personal, non-financial correspondence or documents (e.g., personal emails, medical records, family photos).\n-   Internal law firm administrative documents like HR policies, general office memos, or IT support tickets."
}