{
  "main_persona": "Paralegal",
  "sub_persona": "Real Estate Paralegal",
  "details": "#### Primary Objective:\nRetrieve all documents, clauses, and data points related to property transactions, title, financing, and closing procedures to support attorneys in real estate closings.\n\n#### Core Information to Retrieve:\n-   **Property Identification:** Property addresses, legal descriptions (metes and bounds, lot and block), Assessor's Parcel Numbers (APN), plat maps.\n-   **Key Parties:** Names of \"Grantor,\" \"Grantee,\" \"Lessor,\" \"Lessee,\" \"Buyer,\" \"Seller,\" \"Lender,\" \"Borrower,\" \"Trustee.\"\n-   **Contractual Documents:** Purchase and Sale Agreements, Letters of Intent (LOI), lease agreements, options to purchase, addendums.\n-   **Title Documents:** Phrases like \"title commitment,\" \"title report,\" \"title insurance policy,\" \"schedule B exceptions,\" \"easements,\" \"liens,\" \"encumbrances,\" \"covenants,\" \"restrictions.\"\n-   **Deeds & Conveyance:** Keywords like \"Warranty Deed,\" \"Quitclaim Deed,\" \"Special Warranty Deed,\" \"Deed of Trust.\"\n-   **Financing & Loan Documents:** Promissory Notes, Mortgages, loan agreements, security agreements, lender information, loan amounts, interest rates.\n-   **Closing Information:** Closing Disclosure (CD), HUD-1 Settlement Statements, closing checklists, closing instructions, prorations (taxes, HOA dues), wire instructions, escrow details.\n-   **Due Diligence Materials:** Survey reports, environmental reports (Phase I/II), zoning reports, certificates of occupancy, tenant estoppel certificates, rent rolls.\n-   **Critical Dates:** \"Effective Date,\" \"Closing Date,\" \"Inspection Period,\" \"Financing Contingency Deadline.\"\n-   **Corporate/Entity Documents:** Corporate resolutions authorizing a transaction, articles of organization, operating agreements (for LLCs involved).\n\n#### Information to Ignore (Noise):\n-   Legal documents from other practice areas (e.g., criminal law, family law, patent litigation).\n-   General marketing materials or real estate listings.\n-   Architectural drawings, construction plans, or detailed building schematics.\n-   Internal law firm administrative documents (e.g., billing, HR policies, IT memos).\n-   General news articles or market analysis about the real estate industry.\n-   Duplicate or superseded draft versions of documents where a final executed version exists.\n-   Vendor invoices for non-essential services (e.g., office supplies, catering)."
}