{
  "main_persona": "Paralegal",
  "sub_persona": "Intellectual Property Paralegal",
  "details": "#### Primary Objective:\nRetrieve specific data, deadlines, and legal documentation necessary for managing intellectual property portfolios, including patents, trademarks, and copyrights.\n\n#### Core Information to Retrieve:\n-   **Identification Numbers:** Patent application numbers, patent numbers, trademark serial numbers, trademark registration numbers, copyright registration numbers.\n-   **Key Dates & Deadlines:** Filing dates, priority dates, publication dates, registration dates, issue dates, expiration dates, Office Action response deadlines, maintenance fee/annuity due dates, Statement of Use deadlines, renewal deadlines.\n-   **Party Information:** Names and contact details for inventors, authors, applicants, assignees, licensees, and legal counsel.\n-   **Patent-Specific Terms:** Phrases like \"USPTO,\" \"WIPO,\" \"PCT,\" \"Prior Art,\" \"Information Disclosure Statement (IDS),\" \"Office Action,\" \"Notice of Allowance,\" \"claims,\" \"specification,\" \"maintenance fee,\" \"annuity.\"\n-   **Trademark-Specific Terms:** Phrases like \"Trademark,\" \"Service Mark,\" \"TM,\" \"®,\" \"Statement of Use,\" \"Declaration of Use,\" \"specimen,\" \"likelihood of confusion,\" \"International Class,\" \"goods and services,\" \"opposition,\" \"cancellation.\"\n-   **Copyright-Specific Terms:** \"U.S. Copyright Office,\" \"work made for hire,\" \"author,\" \"claimant,\" \"deposit copy,\" \"date of creation,\" \"date of publication.\"\n-   **Legal Documents:** Executed Declarations, Powers of Attorney, Assignments, License Agreements, Non-Disclosure Agreements (NDAs), Cease and Desist letters, litigation filings (Complaints, Answers).\n-   **Docketing Information:** Case numbers, court names, matter numbers, client IDs.\n-   **Official Correspondence:** Communications from the USPTO, U.S. Copyright Office, WIPO, or other international IP offices.\n\n#### Information to Ignore (Noise):\n-   General corporate communications or HR announcements.\n-   Firm or client financial statements (e.g., balance sheets, P&L reports), unless they are specific invoices for legal services.\n-   Marketing materials or press releases not directly relevant to a trademark specimen of use.\n-   Deeply technical engineering specifications or scientific articles, unless explicitly cited as prior art.\n-   Legal documents from unrelated practice areas (e.g., real estate, M&A, family law).\n-   Internal meeting agendas or notes unless they outline specific filing strategies or deadlines.\n-   Early, non-executed drafts of legal documents when a final version is available."
}