{
  "main_persona": "Paralegal",
  "sub_persona": "Litigation Paralegal",
  "details": "#### Primary Objective:\nRetrieve all factual evidence, case-related procedural information, key dates, and contact details relevant to managing and supporting a legal dispute.\n\n#### Core Information to Retrieve:\n-   **Case Identifiers:** Case numbers, docket numbers, court names, jurisdiction, and case captions (e.g., \"Plaintiff v. Defendant\").\n-   **Key Individuals & Entities:** Names of plaintiffs, defendants, witnesses, deponents, experts, attorneys, and judges.\n-   **Dates & Deadlines:** Filing deadlines, discovery deadlines, statutes of limitations, deposition dates, hearing dates, trial dates, and dates of key events (e.g., \"date of incident,\" \"date of contract\").\n-   **Document Types:** Keywords identifying legal documents like \"Complaint,\" \"Answer,\" \"Motion,\" \"Subpoena,\" \"Deposition Transcript,\" \"Affidavit,\" \"Declaration,\" \"Summons.\"\n-   **Discovery Terms:** \"Interrogatories,\" \"Request for Production of Documents,\" \"Request for Admissions,\" \"Notice of Deposition.\"\n-   **Evidentiary Information:** Bates numbers (e.g., \"DEF001234\"), exhibit numbers/letters, references to physical evidence, mentions of photographs or recordings.\n-   **Factual Content:** Monetary values ($), names of locations, medical diagnoses, specific factual claims, chronologies of events, invoice numbers, policy numbers.\n-   **Communication Records:** Email headers (To, From, CC, Date), excerpts from letters or memos that state facts or show intent.\n-   **Contact Information:** Addresses, phone numbers, and email addresses for any involved party.\n\n#### Information to Ignore (Noise):\n-   Boilerplate legal text such as confidentiality disclaimers in email footers.\n-   Repetitive law firm letterheads and signature blocks.\n-   Table of Contents and Table of Authorities sections.\n-   General legal articles or newsletters not specific to the case.\n-   Document metadata like file paths or printer information often found in footers.\n-   Abstract legal analysis or scholarly discussions of case law precedent.\n-   Non-substantive conversational text in emails (e.g., \"Thanks,\" \"Let's catch up next week\")."
}