{
  "main_persona": "Paralegal",
  "sub_persona": "Government Agency Paralegal",
  "details": "#### Primary Objective:\nRetrieve all legal documents, procedural guidelines, case law, and regulatory information pertinent to the agency's operations, compliance, and legal cases.\n\n#### Core Information to Retrieve:\n-   **Statutes and Regulations:** Citations to federal law (U.S. Code), state statutes, and local ordinances; Code of Federal Regulations (CFR) sections; references to the Federal Register, \"Final Rule,\" or \"Proposed Rule.\"\n-   **Case Law and Legal Precedent:** Court opinions, case citations (e.g., \"F.2d,\" \"U.S.\"), legal briefs, memoranda of law, motions, and pleadings.\n-   **Administrative Procedures:** Information related to the Administrative Procedure Act (APA), discovery rules, subpoenas, \"motion to compel,\" and hearing procedures.\n-   **Agency-Specific Documents:** Internal policy manuals, Standard Operating Procedures (SOPs), enforcement guidelines, consent decrees, and notices of violation (NOVs).\n-   **Case Management Information:** Docket numbers, case files, investigation reports, witness statements, affidavits, and lists of exhibits.\n-   **Compliance and FOIA:** Freedom of Information Act (FOIA) requests and responses, compliance checklists, audit reports, and records retention schedules.\n-   **Contracts and Agreements:** Government contracts, inter-agency agreements, Memoranda of Understanding (MOU), and settlement agreements.\n\n#### Information to Ignore (Noise):\n-   General internal communications (e.g., employee newsletters, birthday announcements, IT updates).\n-   Agency press releases, public relations materials, and social media posts.\n-   Human Resources documents (e.g., job postings, benefits summaries, payroll information).\n-   General financial documents like departmental budgets or expense reports, unless directly tied to a fiscal law case.\n-   Draft versions of documents where a final, executed version exists.\n-   Legal analysis or case law completely unrelated to the agency's jurisdiction (e.g., family law, patent law for an environmental agency)."
}