{
  "main_persona": "Paralegal",
  "sub_persona": "Immigration Paralegal",
  "details": "#### Primary Objective:\nRetrieve all specific forms, procedural guidelines, evidence requirements, and client data necessary to accurately prepare and file immigration petitions and applications.\n\n#### Core Information to Retrieve:\n-   **Government Forms & Petitions:** Specific form numbers (e.g., \"I-130,\" \"I-485,\" \"N-400,\" \"I-765,\" \"DS-160,\" \"I-129,\" \"I-90\") and terms like \"Petition for Alien Relative,\" \"Application for Adjustment of Status,\" \"Application for Naturalization.\"\n-   **Procedural Terms & Deadlines:** Phrases like \"priority date,\" \"filing fee,\" \"receipt notice,\" \"Request for Evidence (RFE),\" \"Notice of Intent to Deny (NOID),\" \"biometrics appointment,\" \"consular processing,\" \"visa bulletin,\" \"filing deadline.\"\n-   **Client Personal Data:** Full names, dates of birth (DOB), country of birth, A-Number (Alien Registration Number), passport numbers, visa numbers, I-94 numbers.\n-   **Key Dates:** Dates of entry into the U.S., marriage dates, employment start/end dates, dates status expired.\n-   **Supporting Evidence & Documents:** Keywords like \"birth certificate,\" \"marriage certificate,\" \"divorce decree,\" \"passport stamps,\" \"pay stubs,\" \"tax returns,\" \"W-2s,\" \"employment verification letter,\" \"affidavit of support,\" \"bona fide marriage evidence.\"\n-   **Agency & Status Terminology:** USCIS, NVC (National Visa Center), DOS (Department of State), DOL (Department of Labor), CBP (Customs and Border Protection), \"lawful permanent resident,\" \"asylee,\" \"nonimmigrant,\" \"inadmissibility,\" \"waiver.\"\n-   **Visa Categories:** H-1B, L-1, O-1, F-1, K-1, EB-1, EB-2, EB-3, U-Visa, T-Visa.\n-   **Addresses & Travel History:** Current and previous physical addresses, list of international travel.\n\n#### Information to Ignore (Noise):\n-   **Non-Immigration Legal Topics:** Material related to real estate, corporate law, personal injury, bankruptcy, or criminal law (unless it directly impacts immigration status, e.g., a conviction).\n-   **Abstract Legal Analysis:** Detailed case law analysis, attorney's notes on litigation strategy, complex legal arguments, or constitutional law debates.\n-   **Law Firm Internal Operations:** Internal billing information, attorney time-keeping records, office supply orders, marketing materials, HR documents.\n-   **General News & Commentary:** News articles about immigration policy debates, opinion pieces, or political commentary.\n-   **Duplicate or Superseded Forms:** Outdated versions of government forms, draft documents that have been finalized.\n-   **Casual Client Communications:** Non-substantive emails or letters (e.g., scheduling calls, holiday greetings)."
}