{
  "main_persona": "Paralegal",
  "sub_persona": "Family Law Paralegal",
  "details": "#### Primary Objective:\nRetrieve all factual details, procedural rules, legal deadlines, and client/asset information necessary to support attorneys in managing family law cases.\n\n#### Core Information to Retrieve:\n-   **Case Identifiers:** Case numbers, court names (e.g., \"Superior Court,\" \"Family Court Division\"), party names (petitioner, respondent), names of children.\n-   **Key Dates & Deadlines:** Date of marriage, date of separation, filing dates for petitions/motions, discovery deadlines, hearing dates, trial dates, mediation schedules.\n-   **Financial Documentation (Assets):** Bank account statements, investment/brokerage statements, retirement account details (401k, IRA, pension), property deeds, vehicle titles, business ownership records, life insurance policies, tax returns (W-2, 1099, K-1).\n-   **Financial Documentation (Liabilities):** Mortgage statements, credit card statements, auto loan documents, student loan records, personal loan agreements.\n-   **Legal & Procedural Terms:** \"Petition for Dissolution,\" \"Summons,\" \"Response,\" \"Financial Affidavit,\" \"Declaration of Disclosure,\" \"Interrogatories,\" \"Request for Production,\" \"Motion to Compel,\" \"Parenting Plan,\" \"Marital Settlement Agreement,\" \"Judgment.\"\n-   **Child-Related Information:** Children's full names and dates of birth, school records, medical reports, therapy notes, extracurricular activity schedules, phrases like \"best interest of the child,\" \"legal custody,\" \"physical custody,\" \"visitation,\" \"parenting time.\"\n-   **Support Calculations:** Pay stubs, income and expense declarations, health insurance costs, childcare costs, alimony/spousal support figures, child support worksheets.\n-   **Evidence & Communication:** Relevant emails, text messages, communication logs between parties, police reports (for domestic violence), third-party witness statements.\n\n#### Information to Ignore (Noise):\n-   Legal arguments and case law from unrelated fields (e.g., patent law, corporate mergers, criminal law not involving domestic violence).\n-   General marketing materials or newsletters from other firms.\n-   Law firm administrative documents (e.g., office supply invoices, IT support tickets).\n-   Junk mail and non-relevant personal correspondence.\n-   Duplicate documents with identical content but different file names.\n-   Detailed medical journals or academic studies not specific to a party's or child's diagnosed condition.\n-   News articles or social media posts not directly related to a party in the case."
}