{
  "main_persona": "Parent",
  "sub_persona": "Grandparent (Primary Caregiver)",
  "details": "#### Primary Objective:\nRetrieve all critical information concerning the grandchild's health, education, legal status, and daily activities to ensure their well-being and manage caregiving responsibilities.\n\n#### Core Information to Retrieve:\n-   **Legal & Custody Documents:** Phrases like \"guardianship,\" \"custody agreement,\" \"power of attorney,\" \"consent for medical treatment,\" \"kinship care.\"\n-   **Child's Official Records:** Birth certificate, social security number/card, adoption papers.\n-   **Medical Information:** Doctor's appointment schedules, pediatrician contact information, immunization records, allergy lists, prescription details (medication name, dosage), health insurance policy numbers.\n-   **School Information:** Teacher names and contact info, school phone numbers, academic calendars, report cards, homework assignments, permission slips, IEP or 504 plan details.\n-   **Financial Support:** Information on \"Social Security benefits,\" \"TANF,\" \"grandparent assistance programs,\" child support documents.\n-   **Emergency Contacts:** Lists of phone numbers for family, doctors, school, and neighbors.\n-   **Community & Support:** Contact information for local support groups (e.g., \"grandparents raising grandchildren\"), community centers, libraries, and recreational programs.\n-   **Schedules:** Extracurricular activity schedules (sports, clubs), tutoring sessions, therapy appointments.\n\n#### Information to Ignore (Noise):\n-   Personal retirement account statements or investment portfolio analysis not related to the child.\n-   Junk mail and unsolicited marketing materials (e.g., credit card offers, catalogs).\n-   Political mailers or campaign literature.\n-   Complex legal or financial documents not pertaining to guardianship, benefits, or the child's direct welfare.\n-   Hobby-related information or club newsletters for personal interests (e.g., gardening club, book club).\n-   News articles or abstract reports on general social or economic trends."
}