{
  "main_persona": "Parent",
  "sub_persona": "Special Needs Parent",
  "details": "#### Primary Objective:\nRetrieve all actionable information regarding medical services, educational plans, legal rights, financial aid, and community support systems relevant to caring for a child with special needs.\n\n#### Core Information to Retrieve:\n-   **Educational Documents & Terminology:**\n    -   IEP (Individualized Education Program/Plan) documents, meeting notes, and goals.\n    -   504 Plan details and accommodations.\n    -   Phrases like \"accommodations,\" \"modifications,\" \"related services,\" \"least restrictive environment,\" \"due process,\" \"procedural safeguards,\" \"parent rights.\"\n    -   School evaluations, assessments, and progress reports.\n    -   Contact information for case managers, special education teachers, school psychologists, and district administrators.\n-   **Medical & Therapeutic Information:**\n    -   Specific diagnoses (e.g., \"Autism Spectrum Disorder,\" \"ADHD,\" \"Cerebral Palsy,\" \"Down Syndrome\").\n    -   Contact information for pediatricians, specialists (neurologists, developmental pediatricians), therapists (OT, PT, Speech, ABA).\n    -   Therapy progress notes and treatment plans.\n    -   Medication names, dosages, and administration schedules.\n    -   Medical appointment summaries and future appointment dates.\n-   **Financial & Legal Information:**\n    -   Government benefits: \"SSI,\" \"SSDI,\" \"Medicaid waiver,\" \"state disability services.\"\n    -   Financial planning terms: \"ABLE account,\" \"special needs trust,\" \"guardianship.\"\n    -   Insurance-related terms: \"prior authorization,\" \"denial of benefits,\" \"appeal process,\" \"explanation of benefits (EOB).\"\n    -   Contact information for advocacy groups and disability rights lawyers.\n-   **Community & Support Resources:**\n    -   Information on \"respite care\" providers and services.\n    -   Details on local parent support groups.\n    -   Schedules for \"adaptive sports,\" \"sensory-friendly\" events, or special needs camps.\n    -   Transition plans and resources for post-high school life (e.g., vocational training, independent living).\n\n#### Information to Ignore (Noise):\n-   General parenting advice that is not specific to children with disabilities.\n-   School-wide announcements or newsletters that do not pertain to special education programs (e.g., general PTA meetings, standard honor roll lists, non-adaptive sports schedules).\n-   Medical research or articles that are highly technical and not directly related to the child's specific condition or treatment plan.\n-   Generic financial advice on topics like stock investing or retirement planning that is not linked to special needs financial instruments (trusts, ABLE accounts).\n-   General marketing materials and junk mail.\n-   Typical child developmental milestone charts, unless being used for comparison in an evaluation."
}