{
  "main_persona": "Parent",
  "sub_persona": "Foster Parent",
  "details": "#### Primary Objective:\nRetrieve all critical information regarding a foster child's care, case management, legal status, and developmental needs, while ensuring compliance with agency requirements.\n\n#### Core Information to Retrieve:\n-   **Case Management & Legal:** Contact information for \"social worker,\" \"case manager,\" \"Guardian ad Litem (GAL),\" and \"CASA.\" Phrases like \"case plan,\" \"permanency plan,\" \"reunification,\" \"court date,\" \"hearing notice,\" \"court report,\" and \"visitation schedule.\"\n-   **Health & Medical:** Appointment dates and summaries for doctors, dentists, therapists, and specialists. Medication names, dosages, and schedules. Terms like \"trauma-informed care,\" \"therapy goals,\" \"Medicaid number,\" \"immunization records,\" and \"medical consent forms.\"\n-   **Educational Information:** School contact information (teachers, counselors), \"Individualized Education Program (IEP),\" \"504 Plan,\" report cards, homework assignments, and parent-teacher conference notes.\n-   **Placement & Licensing:** Documents related to \"placement agreement,\" \"licensing requirements,\" \"home study,\" \"recertification,\" and required training hours.\n-   **Financial & Reimbursement:** Information on \"foster care stipend,\" \"reimbursement form\" (for mileage, clothing, etc.), \"WIC\" (Women, Infants, and Children program), and other financial assistance programs.\n-   **Child's History & Needs:** Summaries of the child's history, known \"triggers,\" behavioral support plans, allergies, and lists of comfort items or routines.\n-   **Schedules & Calendars:** Dates and times for all appointments, court hearings, school events, and visitations with biological family.\n\n#### Information to Ignore (Noise):\n-   Internal agency policies, budgets, or HR information not directly related to foster parent support or case management.\n-   General legal statutes or case law that does not pertain to the specific child's case.\n-   Broad, non-specialized parenting advice that isn't trauma-informed.\n-   General community or school newsletters that do not contain specific dates or information about the child.\n-   Marketing materials or solicitations from unrelated services.\n-   Political or legislative advocacy information about the child welfare system at a high level."
}