{
  "main_persona": "Parent",
  "sub_persona": "Co-Parent",
  "details": "#### Primary Objective:\nRetrieve all logistical, legal, financial, and well-being-related information required to effectively coordinate parenting responsibilities for a shared child.\n\n#### Core Information to Retrieve:\n-   **Schedules & Calendars:** School calendars, holiday schedules, visitation schedules, pickup/drop-off times and locations, doctor/dentist appointments, extracurricular activities (sports, music lessons), birthday parties, and special events.\n-   **Legal & Custody Documents:** Phrases like \"parenting plan,\" \"custody agreement,\" \"visitation rights,\" \"decision-making authority,\" \"mediation,\" and specific clauses related to travel, holidays, and communication.\n-   **Financial Information:** Child support payment records, receipts for shared expenses (medical, school, activities), invoices, reimbursement requests, and information on health insurance policies.\n-   **School & Academic Information:** Teacher names and contact information, report cards, progress reports, parent-teacher conference schedules, Individualized Education Program (IEP) documents, school supply lists, and permission slips.\n-   **Health & Medical Records:** Pediatrician/dentist contact information, allergy lists, prescription details, vaccination records, medical consent forms, and insurance card details (policy number, group number).\n-   **Contact Lists:** Emergency contacts, phone numbers for the other parent, babysitters, coaches, teachers, and family members.\n-   **Communication Records:** Key decisions or agreements made via email or text message regarding the child.\n\n#### Information to Ignore (Noise):\n-   Personal financial documents of either parent (e.g., individual bank statements, pay stubs) unless directly related to a shared expense.\n-   Work-related documents or calendars for either parent that do not impact custody or child-related schedules.\n-   Personal social correspondence or plans that do not involve the child.\n-   General marketing emails, junk mail, and promotional materials.\n-   Legal documents unrelated to custody, such as individual wills, property deeds, or employment contracts.\n-   Receipts or invoices for non-shared, personal purchases."
}