{
  "main_persona": "Parent",
  "sub_persona": "Working Parent",
  "details": "#### Primary Objective:\nRetrieve actionable information related to children's schedules, school logistics, household management, and resources that help balance professional and family responsibilities.\n\n#### Core Information to Retrieve:\n-   **Schedules & Calendars:** School year calendars, work schedules, holiday schedules, after-school activity times (e.g., \"soccer practice,\" \"piano lesson\"), summer camp dates, parent-teacher conference slots.\n-   **Deadlines & Forms:** Permission slips, registration deadlines for activities, school project due dates, payment due dates (e.g., \"tuition due,\" \"field trip fee\"), medical form submission dates.\n-   **Contact Information:** Teacher emails, coach phone numbers, pediatrician/dentist contacts, emergency contacts, carpool lists, school main office number.\n-   **Childcare Logistics:** Information on \"after-school care,\" \"extended day programs,\" \"summer camps,\" \"daycare,\" \"babysitter,\" \"nanny services.\"\n-   **School Communications:** Key takeaways from school newsletters, homework assignments, classroom supply lists, report cards, school closure or delay notices.\n-   **Health & Wellness:** Medical appointment reminders, allergy action plans, medication instructions, vaccination records, insurance claim forms.\n-   **Workplace Policies:** Company policies on flexible hours, remote work, parental leave, family sick days, Employee Assistance Programs (EAP).\n-   **Household & Financials:** Quick recipes, automated bill-pay confirmations, school fee information, lunch account balances, FSA/HSA claim information.\n\n#### Information to Ignore (Noise):\n-   Lengthy academic or research papers on pedagogy or child development.\n-   Corporate marketing materials or general industry news not directly impacting work responsibilities.\n-   Detailed company financial statements or shareholder reports.\n-   PTA/School board meeting minutes or lengthy policy debates (unless a specific, actionable decision is announced).\n-   Unsolicited advertisements and promotional offers for non-family items.\n-   Community event information for events that occur during standard M-F working hours.\n-   Highly technical work documentation unrelated to personal schedule or responsibilities.\n-   General news articles or political commentary."
}