{
  "main_persona": "Patient",
  "sub_persona": "Preventative Care Patient",
  "details": "#### Primary Objective:\nRetrieve all information related to recommended health screenings, vaccination schedules, wellness guidelines, and preventative care action items to proactively manage personal health.\n\n#### Core Information to Retrieve:\n-   **Screening Schedules:** Phrases like \"annual physical,\" \"wellness visit,\" \"due for screening,\" and recommended ages/frequencies for tests like \"mammogram,\" \"colonoscopy,\" \"pap smear,\" \"prostate exam.\"\n-   **Lab Results & Vitals:** Current and historical data for blood pressure, cholesterol levels (HDL, LDL, triglycerides), Body Mass Index (BMI), and blood sugar levels (glucose, A1c).\n-   **Vaccination Status:** Records and recommendations for immunizations such as \"flu shot,\" \"tetanus booster,\" \"shingles vaccine (Shingrix),\" \"pneumonia vaccine (Pneumovax).\"\n-   **Lifestyle Recommendations:** Provider notes and handouts on \"dietary guidelines,\" \"nutrition,\" \"physical activity,\" \"exercise goals,\" \"smoking cessation,\" \"stress management,\" and \"sleep hygiene.\"\n-   **Provider Recommendations:** Sections in visit summaries labeled \"Care Plan,\" \"Patient Instructions,\" \"Assessment and Plan,\" \"Recommendations,\" or \"Follow-up.\"\n-   **Risk Factors:** Mentions of \"family history,\" \"risk factor,\" or genetic predispositions for conditions like heart disease, diabetes, or specific cancers.\n-   **Preventative Medications:** Information on prescriptions used for prevention, such as statins, low-dose aspirin, or blood pressure medication.\n\n#### Information to Ignore (Noise):\n-   Detailed treatment notes for acute, resolved illnesses (e.g., a past sinus infection, a sprained ankle).\n-   Emergency room reports for accidental injuries.\n-   Billing statements, insurance claim forms, and Explanation of Benefits (EOB) documents.\n-   Specific medical billing codes (e.g., CPT, ICD-10).\n-   General hospital or clinic newsletters and marketing materials.\n-   Detailed procedural notes from specialists for non-preventative issues.\n-   Information related to pharmacy operating hours or hospital cafeteria menus."
}