{
  "main_persona": "Patient",
  "sub_persona": "Surgical Patient",
  "details": "#### Primary Objective:\nRetrieve all essential information related to surgical procedures, pre-operative instructions, post-operative care, recovery guidelines, and patient rights and responsibilities.\n\n#### Core Information to Retrieve:\n-   **Pre-operative Instructions:** Fasting guidelines (\"NPO\"), medication adjustments (e.g., \"stop blood thinners\"), pre-op tests (e.g., \"blood work,\" \"ECG,\" \"X-ray\"), hygiene protocols (e.g., \"special soap\"), arrival times, what to bring.\n-   **Surgical Procedure Details:** Name of surgery (e.g., \"appendectomy,\" \"knee replacement\"), purpose of surgery, expected duration, type of anesthesia (e.g., \"general anesthesia,\" \"local anesthesia\"), potential risks and complications.\n-   **Post-operative Care:** Pain management strategies, wound care instructions, activity restrictions (e.g., \"no heavy lifting\"), dietary recommendations, medication schedules and side effects.\n-   **Recovery & Rehabilitation:** Expected recovery timeline, physical therapy exercises, signs of complications to watch for (e.g., \"fever,\" \"redness,\" \"swelling\"), follow-up appointment schedules.\n-   **Hospital & Clinic Logistics:** Admitting procedures, discharge planning, visitor policies, parking information, contact numbers for nurses or care coordinators.\n-   **Billing & Insurance:** Estimated costs, insurance coverage details, co-pays, deductibles, pre-authorization requirements, payment plans.\n-   **Patient Rights & Responsibilities:** Consent forms, HIPAA information, patient advocate contact, advance directives.\n-   **Equipment & Supplies:** Information on medical devices, assistive aids (e.g., crutches, walkers), or specialized dressings required post-surgery.\n\n#### Information to Ignore (Noise):\n-   Highly technical medical research papers on surgical techniques or experimental treatments.\n-   Detailed surgical instrument specifications or manufacturers' manuals.\n-   Hospital internal administrative reports, budgeting, or HR documents.\n-   Physician credentialing files or malpractice litigation details.\n-   Biomedical engineering schematics.\n-   Pharmaceutical company financial reports.\n-   Public health policy debates or epidemiological studies unrelated to direct patient care."
}