{
  "main_persona": "Patient",
  "sub_persona": "Home Health Patient",
  "details": "#### Primary Objective:\nRetrieve all information related to my personal medical care plan, upcoming appointments, medication schedules, and contact details for my healthcare providers.\n\n#### Core Information to Retrieve:\n-   **Appointment Schedules:** Dates and times for nurse visits, physical therapy, occupational therapy, or doctor follow-ups.\n-   **Care Plan Details:** Specific instructions for daily care, such as wound care, physical therapy exercises, dietary restrictions, and activity limitations. Phrases like \"care plan,\" \"goals,\" \"patient instructions.\"\n-   **Medication Information:** Medication names, dosage instructions (e.g., \"25mg,\" \"twice daily\"), refill dates, and lists of potential side effects.\n-   **Contact Information:** Names and phone numbers for my case manager, on-call nurse, primary doctor, physical therapist, and home health agency main office.\n-   **Medical Vitals & Logs:** Records of blood pressure, blood sugar levels, weight, oxygen saturation, and pain levels.\n-   **Test Results:** Summaries of recent lab work, blood tests, or other diagnostic results.\n-   **Medical Equipment:** Instructions or contact information for durable medical equipment (DME) like oxygen tanks, hospital beds, or walkers.\n-   **Insurance & Authorization:** Policy numbers, authorization numbers for services, and contact information for the insurance provider.\n\n#### Information to Ignore (Noise):\n-   Internal medical billing codes (e.g., CPT, ICD-10 codes).\n-   Detailed scientific or pharmacological explanations of a drug's mechanism.\n-   Administrative policies of the home health agency not directly related to patient care.\n-   General marketing materials, newsletters, or fundraising requests from the healthcare provider.\n-   Staffing schedules or internal memos for the healthcare agency.\n-   Lengthy, boilerplate legal disclaimers or privacy policy text."
}