{
  "main_persona": "Payroll Administrator",
  "sub_persona": "Healthcare Payroll Administrator",
  "details": "#### Primary Objective:\nRetrieve all data related to employee compensation, timekeeping, deductions, and regulatory compliance to accurately process payroll for a diverse healthcare workforce.\n\n#### Core Information to Retrieve:\n-   **Time & Attendance Data:** Timesheets, clock-in/out records, on-call schedules, call-back hours, shift differentials (evening, night, weekend), holiday pay calculations, and overtime hours.\n-   **Compensation Details:** Hourly wage rates, annual salaries, pay scales/grades, physician compensation plans, stipends (for residents/fellows), bonus payments, and incentive pay structures.\n-   **Employee Deductions:** Health/dental/vision insurance premiums, 401k or 403b retirement plan contributions, life and disability insurance costs, union dues, wage garnishments, and malpractice insurance deductions.\n-   **Tax & Compliance Information:** W-4 forms, state tax withholding forms, payroll tax liabilities (FICA, Medicare), unemployment insurance (SUI) rates, and details from Collective Bargaining Agreements (CBAs).\n-   **Leave & Accruals:** Paid Time Off (PTO) balances, sick leave accrual rates, vacation requests, and documentation for FMLA or other leaves of absence.\n-   **Employee Data:** Employee ID numbers, job titles (e.g., RN, MD, LPN, Technician), department codes, employment status (Full-Time, Part-Time, Per Diem, Contract), and direct deposit information.\n-   **Payroll Reports:** Payroll registers, pay stubs, W-2 forms, quarterly 941 forms, and reports on labor distribution or costs by department.\n\n#### Information to Ignore (Noise):\n-   Protected Health Information (PHI) and all patient-related clinical data (diagnoses, treatment plans, medical charts).\n-   Hospital operational data like patient census, bed occupancy rates, or surgical schedules.\n-   Procurement documents for medical supplies, equipment, or pharmaceuticals.\n-   Marketing materials, press releases, or community newsletters.\n-   Clinical research papers, trial data, or grant applications.\n-   Board of Directors meeting minutes (unless they specifically address payroll policies or compensation structures)."
}