{
  "main_persona": "Payroll Administrator",
  "sub_persona": "Payroll Systems Analyst",
  "details": "#### Primary Objective:\nRetrieve technical documentation, configuration guides, and integration specifications related to the setup, maintenance, and troubleshooting of payroll systems and their associated data flows.\n\n#### Core Information to Retrieve:\n-   **System Configuration:** Keywords like \"configuration,\" \"system parameters,\" \"pay group setup,\" \"deduction codes,\" \"earning codes,\" \"tax jurisdictions,\" \"accrual rules,\" \"overtime calculation.\"\n-   **Technical Documentation:** Phrases such as \"API documentation,\" \"release notes,\" \"version history,\" \"patch instructions,\" \"implementation guide,\" \"system requirements.\"\n-   **Data Integration & Mapping:** Terms like \"data mapping,\" \"file feed specifications,\" \"HRIS integration,\" \"General Ledger (GL) interface,\" \"import/export formats,\" \"data validation rules.\"\n-   **Troubleshooting & Errors:** Error codes, \"troubleshooting guide,\" \"error logs,\" \"system audit,\" \"data integrity check,\" \"reconciliation report.\"\n-   **Security & Access:** Information on \"user roles,\" \"security profiles,\" \"permissions,\" \"access control,\" \"audit trails,\" \"data encryption.\"\n-   **Testing & Implementation:** \"User Acceptance Testing (UAT) scripts,\" \"test plans,\" \"data migration strategy,\" \"go-live checklist,\" \"parallel testing.\"\n-   **Reporting:** \"Custom report builder,\" \"query logic,\" \"data warehouse,\" \"analytics module,\" \"compliance reporting setup\" (e.g., W-2, 1099).\n\n#### Information to Ignore (Noise):\n-   Individual employee payroll records, pay stubs, or direct deposit forms.\n-   General HR policies unrelated to pay calculation (e.g., dress code, performance management).\n-   Marketing materials or sales brochures for payroll software.\n-   Company-wide financial statements or investor relations reports.\n-   Benefits plan summaries and provider directories (the focus is on deduction setup, not the plan details).\n-   Manuals for non-integrated, standalone office software (e.g., Microsoft Word, Excel basics)."
}