{
  "main_persona": "Payroll Administrator",
  "sub_persona": "Corporate Payroll Specialist",
  "details": "#### Primary Objective:\nRetrieve all employee data, tax regulations, company policies, and timekeeping records required for accurate and compliant corporate payroll processing.\n\n#### Core Information to Retrieve:\n-   **Employee Data & Compensation:** Employee ID numbers, pay rates, salaries, hourly wages, overtime hours, commissions, bonuses, stipends.\n-   **Tax & Withholding Information:** Phrases like \"federal withholding,\" \"state tax,\" \"FICA,\" \"Social Security,\" \"Medicare,\" \"local tax.\" Forms like W-4, W-2, 941, 940.\n-   **Deductions & Garnishments:** \"Health insurance premium,\" \"401(k) contribution,\" \"HSA/FSA,\" \"pension plan,\" \"life insurance,\" \"wage garnishment,\" \"child support order,\" \"tax levy.\"\n-   **Time & Attendance Data:** Timesheets, timecards, clock-in/clock-out records, overtime calculations, shift differentials.\n-   **Leave & Accruals:** Paid Time Off (PTO) balances, sick leave usage, vacation requests, holiday pay schedules, leave of absence (LOA) documentation.\n-   **Payroll Schedules & Deadlines:** Pay period dates (e.g., \"bi-weekly,\" \"semi-monthly\"), payroll processing deadlines, tax filing due dates, direct deposit transmittal dates.\n-   **Regulatory & Policy Terms:** Fair Labor Standards Act (FLSA), \"exempt status,\" \"non-exempt status,\" minimum wage, company payroll policies, reimbursement policies.\n-   **Payroll Reporting:** Payroll registers, general ledger (GL) codes, reconciliation reports, year-end statements, audit requests, discrepancy reports.\n-   **Employee Changes:** New hire paperwork, termination dates, final pay calculations, salary change forms, bank account/direct deposit updates.\n\n#### Information to Ignore (Noise):\n-   Marketing materials, press releases, and sales reports.\n-   Product development notes, engineering schematics, and R&D data.\n-   General employee performance reviews (unless they specify a bonus or pay change amount).\n-   Recruiting information like resumes, interview notes, and applicant tracking data.\n-   High-level strategic plans or board of directors meeting minutes (unless specifically referencing compensation structure changes).\n-   IT support tickets and system maintenance logs unrelated to the payroll system.\n-   General employee satisfaction surveys and non-payroll training materials."
}