{
  "main_persona": "Payroll Administrator",
  "sub_persona": "Payroll Administrator",
  "details": "#### Primary Objective:\nRetrieve all employee data, timekeeping records, tax forms, and regulatory information necessary to process payroll accurately and ensure compliance.\n\n#### Core Information to Retrieve:\n-   **Employee Data:** Employee ID numbers, Social Security Numbers (SSN), full names, home addresses.\n-   **Compensation Details:** Phrases like \"hourly rate,\" \"annual salary,\" \"pay grade,\" \"salary band,\" \"commission,\" \"bonus,\" \"overtime pay,\" \"shift differential.\"\n-   **Timekeeping Records:** Timesheets, hours worked, clock-in/clock-out times, overtime hours logged.\n-   **Leave & Accruals:** Paid Time Off (PTO) balances, vacation requests, sick leave usage, holiday pay.\n-   **Tax Forms & Withholding:** W-4 forms, I-9 forms, state tax forms, tax withholding allowances, \"FICA,\" \"Medicare,\" \"Federal Income Tax,\" \"State Unemployment Insurance (SUI).\"\n-   **Deductions:** Health insurance premiums, 401(k) contribution percentages, retirement plan deductions, union dues, flexible spending account (FSA) contributions.\n-   **Garnishments:** Court orders for \"wage garnishment,\" \"child support,\" \"tax levy.\"\n-   **Banking Information:** Direct deposit forms, bank routing numbers, account numbers.\n-   **Payroll Schedules:** Pay period start/end dates, pay dates, payroll processing calendars.\n-   **Regulatory Terms:** \"Fair Labor Standards Act (FLSA),\" \"Department of Labor (DOL),\" \"IRS Publication 15.\"\n\n#### Information to Ignore (Noise):\n-   Performance reviews and employee development plans.\n-   Resumes, cover letters, and interview notes.\n-   Marketing materials, sales reports, and customer lists.\n-   Company-wide financial statements like Profit & Loss or Balance Sheets.\n-   Employee engagement surveys and company culture initiatives.\n-   Project plans, operational workflows, and product roadmaps.\n-   IT support tickets and technical system logs not related to the payroll system."
}