{
  "main_persona": "Payroll Administrator",
  "sub_persona": "Union Payroll Specialist",
  "details": "#### Primary Objective:\nRetrieve all specific rates, deductions, contributions, and work rules stipulated in Collective Bargaining Agreements (CBAs) to ensure accurate and compliant union payroll processing.\n\n#### Core Information to Retrieve:\n-   **Wage Rates & Classifications:** Job classifications (e.g., \"Journeyman,\" \"Apprentice\"), wage scales, pay grades, specific hourly rates.\n-   **Premium Pay:** Overtime rules (\"time and a half,\" \"double time\"), shift differentials, holiday pay, weekend pay, hazard pay.\n-   **Union-Specific Deductions:** Keywords like \"union dues,\" \"working dues,\" \"initiation fees,\" \"assessments.\"\n-   **Fringe Benefit Contributions:** Contribution rates and calculation rules for health & welfare, pension, annuity, apprenticeship, and training funds.\n-   **Contractual Terms:** \"Collective Bargaining Agreement,\" \"CBA,\" \"Memorandum of Understanding,\" \"MOU,\" \"Letter of Assent.\"\n-   **Dates and Deadlines:** Agreement effective dates, expiration dates, wage increase schedules, benefit remittance due dates.\n-   **Allowances & Stipends:** Tool allowance, vehicle allowance, meal allowance, per diem rates.\n-   **Time-Off Policies:** Vacation accrual rates, sick leave policies, holiday schedules, bereavement leave, jury duty pay rules.\n-   **Work Rules Affecting Pay:** Seniority provisions (for layoff/recall pay), reporting time pay, call-back pay, minimum work-hour guarantees.\n-   **Union Identifiers:** Union local numbers, fund names, remittance addresses.\n\n#### Information to Ignore (Noise):\n-   Company policies applicable only to non-union or salaried employees.\n-   Executive compensation details and bonus structures.\n-   Marketing materials, press releases, and general company news.\n-   Union political activity, endorsements, or general newsletters.\n-   Non-financial clauses in the CBA (e.g., management rights clauses, union recognition clauses, no-strike clauses) unless they directly impact pay calculations.\n-   General safety procedures and non-financial company policies.\n-   High-level corporate financial statements (e.g., annual reports, SEC filings)."
}