{
  "main_persona": "Pharmacist",
  "sub_persona": "Regulatory Affairs Pharmacist",
  "details": "#### Primary Objective:\nRetrieve all documentation pertaining to pharmaceutical regulatory submissions, compliance standards, safety reporting, and communications with global health authorities.\n\n#### Core Information to Retrieve:\n-   **Regulatory Submissions & Dossiers:** Phrases like \"New Drug Application (NDA),\" \"Investigational New Drug (IND),\" \"Biologics License Application (BLA),\" \"Marketing Authorisation Application (MAA),\" \"Common Technical Document (CTD),\" \"submission dossier,\" \"eCTD sequence.\"\n-   **Health Authority Communications:** Keywords like \"FDA meeting minutes,\" \"response to deficiency letter,\" \"health authority query,\" \"EMA scientific advice,\" \"pre-IND meeting.\"\n-   **Compliance & Guidelines:** Specific regulations and guidelines such as \"21 CFR Part 312,\" \"ICH E6 (GCP),\" \"Good Manufacturing Practices (GMP),\" \"Good Pharmacovigilance Practices (GVP),\" \"guidance for industry.\"\n-   **Safety & Pharmacovigilance:** Terms like \"Adverse Event Reporting,\" \"Periodic Safety Update Report (PSUR),\" \"Risk Management Plan (RMP),\" \"Pharmacovigilance System Master File (PSMF),\" \"Dear Doctor Letter,\" \"product recall.\"\n-   **Chemistry, Manufacturing, and Controls (CMC):** Sections labeled \"CMC,\" \"stability data,\" \"manufacturing process,\" \"quality control,\" \"analytical validation,\" \"batch records.\"\n-   **Product Labeling:** Drafts and final versions of \"Prescribing Information,\" \"Package Insert,\" \"Summary of Product Characteristics (SmPC),\" \"patient leaflet,\" \"labeling negotiations.\"\n-   **Clinical Study Documentation (Regulatory Sections):** \"Clinical Study Report (CSR),\" \"Investigator's Brochure (IB),\" \"protocol amendments,\" \"informed consent forms,\" \"Institutional Review Board (IRB)\" or \"Ethics Committee (EC)\" approvals.\n-   **Regulatory Strategy:** Documents titled \"Regulatory Strategy,\" \"Target Product Profile (TPP),\" \"gap analysis,\" \"pediatric investigation plan (PIP).\"\n\n#### Information to Ignore (Noise):\n-   Detailed sales figures, market share reports, and marketing team performance metrics.\n-   Raw, non-summarized preclinical research data (e.g., individual assay results).\n-   General corporate financial documents like annual reports, stock performance, or quarterly earnings calls.\n-   Human Resources documents such as employee performance reviews, general company-wide policies, or recruiting information.\n-   Logistical and operational details of clinical trial site management (e.g., catering, travel arrangements, site staff schedules).\n-   Individual, de-identified patient data logs or Case Report Forms (CRFs); focus should be on aggregated reports.\n-   IT support tickets, software user manuals (unless for regulatory software like eCTD builders), and system maintenance logs."
}