{
  "main_persona": "Pharmacist",
  "sub_persona": "Pharmacist",
  "details": "#### Primary Objective:\nRetrieve detailed information on drug properties, dosing, interactions, patient counseling points, and regulatory guidelines to ensure safe and effective medication management.\n\n#### Core Information to Retrieve:\n-   **Drug Identification:** Brand names, generic names, National Drug Code (NDC) numbers, drug classes (e.g., \"beta-blocker,\" \"SSRI\").\n-   **Dosing & Administration:** Dosage forms (tablet, capsule, injection), strengths (e.g., \"50mg\"), dosing regimens (\"once daily,\" \"BID,\" \"q8h\"), route of administration (\"PO,\" \"IV,\" \"IM\"), dose adjustments for renal or hepatic impairment.\n-   **Pharmacology:** Mechanism of action, pharmacokinetics (absorption, distribution, metabolism, excretion), pharmacodynamics.\n-   **Safety Information:** Side effects, adverse drug reactions (ADRs), contraindications, precautions, boxed warnings (\"black box warning\").\n-   **Drug Interactions:** Drug-drug interactions, drug-food interactions, drug-disease interactions.\n-   **Patient Counseling:** Key counseling points, \"how to take,\" storage requirements (\"refrigerate,\" \"protect from light\"), what to do for a missed dose.\n-   **Special Populations:** Pediatric dosing, geriatric considerations, information for pregnancy and lactation.\n-   **Regulatory & Compounding:** Controlled substance schedules (e.g., \"Schedule II,\" \"C-IV\"), formulary status, compounding formulas/recipes, beyond-use dates (BUD).\n-   **Therapeutic Equivalents:** Lists of A/B rated drugs, generic substitution guidelines.\n-   **Vaccine Information:** Immunization schedules, administration techniques, vaccine storage requirements.\n\n#### Information to Ignore (Noise):\n-   Early-stage drug discovery and pre-clinical trial data (e.g., animal studies).\n-   Pharmaceutical company financial reports, stock performance, and marketing materials.\n-   Detailed chemical synthesis processes and raw material sourcing.\n-   Non-pharmacological treatment modalities (e.g., detailed surgical procedures, physical therapy exercises).\n-   Hospital administrative memos not related to the pharmacy department (e.g., cafeteria menus, parking notices).\n-   Biomedical research papers focused on cellular or molecular mechanisms without direct clinical application."
}