{
  "main_persona": "Pharmacist",
  "sub_persona": "Ambulatory Care Pharmacist",
  "details": "#### Primary Objective:\nRetrieve all clinical information necessary to manage chronic diseases, optimize medication therapy, and provide patient counseling in an outpatient clinic setting.\n\n#### Core Information to Retrieve:\n-   **Disease State Management:** Keywords for chronic conditions like \"Diabetes,\" \"Hypertension,\" \"Dyslipidemia,\" \"Asthma,\" \"COPD,\" \"Heart Failure,\" \"Anticoagulation,\" \"Osteoporosis.\"\n-   **Clinical Guidelines:** Phrases like \"guideline-directed medical therapy (GDMT),\" \"first-line therapy,\" \"treatment algorithm,\" \"standard of care,\" and references to guidelines (e.g., ADA, AHA, GOLD, JNC8).\n-   **Drug Information:** Generic and brand drug names, dosing regimens, titration schedules, \"renal dose adjustment,\" \"hepatic impairment.\"\n-   **Medication Safety:** \"Adverse drug reaction\" (ADR), \"drug-drug interaction,\" \"drug-food interaction,\" \"contraindication,\" \"black box warning.\"\n-   **Patient Monitoring:** Specific lab tests (e.g., \"A1c,\" \"INR,\" \"SCr,\" \"eGFR,\" \"lipid panel,\" \"LFTs\"), therapeutic targets (e.g., \"BP goal < 130/80,\" \"A1c target < 7%\"), and monitoring parameters.\n-   **Clinical Practice Terms:** \"Medication Therapy Management\" (MTM), \"Comprehensive Medication Review\" (CMR), \"Medication Reconciliation,\" \"Adherence,\" \"Patient Counseling,\" \"Collaborative Practice Agreement.\"\n-   **Vaccinations:** Immunization schedules, vaccine names (e.g., \"Shingrix,\" \"Prevnar 20,\" \"Fluarix\"), and administration guidelines.\n-   **Patient Data:** Medication lists, allergy information, problem lists, lab results, vital signs.\n\n#### Information to Ignore (Noise):\n-   Inpatient-specific protocols (e.g., critical care, sepsis bundles, operating room procedures).\n-   IV compatibility charts for complex infusions not used in an outpatient setting.\n-   Hospital administration documents, billing department reports, and general HR policies.\n-   Pharmaceutical company financial reports, stock performance, and marketing materials.\n-   Pre-clinical or basic science research (e.g., animal studies, molecular mechanism discovery).\n-   Information on veterinary medications.\n-   Detailed drug manufacturing and supply chain logistics."
}