{
  "main_persona": "Pharmacist",
  "sub_persona": "Consultant Pharmacist",
  "details": "#### Primary Objective:\nRetrieve all clinical drug information, patient-specific data, and regulatory guidelines necessary to conduct medication regimen reviews, identify potential therapy problems, and ensure patient safety and compliance.\n\n#### Core Information to Retrieve:\n-   **Drug-Specific Data:** Generic and brand names, dosage, frequency, route of administration, indications, contraindications, and \"black box warnings.\"\n-   **Patient Clinical Data:** Diagnoses (ICD codes), lab values (e.g., \"INR,\" \"A1c,\" \"SCr,\" \"K+\"), vital signs, allergies, patient age and weight.\n-   **Safety & Interactions:** Phrases like \"drug-drug interaction,\" \"drug-disease interaction,\" \"adverse drug event\" (ADE), \"therapeutic duplication,\" \"side effects.\"\n-   **Clinical Guidelines & Criteria:** \"Beers Criteria,\" \"STOPP/START criteria,\" clinical practice guidelines (e.g., for hypertension, diabetes), \"anticoagulation guidelines.\"\n-   **Regulatory & Compliance Terms:** \"CMS\" (Centers for Medicare & Medicaid Services), \"unnecessary drugs,\" \"gradual dose reduction\" (GDR), \"medication error,\" \"psychotropic,\" \"antipsychotic,\" \"formulary.\"\n-   **Pharmacokinetic/Pharmacodynamic Terms:** \"Renal dosing,\" \"hepatic adjustment,\" \"creatinine clearance\" (CrCl), \"half-life,\" \"therapeutic window.\"\n-   **Documentation Records:** \"Medication Administration Record\" (MAR), \"Physician's Orders,\" \"medication reconciliation,\" \"pharmacist intervention.\"\n\n#### Information to Ignore (Noise):\n-   Hospital or facility financial reports, billing statements, and insurance claim details.\n-   Human resources documents, including staffing schedules and payroll information.\n-   Marketing and promotional materials for pharmaceutical companies or healthcare facilities.\n-   Non-clinical facility operations documents (e.g., dietary menus, maintenance logs, IT support).\n-   Detailed surgical procedure notes (except for medication orders).\n-   Basic science or preclinical research that is not yet in clinical guidelines."
}