{
  "main_persona": "Pharmacist",
  "sub_persona": "Industrial Pharmacist",
  "details": "#### Primary Objective:\nRetrieve all technical, regulatory, and scientific information related to the drug development lifecycle, from initial discovery and formulation to manufacturing, quality control, and regulatory submission.\n\n#### Core Information to Retrieve:\n-   **Drug Development & Formulation:** Keywords like \"drug discovery,\" \"formulation development,\" \"active pharmaceutical ingredient (API),\" \"excipients,\" \"pharmacokinetics (PK),\" \"pharmacodynamics (PD),\" \"bioavailability,\" \"dosage form.\"\n-   **Manufacturing Processes:** Phrases like \"Good Manufacturing Practices (GMP),\" \"Standard Operating Procedures (SOPs),\" \"batch record,\" \"process validation,\" \"scale-up,\" \"lyophilization,\" \"tablet compression,\" \"sterilization.\"\n-   **Quality Control & Assurance:** Terms like \"quality control (QC),\" \"quality assurance (QA),\" \"Certificate of Analysis (CoA),\" \"stability testing,\" \"impurity profile,\" \"dissolution testing.\"\n-   **Analytical Chemistry Techniques:** Specific methods like \"High-Performance Liquid Chromatography (HPLC),\" \"Gas Chromatography (GC),\" \"Mass Spectrometry (MS),\" \"spectroscopy,\" \"assay.\"\n-   **Regulatory Affairs:** Acronyms and phrases such as \"FDA,\" \"EMA,\" \"New Drug Application (NDA),\" \"Investigational New Drug (IND),\" \"Common Technical Document (CTD),\" \"ICH Guidelines,\" \"regulatory submission.\"\n-   **Clinical Trials:** Information on \"clinical trial protocols,\" \"Phase I, II, III,\" \"preclinical studies,\" \"toxicology,\" \"adverse event reporting.\"\n-   **Chemical & Scientific Data:** Chemical compound names, molecular structures, CAS numbers, experimental data, statistical analysis (p-values, confidence intervals), patent numbers.\n\n#### Information to Ignore (Noise):\n-   Patient-specific prescription details or medical records.\n-   Pharmacy retail operations (e.g., store staffing, customer service, dispensing logs).\n-   Insurance claim forms, billing codes, and co-pay information.\n-   Consumer-facing drug marketing materials, advertisements, and sales figures.\n-   General corporate financial reports, stock performance, and shareholder communications.\n-   Patient counseling information (e.g., \"take with food,\" side effects for patients).\n-   Information on medical devices or surgical procedures not directly related to drug delivery."
}