{
  "main_persona": "Product Manager",
  "sub_persona": "Data Product Manager",
  "details": "#### Primary Objective:\nRetrieve all information concerning data sources, infrastructure, quality, governance, and user requirements to guide the strategy and development of data-centric products.\n\n#### Core Information to Retrieve:\n-   **Data Sources & Schemas:** Phrases like \"data dictionary,\" \"database schema,\" \"API documentation,\" \"data lineage,\" \"data source,\" \"third-party data.\" Also, specific formats like JSON, CSV, Parquet, and Avro.\n-   **Technical Architecture:** System architecture diagrams, documents mentioning \"data warehouse,\" \"data lake,\" \"data pipeline,\" \"ETL,\" \"ELT.\" Specific platform names like AWS, GCP, Azure, Snowflake, Databricks, BigQuery.\n-   **Product & User Requirements:** \"Product Requirements Document (PRD),\" \"user stories,\" \"stakeholder interviews,\" \"feature requests,\" \"business intelligence requirements,\" \"reporting needs.\"\n-   **Metrics & KPIs:** \"Key Performance Indicators,\" \"OKRs,\" \"success metrics,\" \"adoption metrics,\" \"query performance,\" \"data latency,\" \"uptime,\" \"cost per query.\"\n-   **Data Governance & Quality:** \"Data governance policy,\" \"data quality rules,\" \"data validation,\" \"data stewardship,\" \"PII\" (Personally Identifiable Information), \"GDPR,\" \"CCPA,\" \"data privacy.\"\n-   **Analytics & Machine Learning:** \"A/B test results,\" \"user segmentation,\" \"model performance,\" \"feature engineering,\" \"predictive analytics,\" \"ML model specification.\"\n-   **User Personas:** Descriptions of target users like \"Data Analyst,\" \"Data Scientist,\" \"Business Executive,\" \"Operations Manager.\"\n-   **Roadmaps & Strategy:** Product roadmaps, competitive analysis, market research reports, project timelines, and go-to-market (GTM) strategy documents.\n\n#### Information to Ignore (Noise):\n-   Human Resources documents like employee reviews, general company policies, or benefits information.\n-   General financial reports like quarterly earnings statements or balance sheets (unless analyzing financial data is the product's purpose).\n-   Marketing and sales copy for non-data products.\n-   Application-level source code for non-data components (e.g., front-end Javascript, CSS).\n-   IT support tickets and hardware provisioning requests.\n-   General corporate communications and all-hands meeting minutes not focused on product or data strategy.\n-   Vendor contracts and invoices for general office supplies or non-technical services."
}