{
  "main_persona": "Product Manager",
  "sub_persona": "Platform Product Manager",
  "details": "#### Primary Objective:\nRetrieve all information related to platform architecture, API specifications, developer documentation, system performance, and strategic roadmaps to guide the development and management of platform products.\n\n#### Core Information to Retrieve:\n-   **Technical Specifications:** API documentation, endpoint definitions, data schemas, system architecture diagrams, infrastructure designs.\n-   **Product Strategy & Roadmap:** Product Requirements Documents (PRDs), product roadmaps, business cases, OKRs/KPIs for the platform.\n-   **Performance & Reliability Metrics:** Service Level Agreements (SLAs), Service Level Objectives (SLOs), uptime reports, latency metrics, error rates.\n-   **Developer Experience (DevEx):** Developer onboarding guides, \"Getting Started\" tutorials, SDK documentation, user research findings from developer interviews.\n-   **Platform Usage & Adoption:** API call volume statistics, reports on feature adoption by internal or external teams, user analytics for developer tools.\n-   **Operational Documents:** Incident post-mortems, root cause analysis (RCA), release notes, deployment schedules.\n-   **Security & Compliance:** Security audit reports, compliance documentation (e.g., SOC 2, ISO 27001), data governance policies.\n-   **User Feedback:** Summarized feedback from developer forums, support tickets, bug reports, and feature requests from teams using the platform.\n\n#### Information to Ignore (Noise):\n-   UI/UX mockups and design files for end-user facing applications (not the platform's developer console).\n-   Consumer marketing materials, ad copy, and social media campaign assets.\n-   Individual customer support conversations or scripts for front-end products.\n-   Detailed source code files or individual code commits.\n-   Corporate financial statements, HR policies, and general administrative documents.\n-   Sales contracts and pricing for products built *on top* of the platform."
}