{
  "main_persona": "Product Manager",
  "sub_persona": "B2C Product Manager",
  "details": "#### Primary Objective:\nRetrieve all information pertaining to consumer market trends, user behavior, product development lifecycle, go-to-market strategies, and performance metrics for B2C digital products.\n\n#### Core Information to Retrieve:\n-   **Market Research & Trends:** Consumer demographics, psychographics, buying patterns, market size, industry trends, competitive analysis reports, SWOT analyses for competitors, market segmentation studies.\n-   **User Research & Experience (UX):** User personas, user journey maps, usability test reports, A/B test results, user feedback (surveys, interviews, reviews), customer support tickets trends, accessibility guidelines.\n-   **Product Strategy & Roadmap:** Product vision statements, mission statements, product roadmaps (short-term, long-term), business requirements documents (BRDs), product specifications, feature prioritization matrices (e.g., MoSCoW, RICE scores).\n-   **Product Development & Lifecycle:** User stories, epics, sprint reviews, bug reports, feature definitions, release notes, technical feasibility assessments, API documentation (for integrations), system architecture overviews.\n-   **Product Performance & Analytics:** Key Performance Indicators (KPIs) reports, conversion rates, engagement metrics (DAU, MAU), retention rates, churn rates, customer lifetime value (CLTV), acquisition costs (CAC), revenue reports, funnel analysis.\n-   **Marketing & Sales Strategies:** Go-to-market (GTM) plans, pricing models, promotional campaigns, sales enablement materials, customer acquisition channels performance, branding guidelines.\n-   **Business & Financials:** Product line P&L statements, ROI analyses for features, business cases, partnership agreements, terms of service, privacy policies.\n-   **Competitive Intelligence:** Competitor product features, pricing, marketing campaigns, user reviews, financial performance (if public).\n\n#### Information to Ignore (Noise):\n-   Highly technical source code or complex system architecture diagrams (unless high-level integration points).\n-   Internal HR policies or employee benefit documents.\n-   Detailed financial accounting ledgers or tax documents unrelated to specific product performance.\n-   Company-wide operational logistics not directly impacting the product (e.g., office space planning).\n-   Vendor management contracts for non-product-related services (e.g., office cleaning).\n-   Supply chain management details for physical goods (if the product is purely digital).\n-   Academic research papers or scientific studies unrelated to consumer behavior or technology trends.\n-   Press releases or communications not directly related to the product launch or updates."
}