{
  "main_persona": "Product Manager",
  "sub_persona": "Growth Product Manager",
  "details": "#### Primary Objective:\nRetrieve all data, user feedback, and experimental results related to user acquisition, engagement, retention, and monetization to identify and prioritize growth initiatives.\n\n#### Core Information to Retrieve:\n-   **User Metrics:** Keywords like \"user acquisition,\" \"sign-ups,\" \"daily active users (DAU),\" \"monthly active users (MAU),\" \"retention rate,\" \"churn rate,\" \"stickiness.\"\n-   **Funnel Analysis:** Data and reports on \"conversion rates,\" \"onboarding funnels,\" \"user journey maps,\" \"drop-off points,\" and \"time to value (TTV).\"\n-   **Experimentation Data:** Phrases like \"A/B test results,\" \"multivariate test,\" \"experiment hypothesis,\" \"control group,\" \"variant,\" \"statistical significance,\" \"uplift.\"\n-   **Monetization & Revenue:** Terms such as \"average revenue per user (ARPU),\" \"customer lifetime value (LTV),\" \"pricing strategy,\" \"monetization,\" \"subscription,\" \"freemium,\" \"upsell,\" \"cross-sell.\"\n-   **Acquisition Channels:** Performance data related to \"marketing campaigns,\" \"cost per acquisition (CPA),\" \"SEO,\" \"SEM,\" \"paid social,\" \"organic traffic,\" \"referral traffic.\"\n-   **User Feedback & Engagement:** \"Net Promoter Score (NPS),\" \"customer satisfaction (CSAT),\" \"user surveys,\" \"feature requests,\" \"feature adoption rates,\" \"user segments.\"\n-   **Growth Strategy:** Documents containing \"growth roadmap,\" \"growth OKRs\" (Objectives and Key Results), \"KPIs,\" \"competitor analysis,\" \"market opportunity.\"\n-   **Referral & Virality:** Information on \"referral programs,\" \"viral coefficient,\" \"k-factor,\" and \"word-of-mouth\" performance.\n\n#### Information to Ignore (Noise):\n-   Deep technical documentation, such as API specifications, database schemas, or infrastructure architecture diagrams.\n-   Internal administrative documents like HR policies, benefits information, or office management memos.\n-   Detailed company financial statements (e.g., balance sheets, cash flow statements) not directly tied to product revenue metrics.\n-   Lengthy legal documents, patent filings, or compliance paperwork (unless it's a summary impacting a specific growth experiment).\n-   Supply chain, manufacturing, or logistics reports.\n-   Code repositories or detailed software engineering sprint plans."
}