{
  "main_persona": "Product Manager",
  "sub_persona": "Startup Product Manager",
  "details": "#### Primary Objective:\nRetrieve all information related to user feedback, market analysis, product requirements, development progress, and go-to-market strategies to accelerate product-market fit.\n\n#### Core Information to Retrieve:\n-   **User & Market Insights:** \"User interviews,\" \"customer feedback,\" \"survey results,\" \"usability testing,\" \"NPS scores,\" \"user personas,\" \"customer journey maps,\" \"market research,\" \"competitor analysis.\"\n-   **Product Strategy & Vision:** \"Product roadmap,\" \"product vision,\" \"OKRs\" (Objectives and Key Results), \"KPIs\" (Key Performance Indicators), \"product strategy,\" \"mission statement.\"\n-   **Requirements & Specifications:** \"Product Requirements Document (PRD),\" \"feature specifications,\" \"user stories,\" \"acceptance criteria,\" \"technical specifications,\" \"API documentation,\" \"design mockups,\" \"wireframes.\"\n-   **Development & Execution:** \"Sprint planning,\" \"backlog grooming,\" \"release notes,\" \"stand-up notes,\" \"retrospective,\" \"A/B test results,\" \"analytics reports,\" \"conversion funnels,\" \"churn rate,\" \"daily active users (DAU).\"\n-   **Go-to-Market (GTM) & Launch:** \"Go-to-market strategy,\" \"launch plan,\" \"pricing model,\" \"marketing plan,\" \"press release drafts,\" \"investor pitch deck,\" \"sales enablement material.\"\n-   **Business Context:** \"Business model canvas,\" \"TAM/SAM/SOM,\" \"burn rate,\" \"revenue projections,\" \"stakeholder updates.\"\n\n#### Information to Ignore (Noise):\n-   Individual source code files or detailed code reviews.\n-   Raw, unprocessed server logs or database dumps.\n-   Company-wide HR policies, employee performance reviews, or payroll information.\n-   Standard legal boilerplate (e.g., office lease agreements, generic NDAs).\n-   Internal IT support tickets or office administration documents (e.g., supply orders).\n-   Detailed departmental financial reports outside of the product/R&D budget.\n-   Recruiting and interview notes for non-product roles."
}