{
  "main_persona": "Product Manager",
  "sub_persona": "Technical Product Manager",
  "details": "#### Primary Objective:\nRetrieve all technical specifications, user requirements, engineering documentation, and market analysis to inform product decisions and guide development.\n\n#### Core Information to Retrieve:\n-   **Technical Documentation:** Phrases like \"technical specification,\" \"architecture diagram,\" \"system design,\" \"database schema,\" \"API documentation,\" \"data flow.\"\n-   **Product Requirements:** \"Product Requirements Document (PRD),\" \"user stories,\" \"acceptance criteria,\" \"use cases,\" \"feature requests.\"\n-   **Engineering & Development:** Bug reports, sprint plans, backlog items, \"technical debt,\" performance metrics (e.g., \"latency,\" \"uptime\"), post-mortems, incident reports.\n-   **Roadmapping & Strategy:** Product roadmaps, OKRs (Objectives and Key Results), project milestones, \"Q1 plan,\" \"H2 strategy,\" competitor analysis.\n-   **User & Market Data:** User feedback, A/B test results, analytics reports, market research, user personas, customer interview transcripts.\n-   **Specific Technologies:** Names of key technologies, frameworks, or platforms (e.g., \"AWS,\" \"Kubernetes,\" \"React,\" \"PostgreSQL,\" \"microservice\").\n-   **Integration & APIs:** \"API endpoints,\" \"SDK,\" \"third-party integration,\" \"authentication,\" \"webhooks.\"\n-   **Security & Compliance:** \"Security review,\" \"penetration test results,\" \"compliance,\" \"GDPR,\" \"SOC 2.\"\n\n#### Information to Ignore (Noise):\n-   Marketing and sales collateral (e.g., ad copy, email campaigns, sales scripts).\n-   General company financial reports (e.g., profit/loss statements, balance sheets).\n-   Human Resources documents (e.g., employee performance reviews, recruiting plans, benefits information).\n-   General administrative announcements (e.g., office closures, company-wide event planning).\n-   Low-level source code files (code comments and READMEs may be relevant, but entire codebases are not).\n-   Legal contracts with vendors or customers, unless they specify technical deliverables.\n-   IT support tickets for internal hardware or software issues."
}