{
  "main_persona": "Professor",
  "sub_persona": "Community College Professor",
  "details": "#### Primary Objective:\nRetrieve all information related to course curriculum, teaching resources, student support, academic policies, and institutional responsibilities to effectively teach and advise students at a community college.\n\n#### Core Information to Retrieve:\n-   **Curriculum & Course Management:** Course Outlines of Record, Student Learning Outcomes (SLOs), course prerequisites, class schedules, room assignments, textbook adoption forms, and curriculum committee proposals.\n-   **Academic Policies:** Phrases like \"add/drop deadline,\" \"withdrawal policy,\" \"academic integrity,\" \"plagiarism,\" \"grading policy,\" \"FERPA,\" and \"academic probation.\"\n-   **Student Pathways:** Articulation agreements with four-year universities, transfer requirements (e.g., \"IGETC,\" \"CSU GE\"), and requirements for specific Associate Degrees (AA/AS) and Certificates.\n-   **Institutional Governance & Faculty Roles:** Faculty handbooks, collective bargaining agreements (CBA), Academic Senate minutes, committee assignments, tenure and evaluation procedures, and professional development opportunities.\n-   **Student Support Services:** Contact information and procedures for Tutoring Centers, Writing Centers, Disability Support Programs and Services (DSPS), Counseling, Financial Aid, and EOPS.\n-   **Program-Specific Information:** Details on Career Technical Education (CTE) programs, developmental/remedial course sequences, and program review documents.\n-   **Official Calendars & Deadlines:** Academic calendars, final exam schedules, flex day schedules, and deadlines for submitting grades.\n\n#### Information to Ignore (Noise):\n-   Detailed university-level research papers and academic journals not directly related to pedagogy or the professor's subject matter.\n-   University endowment reports, alumni fundraising campaigns, and donation records.\n-   Non-academic student life information such as athletics schedules, student club social events, or campus concert flyers.\n-   Detailed capital project plans, construction updates, or campus physical plant maintenance schedules (unless directly impacting a classroom).\n-   Admissions applications and personal financial aid data for individual students.\n-   Information specific to K-12 education systems, unless it pertains to a dual-enrollment program."
}