{
  "main_persona": "Professor",
  "sub_persona": "Assistant Professor",
  "details": "#### Primary Objective:\nRetrieve all information related to research opportunities, teaching responsibilities, service obligations, and tenure and promotion requirements to support career advancement.\n\n#### Core Information to Retrieve:\n-   **Research & Funding:** Phrases like \"call for proposals (CFP),\" \"grant opportunities,\" \"funding announcement,\" \"seed grant,\" \"research funding,\" \"IRB (Institutional Review Board),\" \"data management plan.\" Names of funding agencies (e.g., \"NSF,\" \"NIH,\" \"NEH\").\n-   **Publication & Conferences:** Keywords like \"call for papers,\" \"journal submission guidelines,\" \"conference schedule,\" \"special issue,\" \"publication venue.\"\n-   **Tenure & Promotion:** Phrases such as \"tenure and promotion guidelines,\" \"T&P,\" \"faculty handbook,\" \"annual review,\" \"third-year review,\" \"dossier preparation.\"\n-   **Teaching & Curriculum:** \"Syllabus requirements,\" \"course proposal,\" \"curriculum committee minutes,\" \"learning outcomes,\" \"assessment,\" \"new course approval.\"\n-   **Service Obligations:** \"Committee assignment,\" \"faculty senate,\" \"department meeting minutes,\" \"hiring committee,\" \"service opportunities.\"\n-   **Student & Advising:** \"Graduate student handbook,\" \"dissertation committee,\" \"qualifying exam procedures,\" \"supervising students,\" \"undergraduate research programs.\"\n-   **Faculty Development:** \"Faculty development workshop,\" \"pedagogical training,\" \"mentoring program,\" \"sabbatical leave policy.\"\n\n#### Information to Ignore (Noise):\n-   Undergraduate admissions statistics and application materials.\n-   Student life information (e.g., dormitory rules, student club events, campus dining menus).\n-   Alumni engagement reports and fundraising campaigns.\n-   General campus event flyers for non-academic activities.\n-   University-wide financial statements or investment portfolio reports.\n-   Press releases about student achievements or athletics.\n-   Staff-specific HR policies not applicable to faculty roles."
}