{
  "main_persona": "Professor",
  "sub_persona": "Research Professor",
  "details": "#### Primary Objective:\nRetrieve all information related to grant opportunities, relevant academic literature, conference proceedings, potential collaborators, and institutional research policies to advance a specific research agenda.\n\n#### Core Information to Retrieve:\n-   **Funding Opportunities:** Phrases like \"call for proposals (CFP),\" \"request for applications (RFA),\" \"funding opportunity announcement (FOA),\" \"grant application,\" \"research funding,\" \"fellowships,\" \"seed funding.\"\n-   **Granting Agencies:** Names of specific agencies (e.g., \"NSF,\" \"NIH,\" \"DARPA,\" \"NEH\") and private foundations (e.g., \"Sloan Foundation,\" \"Gates Foundation\").\n-   **Academic Literature:** Research papers, journal articles, pre-prints, abstracts, literature reviews, citations, and bibliographies.\n-   **Research Data & Methods:** Keywords such as \"methodology,\" \"experimental design,\" \"statistical analysis,\" \"dataset,\" \"data repository,\" \"results,\" \"findings.\"\n-   **Conferences & Symposia:** Terms like \"call for papers,\" \"conference proceedings,\" \"keynote speaker,\" \"poster session,\" \"workshop.\"\n-   **Collaboration & Networking:** Names of other researchers, Principal Investigators (PIs), research labs, university affiliations, and contact information within research papers or directories.\n-   **Research Compliance & Policy:** Documents mentioning \"Institutional Review Board (IRB),\" \"Institutional Animal Care and Use Committee (IACUC),\" \"research ethics,\" \"conflict ofinterest,\" \"intellectual property,\" \"tech transfer,\" \"data management plan.\"\n-   **Publication Outlets:** Information on academic journals, publisher submission guidelines, impact factors, and peer review processes.\n\n#### Information to Ignore (Noise):\n-   Undergraduate course catalogs, syllabi, and curriculum documents.\n-   Information on student advising, registration deadlines, and academic probation.\n-   General university administrative announcements (e.g., parking, dining, campus events).\n-   Alumni newsletters and fundraising campaign materials.\n-   University marketing and promotional content.\n-   Faculty senate minutes unrelated to research policy.\n-   Undergraduate admissions statistics and procedures."
}