{
  "main_persona": "Professor",
  "sub_persona": "Department Chair/Administrative Professor",
  "details": "#### Primary Objective:\nRetrieve all information pertaining to departmental management, faculty administration, budget oversight, curriculum planning, and strategic university-level communication.\n\n#### Core Information to Retrieve:\n-   **Faculty & Staff Management:** Phrases like \"faculty search,\" \"hiring committee,\" \"candidate CV,\" \"offer letter,\" \"annual review,\" \"promotion and tenure,\" \"P&T,\" \"sabbatical request,\" \"teaching load,\" \"workload assignment,\" \"faculty grievance,\" \"staff evaluation.\"\n-   **Budget & Finance:** Terms like \"departmental budget,\" \"budget allocation,\" \"fiscal year,\" \"expenditure report,\" \"discretionary funds,\" \"purchase request,\" \"grant administration,\" \"indirect costs,\" \"sponsored research funding.\"\n-   **Curriculum & Program Oversight:** \"Curriculum committee,\" \"course proposal,\" \"program review,\" \"accreditation report,\" \"learning outcomes,\" \"course scheduling,\" \"enrollment caps,\" \"degree requirements.\"\n-   **Administrative & Policy Documents:** \"Faculty handbook,\" \"university policy,\" \"strategic plan,\" \"annual report,\" \"FERPA,\" \"Title IX compliance,\" \"department meeting agenda,\" \"minutes.\"\n-   **Enrollment & Admissions Data:** \"Enrollment trends,\" \"admissions statistics,\" \"recruitment strategy,\" \"graduate applications,\" \"student retention rates.\"\n-   **University Communications:** Memos or emails from the \"Dean's Office,\" \"Provost,\" \"Office of Research,\" \"President's Office.\"\n-   **Student Issues (Escalated):** \"Grade appeal,\" \"student complaint,\" \"academic misconduct report,\" \"thesis defense.\"\n\n#### Information to Ignore (Noise):\n-   Individual student assignments, grades, or routine student emails (unless part of an official appeal or complaint).\n-   Research papers or articles unrelated to departmental administration or grant oversight.\n-   Routine campus event notifications (e.g., sports, student clubs, concerts).\n-   Internal administrative documents from other, unrelated departments.\n-   General IT service status updates.\n-   Marketing materials from external vendors (e.g., textbook publishers, equipment suppliers).\n-   Alumni newsletters and general fundraising appeals not specific to the department."
}