{
  "main_persona": "Professor",
  "sub_persona": "Online Learning Professor",
  "details": "#### Primary Objective:\nRetrieve all information related to online course design, digital pedagogy, virtual classroom technologies, student engagement strategies, and assessment methods for remote learning environments.\n\n#### Core Information to Retrieve:\n-   **Digital Pedagogy & Strategy:** Phrases like \"online pedagogy,\" \"digital pedagogy,\" \"synchronous learning,\" \"asynchronous learning,\" \"flipped classroom,\" \"instructional design,\" \"universal design for learning (UDL).\"\n-   **Learning Technologies:** Names of Learning Management Systems (LMS) like \"Canvas,\" \"Blackboard,\" \"Moodle,\" \"Brightspace.\" Also, names of video conferencing tools (\"Zoom,\" \"Microsoft Teams\"), video hosting platforms (\"Panopto,\" \"Kaltura\"), and interactive tools (\"Poll Everywhere,\" \"Padlet,\" \"Miro\").\n-   **Course Design & Content:** \"Syllabus design for online courses,\" \"learning outcomes,\" \"module structure,\" \"course mapping,\" \"Open Educational Resources (OER).\"\n-   **Student Engagement:** \"Online discussion forums,\" \"virtual collaboration,\" \"student engagement strategies,\" \"online group projects,\" \"virtual office hours,\" \"netiquette.\"\n-   **Assessment & Integrity:** \"Online assessment,\" \"virtual proctoring,\" \"Respondus,\" \"Turnitin,\" \"academic integrity,\" \"plagiarism detection,\" \"rubric design,\" \"e-portfolios.\"\n-   **Accessibility:** \"Accessibility,\" \"WCAG 2.1,\" \"ADA compliance,\" \"captioning,\" \"screen reader friendly,\" \"alt text.\"\n-   **Faculty Development:** \"Faculty training for online teaching,\" \"workshops on educational technology,\" \"webinars on distance learning.\"\n-   **Policies & Research:** University policies specific to \"distance education,\" \"online course quality standards,\" and research articles or studies on the \"effectiveness of online learning.\"\n\n#### Information to Ignore (Noise):\n-   Information specific to on-campus, in-person classes (e.g., \"physical classroom assignments,\" \"room numbers,\" \"lab safety procedures\").\n-   University administrative information unrelated to academics (e.g., \"endowment reports,\" \"alumni fundraising,\" \"donor lists\").\n-   Campus logistics and facilities information (e.g., \"parking permits,\" \"construction notices,\" \"dining hall menus,\" \"building maintenance\").\n-   Student life information related to physical campus activities (e.g., \"dormitory policies,\" \"in-person club meetings,\" \"campus athletics schedules\").\n-   Highly technical IT infrastructure documents that do not concern end-user academic software."
}