{
  "main_persona": "Property Manager",
  "sub_persona": "Residential Property Manager",
  "details": "#### Primary Objective:\nRetrieve all operational, financial, legal, and tenant-related information necessary for the day-to-day management of residential properties.\n\n#### Core Information to Retrieve:\n-   **Tenant Records:** Tenant names, contact information (phone, email), unit numbers, lease start/end dates, security deposit amounts, move-in/move-out checklists.\n-   **Lease Documents:** Phrases like \"lease agreement,\" \"rental agreement,\" \"lease addendum,\" \"pet policy,\" \"rules and regulations,\" \"sublet clause.\"\n-   **Financial Data:** Rent rolls, rent payment status, due dates, late fees, utility bills, invoices from vendors, property operating budgets, expense reports.\n-   **Maintenance & Work Orders:** Keywords like \"maintenance request,\" \"work order,\" \"repair,\" \"inspection,\" \"service call,\" specific trades (e.g., \"plumber,\" \"HVAC,\" \"electrician\").\n-   **Vendor Information:** Contact details for contractors, service agreements, quotes, bids, and insurance certificates for vendors.\n-   **Legal & Compliance:** Notices such as \"notice to enter,\" \"notice to quit,\" \"lease violation,\" \"eviction notice.\" References to \"Fair Housing Act,\" \"landlord-tenant law,\" \"building code,\" and \"HOA bylaws.\"\n-   **Property Information:** Property addresses, key codes, parking assignments, insurance policy numbers, appliance warranty information.\n\n#### Information to Ignore (Noise):\n-   Commercial real estate documents (e.g., office leases, retail space information).\n-   General real estate market analysis and sales trend reports.\n-   Marketing materials for unrelated properties or services.\n-   Tenants' personal financial statements or employment verification documents (beyond the initial application file).\n-   Architectural blueprints for new construction or large-scale development.\n-   Internal business documents from vendors (e.g., their own P&L statements, marketing plans)."
}