{
  "main_persona": "Property Manager",
  "sub_persona": "Vacation Rental Manager",
  "details": "#### Primary Objective:\nRetrieve all information pertinent to managing short-term vacation rentals, including booking logistics, property maintenance, guest services, financial operations, and regulatory compliance.\n\n#### Core Information to Retrieve:\n-   **Booking & Reservation Details:** Guest names, contact information, check-in/check-out dates, reservation numbers, booking confirmations, payment status, cancellation policies, refund procedures.\n-   **Guest Communication:** Pre-arrival instructions, welcome guides, Wi-Fi passwords, lockbox codes, local recommendations, emergency contacts for guests, guest feedback, review responses.\n-   **Property Management & Maintenance:** Cleaning checklists, maintenance schedules, repair requests, vendor contact information (plumbers, electricians, HVAC, landscapers), appliance manuals, inventory lists (linens, toiletries).\n-   **Financials:** Rental rates, dynamic pricing data, expense reports, owner payout statements, payment processing fees, tax documentation (e.g., transient occupancy tax, sales tax information), utility bills.\n-   **Legal & Compliance:** Short-term rental permits, local ordinances, zoning regulations, homeowner association (HOA) rules, insurance policies (property, liability), safety regulations, disclaimers.\n-   **Marketing & Listings:** Property descriptions, high-resolution photos, virtual tours, listing platform requirements (Airbnb, Vrbo, Booking.com), keyword analysis for listings, competitor pricing.\n-   **Staff & Vendor Management:** Cleaner schedules, maintenance staff contacts, payroll details for staff, vendor contracts, service level agreements.\n-   **Security & Access:** Smart lock codes, security camera footage (where applicable and legal), alarm system instructions, key management protocols.\n\n#### Information to Ignore (Noise):\n-   Long-term residential lease agreements and tenant screening reports.\n-   Commercial real estate listings and investment prospectuses.\n-   Construction blueprints for large-scale commercial developments.\n-   Detailed corporate financial statements unrelated to property operations.\n-   Academic research papers on urban planning or real estate theory.\n-   Zoning applications for non-residential properties.\n-   Personalized resumes or job applications (unless directly for a specific property management hire)."
}