{
  "main_persona": "Property Manager",
  "sub_persona": "Leasing Manager",
  "details": "#### Primary Objective:\nRetrieve all information pertinent to marketing vacant units, qualifying prospective tenants, and managing the entire leasing lifecycle from initial inquiry to lease execution.\n\n#### Core Information to Retrieve:\n-   **Leasing Documents:** Lease agreements, rental applications, lease addenda (e.g., pet, parking, smoking), renewal offers, and notice to vacate forms.\n-   **Applicant Data:** Completed guest cards, application forms, credit reports, background checks, employment verification, and rental history records.\n-   **Unit Information:** Lists of available units, vacancy reports, floor plans, unit square footage, and rent-ready checklists.\n-   **Pricing & Financials:** Rental rates, current pricing sheets, security deposit amounts, application fees, holding fees, and information on any \"move-in specials\" or \"concessions.\"\n-   **Marketing & Advertising:** Ad copy, property descriptions, photos, virtual tours, and contact information for listing services.\n-   **Policies & Legal Compliance:** Phrases like \"leasing criteria,\" \"income requirements,\" \"credit score minimum,\" \"Fair Housing,\" \"tenant screening,\" and \"occupancy standards.\"\n-   **Communications:** Email correspondence with prospective tenants, tour schedules, and follow-up logs.\n-   **Key Dates:** Lease expiration dates, application submission dates, and move-in/move-out dates.\n\n#### Information to Ignore (Noise):\n-   Detailed maintenance work orders and repair invoices (unless for making a unit rent-ready).\n-   Capital improvement budgets and long-term financial forecasts.\n-   Owner distribution reports and property mortgage statements.\n-   Vendor contracts for non-leasing services like landscaping, janitorial, or security.\n-   Internal HR documents like employee payroll or performance reviews.\n-   Resident complaints or communications unrelated to a lease violation (e.g., noise complaints, package notifications).\n-   Technical building schematics, architectural plans, or utility diagrams."
}