{
  "main_persona": "Property Manager",
  "sub_persona": "Industrial Property Manager",
  "details": "#### Primary Objective:\nRetrieve all operational, financial, legal, and maintenance information pertinent to managing industrial real estate assets and tenant relationships.\n\n#### Core Information to Retrieve:\n-   **Lease & Tenant Documentation:** Lease agreements, rent rolls, tenant contact lists, lease abstracts, commencement/expiration dates, renewal options.\n-   **Financial Data:** Operating budgets, capital expenditure (CapEx) plans, CAM (Common Area Maintenance) reconciliations, accounts payable/receivable, property tax statements, vendor invoices.\n-   **Maintenance & Operations:** Service contracts (HVAC, landscaping, janitorial, security), work orders, maintenance logs, inspection reports (roof, sprinkler, fire safety), property condition assessments (PCAs).\n-   **Property Specifications:** Building square footage, clear height, number of dock-high doors, number of grade-level/drive-in doors, power specifications (Amps, Volts, Phase), truck court depth, site plans, as-built drawings.\n-   **Legal & Compliance Documents:** Certificates of Insurance (COI) for tenants and vendors, building permits, zoning information, environmental reports (Phase I ESA), service level agreements (SLAs), code violation notices.\n-   **Vendor & Contractor Information:** Contact lists for approved vendors, contractor bids, requests for proposal (RFPs), scopes of work (SOW).\n-   **Emergency & Safety:** Emergency contact lists, evacuation plans, fire suppression system details, incident reports.\n\n#### Information to Ignore (Noise):\n-   Residential leasing information (e.g., apartment amenities, pet policies, rent control).\n-   Retail-specific leasing terms (e.g., percentage rent, sales reports, co-tenancy clauses).\n-   Internal HR documents for the property management company (e.g., employee payroll, benefits).\n-   Marketing materials for the tenants' products or services.\n-   Detailed financial reports of tenant companies (unless part of a lease application).\n-   General market economic news not specific to the industrial real estate sector.\n-   Office property metrics like tenant improvement (TI) allowances or parking ratios per employee."
}