{
  "main_persona": "Property Manager",
  "sub_persona": "Student Housing Manager",
  "details": "#### Primary Objective:\nRetrieve all information related to leasing, tenant management, property maintenance, and financial administration specific to student housing operations.\n\n#### Core Information to Retrieve:\n-   **Leasing & Occupancy:** Lease agreements, rental applications, guarantor forms, co-signer agreements, rental rates, floor plans, and terms like \"pre-lease,\" \"occupancy rate,\" \"renewal,\" \"concessions,\" and \"traffic report.\"\n-   **Tenant & Resident Information:** Resident rosters, contact information (phone, email), emergency contacts, vehicle information, and associated unit numbers.\n-   **Financial Documents:** Rent rolls, resident ledgers, delinquency reports, security deposit statements, move-out charges, utility bills, vendor invoices, and property-level budgets.\n-   **Maintenance & Work Orders:** Service requests, work order logs, preventative maintenance schedules, vendor contact lists, and contractor bids or quotes.\n-   **Property Operations & Rules:** Community rules and regulations, resident handbooks, pool rules, parking policies, and pet policies.\n-   **Inspections & Safety:** Move-in/move-out inspection forms, unit condition reports, incident reports, fire safety plans, and building code compliance documents.\n-   **Key Dates & Schedules:** Move-in and move-out dates, university academic calendars, rent due dates, and lease renewal deadlines.\n-   **Communications:** Official resident notices, email templates for common issues (e.g., late rent, noise complaints), move-out instructions, and marketing materials.\n\n#### Information to Ignore (Noise):\n-   Tenants' personal academic documents (e.g., class schedules, grades, homework).\n-   High-level corporate financial reports (e.g., parent company stock performance, annual shareholder reports).\n-   Highly technical architectural or engineering blueprints and schematics.\n-   Personal correspondence between tenants that is not related to a property issue.\n-   Vendor's internal business documents (e.g., their employee handbooks, strategic plans).\n-   General real estate market analysis not specific to the local student housing market.\n-   Marketing materials from unrelated industries or competitors' internal strategy documents."
}