{
  "main_persona": "Property Manager",
  "sub_persona": "Commercial Property Manager",
  "details": "#### Primary Objective:\nRetrieve all operational, financial, legal, and tenant-related documentation necessary for managing commercial properties effectively.\n\n#### Core Information to Retrieve:\n-   **Lease Agreements & Documents:** Keywords like \"lease agreement,\" \"lease abstract,\" \"rent roll,\" \"commencement date,\" \"expiration date,\" \"renewal option,\" \"escalation clause,\" \"rent schedule,\" \"tenant improvement allowance (TI),\" and \"common area maintenance (CAM) charges.\"\n-   **Financial Records:** \"Operating budget,\" \"capital expenditures (CapEx),\" \"net operating income (NOI),\" \"accounts receivable aging,\" \"invoices\" (from vendors/contractors), \"property tax statements,\" \"utility bills,\" and \"financial statements.\"\n-   **Maintenance & Operations:** \"Work orders,\" \"maintenance logs,\" \"preventive maintenance schedules,\" \"service contracts\" (for HVAC, janitorial, landscaping, security, elevators), \"inspection reports\" (fire, safety, structural), \"building permits.\"\n-   **Vendor & Tenant Information:** \"Vendor lists,\" \"contractor contact information,\" \"tenant contact lists,\" \"emergency contact information,\" \"certificates of insurance (COI)\" for both tenants and vendors.\n-   **Legal & Compliance Documents:** \"Building codes,\" \"zoning ordinances,\" \"ADA compliance reports,\" \"environmental reports\" (e.g., asbestos, Phase I ESA), \"eviction notices,\" \"legal correspondence,\" \"property deeds.\"\n-   **Building Schematics & Plans:** \"As-built drawings,\" \"blueprints,\" \"floor plans,\" \"site plans.\"\n-   **Vacancy & Marketing:** \"Vacancy reports,\" \"market rent analysis,\" \"listing agreements,\" \"marketing brochures.\"\n\n#### Information to Ignore (Noise):\n-   Residential lease agreements or information specific to residential tenants.\n-   Internal business documents of tenants (e.g., their corporate P&L, employee handbooks, sales data).\n-   Personal financial information of tenants or their employees.\n-   Marketing materials for properties not in the managed portfolio.\n-   General news articles about the real estate market unless it's a specific local market rent analysis.\n-   Corporate-level financial reports of the property's owner (e.g., parent company stock performance).\n-   Outdated service contracts or expired leases (unless needed for historical reference)."
}