{
  "main_persona": "Property Manager",
  "sub_persona": "Portfolio Property Manager",
  "details": "#### Primary Objective:\nRetrieve all financial, operational, legal, and tenant-related documentation necessary to manage and report on a diverse portfolio of properties.\n\n#### Core Information to Retrieve:\n-   **Financial Documents:** Rent rolls, profit and loss (P&L) statements, operating budgets, capital expenditure (CapEx) budgets, delinquency reports, accounts receivable/payable reports.\n-   **Leasing Information:** Lease agreements, lease abstracts, renewal offers, applications, tenant screening reports, move-in/move-out inspection forms.\n-   **Legal & Compliance:** Service contracts (landscaping, janitorial, security), insurance certificates and policies, property tax statements, permits, Certificates of Occupancy, violation notices, eviction filings.\n-   **Operational Reports:** Maintenance work orders, property inspection reports, vendor lists and contact information, utility bills (master-metered), incident reports.\n-   **Tenant Relations:** Tenant contact lists, formal complaints, communication logs, building notices, and announcements.\n-   **Key Performance Indicators (KPIs):** Phrases like \"Net Operating Income (NOI),\" \"vacancy rate,\" \"occupancy rate,\" \"rent per square foot,\" \"budget vs. actual.\"\n-   **Property Details:** Property addresses, unit numbers, square footage, amenity lists.\n\n#### Information to Ignore (Noise):\n-   Individual tenant's personal correspondence not related to the property (e.g., personal emails, bank statements).\n-   Marketing brochures or flyers for prospective tenants.\n-   General real estate market news and articles not specific to the portfolio's assets.\n-   Internal HR documents from vendor companies (e.g., a security guard's timesheet).\n-   Detailed architectural or engineering schematics (unless tied to a specific capital project plan).\n-   Raw, un-invoiced utility usage data.\n-   Sales catalogs from unapproved vendors or suppliers."
}