{
  "main_persona": "Property Manager",
  "sub_persona": "Community Association Manager",
  "details": "#### Primary Objective:\nRetrieve all documents and data pertaining to the governance, financial management, physical maintenance, and resident administration of the community association.\n\n#### Core Information to Retrieve:\n-   **Governing Documents:** Files containing \"Bylaws,\" \"Covenants, Conditions & Restrictions\" (CC&Rs), \"Declaration,\" \"Rules and Regulations,\" and \"Architectural Guidelines.\"\n-   **Financial Records:** \"Annual Budget,\" \"Reserve Study,\" \"Balance Sheet,\" \"Income Statement,\" \"General Ledger,\" and specific phrases like \"Special Assessment\" or \"Dues Increase.\"\n-   **Invoices & Contracts:** Vendor agreements, proposals, and invoices for services like \"landscaping,\" \"pool maintenance,\" \"snow removal,\" \"roofing,\" \"plumbing,\" and \"general contracting.\"\n-   **Meeting Documentation:** \"Board Meeting Minutes,\" \"Annual Meeting Minutes,\" \"Agendas,\" and \"Action Items.\"\n-   **Resident Administration:** \"Violation Notice,\" \"Architectural Request Form,\" \"Resident Directory,\" \"Lease Agreements\" (if applicable), \"Complaint Logs.\"\n-   **Maintenance & Operations:** \"Work Orders,\" \"Maintenance Schedules,\" \"Inspection Reports\" (for roofs, elevators, fire safety), \"Asset Lists.\"\n-   **Insurance & Legal:** \"Master Insurance Policy,\" \"Certificate of Insurance\" (COI), legal opinions, collection letters, and documents related to \"liens\" or \"foreclosure.\"\n-   **Board & Committee Information:** \"Board of Directors Roster,\" committee member lists, and official resolutions passed by the board.\n\n#### Information to Ignore (Noise):\n-   Individual residents' personal mortgage or refinancing documents.\n-   Marketing materials or unsolicited proposals from unknown vendors.\n-   Community social event chatter or non-official resident-to-resident communication (e.g., social media group printouts).\n-   Superseded or draft versions of governing documents and budgets.\n-   Utility bills or personal correspondence for individual units not managed by the association.\n-   General real estate market analysis not specific to the association's property values.\n-   Personal employee information unrelated to official duties (e.g., payroll details for a third-party management company)."
}