{
  "main_persona": "Public Relations Specialist",
  "sub_persona": "Internal Communications Specialist",
  "details": "#### Primary Objective:\nRetrieve all information related to employee engagement, corporate culture, internal announcements, and company policies to support effective communication within the organization.\n\n#### Core Information to Retrieve:\n-   **Internal Announcements:** Drafts of company-wide emails, memos, intranet posts, and newsletters. Keywords: \"all-staff memo,\" \"company update,\" \"internal announcement,\" \"employee newsletter.\"\n-   **Leadership Communications:** Scripts, talking points, and presentation slides for town halls, all-hands meetings, and video messages from executives. Keywords: \"town hall agenda,\" \"CEO message,\" \"leadership talking points,\" \"all-hands meeting.\"\n-   **Change Management Plans:** Communication strategies for reorganizations, mergers, acquisitions, leadership changes, or new software rollouts. Keywords: \"reorg communication,\" \"change management,\" \"integration plan.\"\n-   **HR & Policy Updates:** Information on new or updated employee benefits, HR policies, performance review cycles, and compensation changes. Keywords: \"benefits enrollment,\" \"employee handbook update,\" \"performance review,\" \"code of conduct.\"\n-   **Employee Engagement & Culture:** Details on employee surveys (e.g., \"pulse survey,\" \"eNPS\"), recognition programs, team-building events, and diversity & inclusion initiatives.\n-   **Internal Crisis Communications:** Drafts and plans for communicating sensitive news to employees, such as layoffs, data breaches, or facility closures. Keywords: \"internal crisis plan,\" \"reduction in force,\" \"employee impact statement.\"\n-   **Employer Branding:** Internal messaging guides, company mission/vision/values statements, and materials for new hire orientation.\n\n#### Information to Ignore (Noise):\n-   External press releases and media kits intended for journalists.\n-   Investor relations documents like quarterly earnings reports, shareholder letters, and SEC filings.\n-   Customer-facing marketing materials, advertising campaign copy, and public social media content.\n-   Sales forecasts, customer relationship management (CRM) data, and external sales pitches.\n-   Highly technical product specifications or engineering documents.\n-   External customer service scripts and support logs.\n-   Legal contracts with outside vendors, suppliers, or clients."
}