{
  "main_persona": "Public Health Official",
  "sub_persona": "Infectious Disease Investigator",
  "details": "#### Primary Objective:\nRetrieve all information pertinent to the surveillance, investigation, control, and prevention of infectious disease outbreaks and public health threats.\n\n#### Core Information to Retrieve:\n-   **Disease Epidemiology:** Incidence rates, prevalence, morbidity, mortality, case counts, geographic distribution, demographic data (age, sex, location), outbreak curves.\n-   **Pathogen Information:** Specific bacteria, viruses, fungi, parasites; strain types, antimicrobial resistance patterns, virulence factors, genomic sequencing data.\n-   **Clinical Manifestations:** Symptoms, signs, diagnostic criteria, incubation periods, disease progression, complications, differential diagnoses.\n-   **Transmission Routes:** Modes of transmission (e.g., airborne, droplet, direct contact, vector-borne, food/waterborne), R0 values, chains of infection.\n-   **Surveillance Data:** Notifiable disease reports, laboratory test results (positive/negative), serology data, hospital admissions for specific conditions, syndromic surveillance alerts.\n-   **Outbreak Investigation Protocols:** Case definitions, contact tracing logs, interview questionnaires, cluster analysis, source identification, environmental sampling results.\n-   **Public Health Interventions:** Quarantine and isolation guidelines, vaccination campaigns, treatment protocols, prophylaxis recommendations, public health advisories, risk communication strategies.\n-   **Laboratory Methods:** PCR results, culture and sensitivity reports, serological assays, specimen collection and handling guidelines, diagnostic test accuracy.\n-   **Regulatory & Policy Documents:** Public health laws, reporting requirements, disease control regulations, emergency preparedness plans, international health regulations (IHR).\n-   **Risk Factors:** Environmental exposures, animal reservoirs (zoonotic), travel history, food/water sources, population vulnerabilities.\n-   **Vaccines & Treatments:** Vaccine efficacy, adverse event reporting, treatment guidelines, drug resistance data, supply chain information for medical countermeasures.\n-   **Academic Research:** Peer-reviewed studies, clinical trials, meta-analyses related to infectious diseases, emerging pathogens, and public health interventions.\n\n#### Information to Ignore (Noise):\n-   Non-infectious disease research or clinical data (e.g., oncology trials, chronic disease management).\n-   General administrative documents unrelated to disease control (e.g., HR policies, budget reports for non-health departments).\n-   Marketing materials for non-medical products or services.\n-   Detailed financial statements of private companies or general government budgets.\n-   Non-scientific opinion pieces or editorials on public health policy without supporting data.\n-   Campus event schedules or general community notices unrelated to health advisories.\n-   Highly specialized engineering schematics or construction plans.\n-   Personal medical records not aggregated or de-identified for surveillance purposes."
}