{
  "main_persona": "Public Relations Specialist",
  "sub_persona": "PR Agency Account Executive",
  "details": "#### Primary Objective:\nRetrieve all information related to media contacts, industry trends, client media coverage, and performance metrics to effectively manage public relations campaigns for agency clients.\n\n#### Core Information to Retrieve:\n-   **Media Contacts:** Journalist names, editor names, producer names, beat/specialty (e.g., \"covers consumer tech\"), media outlet names, contact information (emails, social media handles).\n-   **Media Opportunities:** Phrases like \"editorial calendar,\" \"call for experts,\" \"request for comment,\" \"media query,\" \"speaker submission,\" \"award nomination.\"\n-   **PR Campaign Language:** \"Press release,\" \"media alert,\" \"pitch,\" \"media kit,\" \"fact sheet,\" \"boilerplate,\" \"talking points.\"\n-   **Client & Competitor Monitoring:** Client company names, key executive names, product names, competitor company names, and mentions of any of these in articles.\n-   **Performance Metrics:** Terms like \"media mentions,\" \"share of voice (SOV),\" \"sentiment analysis,\" \"audience reach,\" \"impressions,\" \"ad value equivalency (AVE),\" \"key message pull-through.\"\n-   **Industry Information:** Market trends, analyst reports, competitor announcements, industry-specific keywords (e.g., \"fintech,\" \"SaaS,\" \"biopharma\").\n-   **Reporting Data:** Tables, charts, or summaries of media coverage, client reporting dashboards (e.g., from Cision, Meltwater, Muck Rack), campaign performance reports.\n\n#### Information to Ignore (Noise):\n-   Internal agency financial reports, P&L statements, or billing invoices.\n-   Agency HR documents like payroll, employee reviews, or benefits information.\n-   Client's internal-only documents like engineering schematics, source code, or internal HR policies.\n-   Advertising rate cards or media buying information.\n-   General news articles that have no mention of clients, competitors, or relevant industries.\n-   Vendor contracts and legal agreements not directly related to media services."
}