{
  "main_persona": "Public Relations Specialist",
  "sub_persona": "Public Affairs Specialist",
  "details": "#### Primary Objective:\nRetrieve all information regarding legislation, public policy, government actions, and stakeholder sentiment that could impact the organization's reputation and operational interests.\n\n#### Core Information to Retrieve:\n-   **Government & Legislative Documents:** Bill numbers (e.g., \"H.R. 305,\" \"S. 121\"), legislation titles, names of laws, public hearing transcripts, congressional records.\n-   **Policy & Regulatory Keywords:** Phrases like \"public policy,\" \"regulation,\" \"compliance,\" \"government affairs,\" \"public comment period,\" \"proposed rule,\" \"regulatory impact analysis.\"\n-   **Key Individuals & Entities:** Names of elected officials, political appointees, government agencies (e.g., EPA, FCC, FTC), regulatory bodies, legislative committees, and influential think tanks.\n-   **Stakeholder & Community Information:** Names of community groups, activist organizations, non-profits, industry associations, and key community leaders. Keywords like \"stakeholder engagement,\" \"community outreach,\" \"town hall,\" \"public meeting.\"\n-   **Communication & Media:** Press releases, media advisories, official statements, talking points, briefing documents, op-eds, and letters to the editor concerning policy or community issues.\n-   **Advocacy & Lobbying Terms:** \"Lobbying,\" \"advocacy campaign,\" \"grassroots,\" \"Political Action Committee (PAC),\" \"coalition building,\" \"corporate social responsibility (CSR).\"\n-   **Polling & Sentiment Data:** Public opinion polls, surveys, sentiment analysis reports related to relevant policies or the organization's public standing.\n\n#### Information to Ignore (Noise):\n-   Product-specific marketing materials, sales promotions, and advertisements.\n-   Internal human resources documents (e.g., employee benefits, performance reviews, internal memos).\n-   Detailed financial reports, stock performance data, and investor calls unless they are directly tied to a public policy issue.\n-   Highly technical or scientific research data not intended for public or government consumption.\n-   General news or media mentions unrelated to policy, regulation, or community relations.\n-   Routine administrative documents like invoices, purchase orders, or supply chain logistics."
}