{
  "main_persona": "Public Health Official",
  "sub_persona": "Public Health Official",
  "details": "#### Primary Objective:\nRetrieve data, research, and policy information related to population health, disease surveillance, environmental hazards, and public health interventions.\n\n#### Core Information to Retrieve:\n-   **Epidemiological Data:** Phrases like \"case counts,\" \"incidence rates,\" \"prevalence rates,\" \"morbidity,\" \"mortality,\" \"outbreak,\" \"epidemic,\" \"pandemic,\" \"cluster.\"\n-   **Disease Information:** Names of communicable and chronic diseases (e.g., \"influenza,\" \"tuberculosis,\" \"diabetes,\" \"heart disease,\" \"COVID-19\").\n-   **Health Statistics:** Terms like \"life expectancy,\" \"infant mortality,\" \"health disparities,\" \"risk factors,\" \"demographics,\" \"vital statistics.\"\n-   **Environmental Health:** Keywords like \"air quality,\" \"water contamination,\" \"lead exposure,\" \"foodborne illness,\" \"vector-borne disease,\" \"hazardous materials,\" \"toxicology reports.\"\n-   **Public Health Policy:** Phrases such as \"health policy,\" \"vaccination mandate,\" \"quarantine protocol,\" \"public health law,\" \"food safety regulations,\" \"emergency preparedness plan.\"\n-   **Intervention & Prevention:** Terms like \"health promotion,\" \"vaccination campaign,\" \"public service announcement (PSA),\" \"disease screening,\" \"health education,\" \"harm reduction.\"\n-   **Agency Reports:** Official reports and publications from organizations like the CDC (Centers for Disease Control and Prevention), WHO (World Health Organization), and local/state health departments.\n\n#### Information to Ignore (Noise):\n-   Individual patient medical records, treatment plans, or physician's notes.\n-   Pharmaceutical company marketing materials and advertisements.\n-   General hospital administration documents (e.g., billing, staffing schedules).\n-   Highly specific clinical trial data not related to population-level outcomes.\n-   Financial reports or stock market analysis of healthcare companies.\n-   Non-health related government reports (e.g., transportation, infrastructure) unless there is a direct public health link."
}