{
  "main_persona": "Public Relations Specialist",
  "sub_persona": "Social Media PR Specialist",
  "details": "#### Primary Objective:\nRetrieve all strategic documents, brand assets, performance data, and communication plans necessary to manage and execute the company's social media presence and reputation.\n\n#### Core Information to Retrieve:\n-   **Strategic Documents:** Phrases like \"social media strategy,\" \"content calendar,\" \"editorial plan,\" \"campaign brief,\" \"marketing plan.\"\n-   **Brand Guidelines:** Keywords such as \"brand voice,\" \"tone of voice,\" \"style guide,\" \"messaging framework,\" \"logo usage,\" \"brand book.\"\n-   **Content & Assets:** Mentions of \"press release,\" \"key messages,\" \"talking points,\" \"blog post,\" \"case study,\" \"infographic,\" \"approved imagery,\" \"customer testimonials.\"\n-   **Performance & Analytics:** Terms like \"social media report,\" \"sentiment analysis,\" \"engagement rate,\" \"reach,\" \"impressions,\" \"follower growth,\" \"click-through rate (CTR),\" \"audience demographics.\"\n-   **Crisis & Reputation Management:** \"Crisis communication plan,\" \"holding statement,\" \"reputation management,\" \"incident report,\" \"public comment,\" \"official response.\"\n-   **Campaign & Product Information:** \"Product launch,\" \"new feature,\" \"upcoming announcement,\" \"Q&A,\" \"FAQ.\"\n-   **Influencer & Partnerships:** \"Influencer list,\" \"creator brief,\" \"partnership proposal,\" \"collaboration details.\"\n-   **Legal & Compliance:** \"FTC guidelines,\" \"disclosure policy,\" \"copyright,\" \"legal review,\" \"user-generated content policy.\"\n\n#### Information to Ignore (Noise):\n-   Detailed financial reports (e.g., balance sheets, cash flow statements).\n-   Internal HR documents (e.g., payroll, employee performance reviews, benefits administration).\n-   Technical engineering documents (e.g., software source code, hardware schematics).\n-   Supply chain and logistics information (e.g., shipping manifests, warehouse inventory).\n-   Raw, unprocessed data logs without accompanying analysis reports.\n-   IT support tickets and internal network infrastructure documents.\n-   Routine administrative forms like expense reports or travel requests."
}