{
  "main_persona": "Public Health Official",
  "sub_persona": "Health Policy Analyst",
  "details": "#### Primary Objective:\nRetrieve all data, analysis, and official documents related to health policies, legislation, regulations, and their socio-economic impact on public health outcomes.\n\n#### Core Information to Retrieve:\n-   **Policy & Legislation:** Phrases like \"public law,\" \"health act,\" \"senate bill,\" \"proposed legislation,\" \"regulation,\" \"mandate,\" \"policy brief,\" \"white paper,\" \"executive order,\" \"public comment.\"\n-   **Government & Health Agencies:** Reports and publications from the CDC, WHO, NIH, FDA, HHS (Health and Human Services), CMS (Centers for Medicare & Medicaid Services), and state/local departments of health.\n-   **Economic Data:** Terms like \"cost-benefit analysis,\" \"health economics,\" \"healthcare spending,\" \"budget allocation,\" \"reimbursement rates,\" \"insurance coverage,\" \"pharmaceutical pricing.\"\n-   **Public Health Statistics:** Epidemiological data, morbidity/mortality rates, prevalence, incidence, life expectancy, health disparities, demographic data, and social determinants of health.\n-   **Specific Policy Areas:** Information concerning \"vaccine policy,\" \"opioid crisis,\" \"tobacco control,\" \"mental health parity,\" \"Affordable Care Act (ACA),\" \"Medicare/Medicaid reform,\" \"emergency preparedness,\" \"environmental health standards.\"\n-   **Outcomes & Analysis:** Phrases like \"policy impact,\" \"program evaluation,\" \"health outcomes,\" \"systematic review,\" \"meta-analysis,\" \"comparative effectiveness.\"\n-   **Stakeholder Information:** Reports from \"advocacy groups,\" \"professional associations,\" \"hospital associations,\" \"think tanks,\" and transcripts from \"public hearings\" or \"committee meetings.\"\n\n#### Information to Ignore (Noise):\n-   Individual patient health records, medical charts, or any Protected Health Information (PHI).\n-   Detailed clinical trial protocols, surgical procedure guides, or specific treatment plans for individuals.\n-   Basic science research (e.g., molecular biology, genetic sequencing) that does not have a direct policy implication summary.\n-   Marketing materials and advertisements for pharmaceuticals, medical devices, or private hospitals.\n-   Internal administrative documents like hospital staff schedules, routine departmental memos, or supply chain logistics.\n-   News articles focused on individual patient stories or hospital-specific human interest pieces."
}