{
  "main_persona": "Public Relations Specialist",
  "sub_persona": "Non-Profit PR Manager",
  "details": "#### Primary Objective:\nRetrieve all information related to media coverage, stakeholder communications, brand representation, and campaign performance to manage the non-profit's public reputation and mission-driven outreach.\n\n#### Core Information to Retrieve:\n-   **Media Mentions:** The non-profit's name, names of key personnel (CEO, Board Members), program names, and campaign titles mentioned in articles, press releases, or media alerts.\n-   **Journalist & Outlet Information:** Names of reporters, media outlets, and journalists who have covered the organization or its cause.\n-   **PR Campaign Metrics:** Data on \"media impressions,\" \"audience reach,\" \"share of voice,\" \"website traffic,\" \"social media engagement,\" and \"sentiment analysis\" (e.g., \"positive coverage,\" \"criticism\").\n-   **Stakeholder Communications:** Drafts and final versions of donor newsletters, annual reports, fundraising appeals, and volunteer engagement emails.\n-   **Branding & Messaging:** Official \"mission statement,\" \"vision,\" \"key messages,\" \"talking points,\" \"brand guidelines,\" and \"style guides.\"\n-   **Storytelling Content:** Beneficiary \"testimonials,\" \"success stories,\" \"case studies,\" and impactful quotes that can be used in public materials.\n-   **Partnership & Sponsorship Information:** Names of corporate sponsors, partner organizations, foundations, and details of co-branded campaigns or \"partnership announcements.\"\n-   **Crisis Communication:** Keywords like \"crisis,\" \"controversy,\" \"retraction,\" \"public statement,\" \"complaint,\" or \"negative feedback\" related to the organization's reputation.\n-   **Event Information:** Details on fundraising galas, press conferences, community outreach events, and awareness campaigns.\n\n#### Information to Ignore (Noise):\n-   Internal financial documents like detailed expense reports, department-level budgets, and payroll records.\n-   Routine internal administrative communications and IT support documents.\n-   Human Resources documents concerning individual employee performance, benefits, or hiring paperwork (unless for a key public-facing executive).\n-   Raw, unanalyzed program data or logistical plans that lack a storytelling or public impact angle.\n-   Vendor solicitations and general marketing spam.\n-   Grant applications and reports, unless specifically extracting the \"communications plan\" or \"public outreach\" sections.\n-   Highly technical or legal jargon from contracts not related to public-facing sponsorships or partnerships."
}