{
  "main_persona": "Public Relations Specialist",
  "sub_persona": "Investor Relations Specialist",
  "details": "#### Primary Objective:\nRetrieve all financial performance data, strategic communications, and market-relevant information necessary to manage investor perceptions and ensure regulatory compliance.\n\n#### Core Information to Retrieve:\n-   **Financial Performance Data:** Keywords like \"revenue,\" \"net income,\" \"earnings per share (EPS),\" \"EBITDA,\" \"profit margin,\" \"operating cash flow,\" \"free cash flow,\" \"balance sheet,\" \"income statement.\"\n-   **Regulatory Filings:** Document names like \"Form 10-K,\" \"Form 10-Q,\" \"Form 8-K,\" \"Proxy Statement,\" \"Schedule 13D.\"\n-   **Executive Commentary:** Quotes from the CEO, CFO, or other C-suite executives, especially within the \"Management Discussion and Analysis\" (MD&A) section.\n-   **Forward-Looking Statements:** Phrases such as \"guidance,\" \"outlook,\" \"forecast,\" \"projections,\" and \"safe harbor statement.\"\n-   **Corporate Actions:** Terms like \"merger,\" \"acquisition,\" \"divestiture,\" \"stock buyback,\" \"share repurchase,\" \"dividend announcement,\" \"strategic partnership.\"\n-   **Investor Presentations & Earnings Calls:** Content from slide decks, prepared remarks, and Q&A transcripts from investor-focused events.\n-   **Risk Factors:** The \"Risk Factors\" section of annual/quarterly reports detailing potential challenges to the business.\n-   **Ownership & Stock Data:** Information on \"institutional ownership,\" \"shareholder,\" \"stock price,\" \"market capitalization,\" and \"trading volume.\"\n-   **Key Performance Indicators (KPIs):** Industry-specific metrics such as \"same-store sales,\" \"daily active users (DAU),\" \"customer acquisition cost (CAC),\" \"churn rate,\" or \"ARR\" (Annual Recurring Revenue).\n\n#### Information to Ignore (Noise):\n-   Product marketing materials and consumer-facing advertising copy.\n-   Internal employee communications, HR policies, and job postings.\n-   Routine press releases about local events, sponsorships, or employee awards.\n-   Technical product specifications or engineering white papers.\n-   Customer support documentation and user manuals.\n-   Social media content and consumer blog posts.\n-   Detailed information on company facilities, such as cafeteria menus or construction updates."
}