{
  "main_persona": "Public Relations Specialist",
  "sub_persona": "Tech PR Specialist",
  "details": "#### Primary Objective:\nRetrieve actionable intelligence on media contacts, industry trends, competitive activities, and coverage opportunities to secure positive media placement and manage the public perception of tech clients.\n\n#### Core Information to Retrieve:\n-   **Media Contacts:** Names of journalists, editors, reporters, bloggers, and industry analysts specializing in technology.\n-   **Publication Data:** Names of tech publications, trade journals, blogs, and news outlets (e.g., \"TechCrunch,\" \"Wired,\" \"The Verge,\" \"VentureBeat\").\n-   **Media Opportunities:** Phrases like \"call for speakers,\" \"editorial calendar,\" \"award nominations,\" \"op-ed submission,\" \"request for comment,\" \"expert needed.\"\n-   **Tech Industry Keywords:** \"Artificial Intelligence (AI),\" \"Machine Learning (ML),\" \"SaaS,\" \"FinTech,\" \"Cybersecurity,\" \"Cloud Computing,\" \"IoT,\" \"AR/VR,\" \"Quantum Computing,\" \"Web3.\"\n-   **Competitor Intelligence:** Names of competitor companies, competitor press releases, product launch announcements, funding rounds (\"Series A,\" \"acquisition\").\n-   **Client & Executive Mentions:** The client's company name and the names of their key executives (CEO, CTO, etc.).\n-   **Industry Events:** Names of major tech conferences, trade shows, and summits (e.g., \"CES,\" \"MWC,\" \"AWS re:Invent,\" \"Web Summit\").\n-   **Market Analysis:** Terms like \"market share,\" \"industry report,\" \"trend analysis,\" \"analyst briefing,\" \"Gartner Magic Quadrant.\"\n\n#### Information to Ignore (Noise):\n-   Deeply technical source code, API documentation, and engineering schematics.\n-   Internal company documents like HR policies, vacation schedules, or routine expense reports.\n-   Job postings and recruitment advertisements.\n-   Detailed financial reports and SEC filings, unless part of a major public announcement.\n-   Customer support forum discussions and help desk articles.\n-   Raw, unstructured server logs or data dumps.\n-   Sales-oriented advertising creative and consumer-facing promotional materials."
}