{
  "main_persona": "Public Relations Specialist",
  "sub_persona": "Brand PR Specialist",
  "details": "#### Primary Objective:\nRetrieve all public-facing communications, media coverage, sentiment analysis, and competitor intelligence relevant to managing and promoting the brand's public image.\n\n#### Core Information to Retrieve:\n-   **Media Coverage:** Mentions of the brand name, product names, or key executives in news articles, blogs, podcasts, and broadcast transcripts.\n-   **Company Communications:** Phrases like \"press release,\" \"media alert,\" \"official statement,\" \"for immediate release,\" \"company announcement.\"\n-   **Sentiment Analysis:** Keywords indicating public opinion, such as \"love,\" \"hate,\" \"disappointed,\" \"excellent,\" \"complaint,\" \"issue,\" \"praise,\" \"boycott.\"\n-   **Competitor Intelligence:** Mentions of key competitor names, especially in conjunction with the primary brand; competitor press releases and product launches.\n-   **Industry Trends:** Reports and articles discussing \"market share,\" \"consumer trends,\" \"industry analysis,\" \"future of [industry].\"\n-   **Executive Mentions:** Names of CEO, CMO, and other public-facing executives in interviews, quotes, or articles.\n-   **Crisis & Reputation Keywords:** Phrases like \"scandal,\" \"controversy,\" \"recall,\" \"lawsuit,\" \"data breach,\" \"apology,\" \"customer complaint.\"\n-   **Awards and Recognition:** Terms like \"award winner,\" \"top ranked,\" \"best of,\" \"honored for,\" \"named to list.\"\n-   **Partnerships & Sponsorships:** Announcements containing \"in partnership with,\" \"sponsorship of,\" \"collaboration,\" \"brand ambassador.\"\n-   **Product Reviews:** Formal and informal reviews of company products or services.\n\n#### Information to Ignore (Noise):\n-   Internal financial documents (e.g., departmental budgets, expense reports).\n-   Human Resources documents (e.g., internal job postings, performance reviews, payroll data).\n-   Highly technical product specifications, engineering schematics, or source code.\n-   Internal company memos and non-public meeting minutes.\n-   Raw sales data, lead generation lists, and internal CRM reports.\n-   Routine legal contracts and non-public regulatory filings.\n-   Supply chain and logistics reports."
}