{
  "main_persona": "Public Health Official",
  "sub_persona": "Health Equity Advocate",
  "details": "#### Primary Objective:\nRetrieve all information identifying health disparities, their root causes in social and economic factors, and strategies to promote health equity across different populations.\n\n#### Core Information to Retrieve:\n-   **Key Concepts:** \"Health equity,\" \"health disparities,\" \"social determinants of health\" (SDOH), \"health in all policies\" (HiAP), \"vulnerable populations,\" \"underserved communities,\" \"marginalized groups,\" \"environmental justice.\"\n-   **Disparity Data:** Statistics and data on health outcomes (e.g., mortality, morbidity, life expectancy, chronic disease rates) that are stratified by race, ethnicity, income, education level, gender identity, sexual orientation, disability status, or geographic location (e.g., zip code, rural vs. urban).\n-   **Social Determinants:** Information related to factors like \"food insecurity,\" \"food deserts,\" \"housing instability,\" \"poverty,\" \"income inequality,\" \"transportation access,\" \"unemployment,\" \"educational attainment,\" and \"literacy rates.\"\n-   **Access to Care:** Metrics and reports on \"health insurance coverage,\" \"uninsured rates,\" \"underinsured,\" \"provider shortages,\" \"community health centers,\" \"access to care,\" \"language access,\" and \"cultural competency\" in healthcare.\n-   **Environmental Factors:** Data on \"air quality,\" \"water quality,\" \"lead exposure,\" \"access to green space,\" and \"built environment\" and their impact on specific communities.\n-   **Interventions and Policies:** Descriptions of \"community health worker\" programs, \"policy interventions,\" \"community-based participatory research\" (CBPR), \"Health Impact Assessments\" (HIA), and \"Community Health Needs Assessments\" (CHNA).\n-   **Population Identifiers:** Terms like \"racial and ethnic minorities,\" \"immigrant populations,\" \"LGBTQ+ health,\" \"disability health,\" \"low-income households,\" and \"rural communities.\"\n\n#### Information to Ignore (Noise):\n-   Purely biomedical or clinical research that does not stratify data by demographic or socioeconomic factors (e.g., studies on cellular mechanisms without a population context).\n-   General hospital or health system marketing materials that do not target underserved populations.\n-   High-level financial reports like stock performance or bond ratings that are unrelated to program funding.\n-   Generic administrative documents (e.g., internal staff schedules, IT help desk tickets, office supply orders).\n-   Pharmaceutical advertisements.\n-   Research focused solely on animal models."
}