{
  "main_persona": "Public Health Official",
  "sub_persona": "Global Health Specialist",
  "details": "#### Primary Objective:\nRetrieve data, reports, and policies concerning international disease surveillance, global health security, cross-border health interventions, and the operations of international health organizations.\n\n#### Core Information to Retrieve:\n-   **Disease Outbreak & Surveillance Data:** Phrases like \"epidemic,\" \"pandemic,\" \"outbreak,\" \"case report,\" \"morbidity and mortality weekly report (MMWR),\" \"incidence,\" \"prevalence,\" \"surveillance data.\"\n-   **Specific Diseases:** \"Influenza,\" \"COVID-19,\" \"Ebola,\" \"Malaria,\" \"Tuberculosis (TB),\" \"HIV/AIDS,\" \"Zika,\" \"Cholera,\" \"Dengue,\" \"Polio,\" and other communicable diseases of international concern.\n-   **International Organizations:** Reports, guidelines, and press releases from the \"World Health Organization (WHO),\" \"CDC Global,\" \"UNICEF,\" \"UNAIDS,\" \"GAVI,\" \"The Global Fund,\" \"Doctors Without Borders (MSF),\" \"World Bank.\"\n-   **Global Health Policy & Regulations:** \"International Health Regulations (IHR),\" \"Global Health Security Agenda (GHSA),\" \"pandemic preparedness,\" \"health policy,\" \"Memorandum of Understanding (MOU),\" \"treaty.\"\n-   **Interventions & Logistics:** \"Vaccination campaigns,\" \"immunization coverage,\" \"supply chain,\" \"medical logistics,\" \"emergency response,\" \"humanitarian aid,\" \"personal protective equipment (PPE),\" \"diagnostics.\"\n-   **Health System Metrics:** \"Health system strengthening,\" \"healthcare capacity,\" \"infant mortality rate,\" \"maternal mortality,\" \"health equity,\" \"health disparities,\" \"social determinants of health.\"\n-   **Key Risk Factors:** \"Antimicrobial resistance (AMR),\" \"zoonotic spillover,\" \"water, sanitation, and hygiene (WASH),\" \"malnutrition,\" \"food security.\"\n-   **Geographic Terms:** Names of countries, regions (e.g., \"Sub-Saharan Africa,\" \"Southeast Asia\"), and continents in the context of health data.\n\n#### Information to Ignore (Noise):\n-   Hyper-local public health notices (e.g., a single school's flu notice, a specific restaurant closure).\n-   Individual, anonymized patient data or clinical records.\n-   Marketing materials for consumer health products or pharmaceuticals.\n-   General global economic reports not tied to health funding or impact.\n-   Internal administrative documents of health organizations (e.g., HR policies, routine office memos).\n-   Domestic policy debates in a single country unless they have clear international implications.\n-   Highly technical lab research on cellular mechanisms unless linked to a current outbreak or treatment protocol."
}