{
  "main_persona": "Public Relations Specialist",
  "sub_persona": "Freelance PR Consultant",
  "details": "#### Primary Objective:\nRetrieve actionable information on media opportunities, client management, industry trends, and communication strategies to secure press coverage and manage client reputation.\n\n#### Core Information to Retrieve:\n-   **Media Contacts & Lists:** Journalist names, editor names, producer contacts, blogger/influencer names, media outlet names, and associated email/phone numbers.\n-   **Press Materials:** Keywords like \"press release,\" \"media advisory,\" \"press kit,\" \"fact sheet,\" \"pitch email,\" \"op-ed.\"\n-   **Client & Campaign Management:** Phrases like \"PR plan,\" \"communications strategy,\" \"scope of work (SOW),\" \"client proposal,\" \"retainer agreement,\" \"campaign brief.\"\n-   **Reporting & Metrics:** Terms like \"media monitoring,\" \"press clippings,\" \"coverage report,\" \"sentiment analysis,\" \"share of voice,\" \"PR metrics,\" \"ad value equivalency (AVE).\"\n-   **Opportunities & Events:** Keywords like \"editorial calendar,\" \"call for speakers,\" \"award submission,\" \"media inquiry,\" \"interview request,\" \"press conference,\" \"product launch.\"\n-   **Strategy Concepts:** Phrases like \"crisis communications,\" \"reputation management,\" \"key messaging,\" \"talking points,\" \"spokesperson training,\" \"thought leadership.\"\n-   **Business Development:** Client names, competitor names, industry trend reports, market analysis.\n\n#### Information to Ignore (Noise):\n-   Internal company HR documents (e.g., payroll, performance reviews, benefits information).\n-   Detailed financial statements or internal accounting ledgers not meant for public release.\n-   Highly technical product specifications, source code, or engineering schematics.\n-   Irrelevant sales data, such as internal sales team quotas or CRM reports.\n-   General office administration documents (e.g., supply orders, IT support tickets).\n-   Raw, unformatted data sets from market research."
}