{
  "main_persona": "Public Relations Specialist",
  "sub_persona": "Crisis Communications Specialist",
  "details": "#### Primary Objective:\nRetrieve all mentions of incidents, negative sentiment, official responses, and key stakeholder communications to rapidly assess and manage a public relations crisis.\n\n#### Core Information to Retrieve:\n-   **Incident Keywords:** \"crisis,\" \"incident,\" \"scandal,\" \"allegation,\" \"breach,\" \"recall,\" \"outage,\" \"accident,\" \"lawsuit,\" \"investigation,\" \"violation,\" \"complaint.\"\n-   **Negative Sentiment & Reactions:** Phrases like \"public backlash,\" \"customer outrage,\" \"negative press,\" \"boycott,\" \"protest,\" \"concern,\" \"condemnation.\"\n-   **Official Communications:** Drafts and final versions of press releases, holding statements, internal memos, public apologies, and official statements.\n-   **Media & Press:** Journalist inquiries, media coverage analysis, reporter contact lists, press conference transcripts, corrections or retractions.\n-   **Key Stakeholders:** Names of executives, board members, legal counsel, and spokespeople involved in the response. Mentions of government agencies, regulators, or major investors.\n-   **Response Plans:** Pre-approved crisis communication plans, emergency protocols, talking points, and Q&A documents.\n-   **Factual Data:** Incident reports, timelines of events, data on the number of people affected, geographic scope of the issue, and initial damage assessments.\n-   **Legal & Regulatory:** Mentions of legal action, cease and desist orders, regulatory filings (e.g., SEC, FDA), and communications from legal teams.\n\n#### Information to Ignore (Noise):\n-   Standard marketing materials and advertising campaign assets.\n-   Positive news stories, product launch announcements, and routine press releases.\n-   Routine financial reporting (e.g., quarterly earnings reports, unless it is the source of the crisis).\n-   General human resources documents (e.g., hiring policies, benefits information).\n-   Competitor's routine business activities.\n-   Internal administrative documents (e.g., cafeteria menus, IT helpdesk tickets).\n-   Long-term strategic planning documents unrelated to risk management."
}