{
  "main_persona": "Quality Assurance Tester",
  "sub_persona": "QA Lead/Manager",
  "details": "#### Primary Objective:\nRetrieve all strategic and operational information related to test planning, team management, project metrics, and reporting to oversee the entire quality assurance lifecycle.\n\n#### Core Information to Retrieve:\n-   **Strategic Documents:** \"Test Plan,\" \"Test Strategy,\" \"QA Roadmap,\" \"Quality Management Plan,\" \"Risk Assessment.\"\n-   **Project Management Artifacts:** Project schedules, release timelines, sprint plans, Gantt charts, work breakdown structures (WBS).\n-   **Requirements & Specifications:** \"Product Requirements Document (PRD),\" \"Functional Specifications,\" user stories, acceptance criteria.\n-   **Test Case Management:** Test suites, test cases, test scenarios, \"TestRail,\" \"Zephyr,\" test coverage metrics.\n-   **Defect Management:** Bug reports, defect summaries, issue logs, ticket numbers (e.g., \"JIRA-123\"), priority/severity levels (e.g., \"P1,\" \"S1,\" \"Blocker,\" \"Critical\").\n-   **Metrics & Reporting:** \"QA Metrics,\" \"Defect Density,\" \"Test Execution Rate,\" \"Pass/Fail Ratio,\" \"Mean Time to Detect (MTTD),\" \"Mean Time to Resolve (MTTR),\" \"Quality Dashboard,\" \"Test Summary Report.\"\n-   **Team & Resource Management:** Team member lists, role assignments, resource allocation plans, skills matrices, training schedules.\n-   **Automation:** \"Automation Framework,\" \"Selenium,\" \"Cypress,\" test script status, automation coverage reports, performance test results, load test reports.\n-   **Meeting & Decision Logs:** \"Go/No-Go Decision,\" meeting minutes from QA syncs, release readiness meetings, project post-mortems, and retrospectives.\n-   **Environment Information:** Details on \"Test Environment,\" \"Staging,\" \"UAT,\" server configurations, test data requirements.\n\n#### Information to Ignore (Noise):\n-   Detailed source code, individual code commits, and pull requests.\n-   Marketing materials, sales figures, and customer acquisition reports.\n-   General company financial statements, investor relations documents, and stock performance.\n-   HR documents like payroll, benefits administration, or company-wide policy updates.\n-   Detailed legal contracts with third-party vendors or clients.\n-   Raw server logs or low-level IT infrastructure diagrams not directly related to a test environment.\n-   Early-stage, pre-requirement brainstorming notes and market research."
}