{
  "main_persona": "Quality Assurance Tester",
  "sub_persona": "Database QA Tester",
  "details": "#### Primary Objective:\nRetrieve all technical documentation related to database schemas, data validation rules, query performance, and testing protocols to ensure data integrity and system stability.\n\n#### Core Information to Retrieve:\n-   **Database Schemas:** Entity-Relationship Diagrams (ERDs), table definitions, column names, data types (e.g., `VARCHAR`, `INT`, `DATETIME`), primary keys, foreign keys.\n-   **Data Integrity & Constraints:** Phrases like \"business rules,\" \"validation logic,\" \"constraints\" (`NOT NULL`, `UNIQUE`, `CHECK`), and descriptions of triggers or stored procedures.\n-   **SQL & Queries:** Example SQL statements (`SELECT`, `INSERT`, `UPDATE`, `DELETE`), stored procedure code, function definitions, and expected query outputs.\n-   **Performance Metrics:** Keywords like \"query performance,\" \"load testing,\" \"benchmarks,\" \"indexing strategy,\" \"query optimization,\" \"execution plan,\" and specific non-functional requirements (e.g., \"response time under 500ms\").\n-   **Test Documentation:** Test plans, test cases, test scripts (especially SQL scripts), expected results, and acceptance criteria related to data.\n-   **Data Migration & ETL:** Documentation on \"ETL processes\" (Extract, Transform, Load), data mapping specifications, data transformation rules, and migration scripts.\n-   **Security & Access:** Information on \"user roles,\" \"permissions,\" \"database access control,\" \"data encryption,\" and potential vulnerabilities like \"SQL injection.\"\n-   **Backup & Recovery:** Procedures for \"database backup,\" \"data recovery,\" and \"disaster recovery\" plans.\n\n#### Information to Ignore (Noise):\n-   UI/UX mockups, wireframes, and front-end design specifications (CSS, HTML).\n-   Client-side code (JavaScript, React, Angular).\n-   High-level marketing material, sales projections, and business strategy documents.\n-   General project management documents like meeting minutes (unless they contain technical database decisions), team rosters, or budget reports.\n-   User guides, end-user training manuals, and marketing copy.\n-   Corporate policy documents, HR forms, and non-technical administrative information.\n-   Web server configurations (Apache, Nginx) or network infrastructure details not directly related to database connectivity."
}