{
  "main_persona": "Quality Assurance Tester",
  "sub_persona": "System Integration Tester",
  "details": "#### Primary Objective:\nRetrieve all technical documentation detailing system interfaces, data exchange protocols, and end-to-end workflows to validate the correct interaction between different software components and systems.\n\n#### Core Information to Retrieve:\n-   **API Documentation:** Phrases like \"API endpoint,\" \"REST,\" \"SOAP,\" \"GraphQL,\" \"request/response,\" \"payload format,\" \"status codes\" (e.g., 200, 404, 501), \"API key,\" \"authentication,\" \"OAuth,\" \"rate limiting.\"\n-   **Data Schemas and Formats:** Keywords like \"JSON schema,\" \"XML schema (XSD),\" \"data dictionary,\" \"data mapping,\" \"field definitions,\" \"data transformation,\" \"CSV format.\"\n-   **System Architecture Diagrams:** Sequence diagrams, workflow diagrams, component diagrams, network topology, and any document illustrating \"service dependency\" or \"system interaction.\"\n-   **Communication Protocols:** Details on \"message queue\" (MQ), \"Kafka,\" \"RabbitMQ,\" \"FTP/SFTP,\" \"TCP/IP,\" \"port numbers,\" and \"communication protocol.\"\n-   **Test Plans and Cases:** Documents titled \"Integration Test Plan,\" \"System Test Strategy,\" \"End-to-End Test Cases,\" and sections detailing \"acceptance criteria\" for cross-system user stories.\n-   **Configuration Details:** Information on \"environment configuration,\" \"database connection strings,\" \"server addresses,\" \"credentials,\" \"feature flags,\" and \"environment variables\" for test environments.\n-   **Error Handling and Logging:** Specifications for \"error codes,\" \"exception handling,\" \"timeout,\" \"retry logic,\" and \"logging formats\" or \"log locations.\"\n-   **Interface Control Documents (ICD):** Formal documents defining the interface between two or more systems or subsystems.\n\n#### Information to Ignore (Noise):\n-   **Unit Test Plans:** Documentation focused on testing individual functions or components in isolation.\n-   **UI/UX Design Specifications:** Mockups, wireframes, style guides, CSS details, or discussions about visual design elements like color, font, or layout.\n-   **Source Code Implementation:** Raw source code files (.java, .py, .cs) or detailed algorithmic discussions within a single component.\n-   **High-Level Business & Marketing Documents:** Project charters, budget reports, marketing plans, sales forecasts, and press releases.\n-   **Corporate & HR Policies:** Employee handbooks, org charts, and general company policies unrelated to the software development lifecycle.\n-   **End-User Manuals:** User guides focused on GUI interaction from a non-technical user's perspective."
}