{
  "main_persona": "Quality Assurance Tester",
  "sub_persona": "API Tester",
  "details": "#### Primary Objective:\nRetrieve all technical specifications, documentation, and error data related to API endpoints to facilitate comprehensive testing and validation.\n\n#### Core Information to Retrieve:\n-   **API Endpoints:** URL paths, URI structures, specific HTTP methods (GET, POST, PUT, DELETE, PATCH).\n-   **Request/Response Structures:** \"request body,\" \"response body,\" \"JSON schema,\" \"XML schema,\" \"headers,\" \"parameters\" (query, path, header).\n-   **Data Formats & Types:** \"JSON,\" \"XML,\" \"data type,\" \"string,\" \"integer,\" \"boolean,\" \"array,\" \"object,\" \"timestamp.\"\n-   **Authentication & Authorization:** \"API Key,\" \"OAuth,\" \"JWT,\" \"bearer token,\" \"authentication,\" \"permissions,\" \"user roles.\"\n-   **Status & Error Codes:** HTTP status codes (e.g., \"200 OK,\" \"201 Created,\" \"400 Bad Request,\" \"401 Unauthorized,\" \"404 Not Found,\" \"500 Internal Server Error\"), \"error message,\" \"error code,\" \"exception handling.\"\n-   **Technical Specifications:** \"Swagger specification,\" \"OpenAPI,\" \"API documentation,\" \"versioning\" (e.g., v1, v2), \"service level agreement (SLA).\"\n-   **Performance & Constraints:** \"rate limiting,\" \"response time,\" \"latency,\" \"payload size,\" \"load testing,\" \"stress testing,\" \"concurrency.\"\n-   **Testing & Validation:** \"Postman collection,\" \"cURL command,\" \"test case,\" \"acceptance criteria,\" \"edge case,\" \"negative test,\" \"validation rules.\"\n-   **Database & Logic:** \"database query\" (in logs or specs), \"business logic,\" \"required field,\" \"optional field,\" \"data validation.\"\n\n#### Information to Ignore (Noise):\n-   **User Interface (UI) Elements:** UI mockups, wireframes, CSS stylesheets, HTML layouts, font choices, color palettes, front-end components.\n-   **Marketing & Sales Content:** Press releases, marketing campaigns, user demographics, sales figures, customer personas.\n-   **Corporate & Financial Documents:** Annual reports, budget spreadsheets, org charts, investor relations material.\n-   **General Project Management:** Meeting minutes (unless specifically about API design), project timelines, team-building activities, resource allocation charts.\n-   **End-User Documentation:** User manuals, help guides, FAQs that describe the UI, marketing website copy.\n-   **Low-Level Hardware Specs:** Server hardware models, network switch configurations, physical data center plans."
}