{
  "main_persona": "Quality Assurance Tester",
  "sub_persona": "Automation QA Engineer",
  "details": "#### Primary Objective:\nRetrieve technical specifications, API documentation, code examples, and framework details required to design, build, and maintain automated test suites.\n\n#### Core Information to Retrieve:\n-   **Testing Frameworks & Tools:** Keywords like \"Selenium,\" \"Cypress,\" \"Playwright,\" \"Appium,\" \"TestNG,\" \"JUnit,\" \"Pytest,\" \"REST-assured,\" \"Postman,\" \"JMeter.\"\n-   **Technical Specifications:** Phrases like \"functional requirements,\" \"technical design document,\" \"acceptance criteria,\" \"user stories.\"\n-   **API Documentation:** Terms like \"API endpoint,\" \"REST,\" \"GraphQL,\" \"Swagger,\" \"OpenAPI,\" \"JSON schema,\" \"request payload,\" \"response code.\"\n-   **Code & Scripting Elements:** Code snippets in Java, Python, JavaScript, TypeScript; SQL queries; configuration files (.yml, .xml, .properties).\n-   **Locators & Selectors:** Specific terms like \"XPath,\" \"CSS Selector,\" \"element ID,\" \"DOM element.\"\n-   **CI/CD Integration:** Phrases like \"Jenkins pipeline,\" \"GitLab CI,\" \"build script,\" \"deployment environment,\" \"test environment configuration.\"\n-   **Bug & Defect Reports:** Keywords like \"stack trace,\" \"error log,\" \"bug reproduction steps,\" \"expected result,\" \"actual result.\"\n-   **Performance Metrics:** Terms like \"response time,\" \"latency,\" \"load test,\" \"stress test,\" \"transactions per second (TPS).\"\n\n#### Information to Ignore (Noise):\n-   Marketing materials, user testimonials, and sales presentations.\n-   High-level business strategy documents, financial projections, and market analysis.\n-   UI/UX design mockups, mood boards, color palettes, and user journey maps.\n-   Detailed project management plans, budget spreadsheets, and team meeting minutes (unless they contain specific technical decisions).\n-   Company HR policies, legal disclaimers, and end-user license agreements.\n-   Manual test case scripts written with step-by-step instructions for a human user."
}