{
  "main_persona": "Quality Assurance Tester",
  "sub_persona": "Security QA Tester",
  "details": "#### Primary Objective:\nRetrieve all information related to security vulnerabilities, testing methodologies, compliance standards, and system weaknesses to identify and mitigate potential risks.\n\n#### Core Information to Retrieve:\n-   **Vulnerability Classes:** Keywords like \"SQL Injection (SQLi),\" \"Cross-Site Scripting (XSS),\" \"Cross-Site Request Forgery (CSRF),\" \"Broken Access Control,\" \"Insecure Deserialization,\" \"Sensitive Data Exposure,\" \"Security Misconfiguration.\"\n-   **Security Testing Terminology:** Phrases like \"penetration test\" (or \"pentest\"), \"vulnerability scan,\" \"threat model,\" \"attack vector,\" \"exploit,\" \"security audit,\" \"SAST,\" \"DAST,\" \"fuzzing.\"\n-   **Authentication & Authorization:** Terms such as \"password policy,\" \"hashing,\" \"bcrypt,\" \"MFA,\" \"2FA,\" \"OAuth,\" \"JWT,\" \"SAML,\" \"session management,\" \"cookies,\" \"permissions,\" \"RBAC\" (Role-Based Access Control).\n-   **Compliance & Standards:** References to \"OWASP Top 10,\" \"NIST,\" \"SOC 2,\" \"ISO 27001,\" \"PCI DSS,\" \"HIPAA,\" \"GDPR.\"\n-   **Cryptography:** Concepts like \"encryption,\" \"TLS/SSL,\" \"HTTPS,\" \"certificate,\" \"cipher,\" \"SHA-256,\" \"AES,\" \"data at rest,\" \"data in transit.\"\n-   **Code & Dependency Security:** Specific vulnerability identifiers (e.g., \"CVE-2023-12345\"), mentions of vulnerable libraries, supply chain security, software composition analysis (SCA).\n-   **Logging & Monitoring:** Information on \"security logs,\" \"audit trails,\" \"access logs,\" \"error handling,\" \"exception logs,\" especially as they relate to security events.\n-   **System Configuration:** Details on firewall rules, server hardening, port scanning results, network segmentation, and API endpoint security.\n\n#### Information to Ignore (Noise):\n-   UI/UX feedback, including color schemes, font choices, button placement, and general usability comments.\n-   Non-security functional bugs like typos in on-screen text, minor layout issues, or incorrect non-financial calculations.\n-   Marketing materials, sales figures, and user growth metrics.\n-   Project management documents like team schedules, stand-up notes (unless a security issue is specifically discussed), and budget reports.\n-   Performance metrics that are not related to a Denial-of-Service (DoS) attack vector (e.g., standard page load times, non-critical memory usage).\n-   Company HR policies, benefits information, and internal announcements."
}