{
  "main_persona": "Quality Assurance Tester",
  "sub_persona": "Game QA Tester",
  "details": "#### Primary Objective:\nRetrieve all information related to bugs, defects, technical issues, design inconsistencies, and player experience problems within game development documentation.\n\n#### Core Information to Retrieve:\n-   **Bug-Related Terminology:** \"bug,\" \"defect,\" \"glitch,\" \"crash,\" \"freeze,\" \"hang,\" \"exploit,\" \"blocker,\" \"known issue,\" \"regression.\"\n-   **Test Case Details:** \"test plan,\" \"test case,\" \"steps to reproduce,\" \"expected result,\" \"actual result,\" \"build version.\"\n-   **Technical Performance Data:** \"FPS\" (frames per second), \"framerate drops,\" \"memory leak,\" \"load times,\" \"latency,\" \"network packet loss,\" \"performance metrics.\"\n-   **Gameplay & Logic Issues:** \"collision,\" \"hitbox,\" \"AI pathfinding,\" \"quest trigger,\" \"script error,\" \"physics bug,\" \"save/load error.\"\n-   **Art & Animation Defects:** \"texture clipping,\" \"z-fighting,\" \"missing texture,\" \"placeholder asset,\" \"animation bug,\" \"lighting issue,\" \"visual artifact.\"\n-   **Audio Problems:** \"audio desync,\" \"missing sound effect,\" \"corrupted audio,\" \"dialogue overlap,\" \"music bug.\"\n-   **UI/UX Flaws:** \"unresponsive UI,\" \"menu navigation issue,\" \"text overflow,\" \"typo,\" \"localization error,\" \"incorrect tooltip.\"\n-   **Platform Compliance:** \"TRC\" (Sony Technical Requirement Checklist), \"XR\" (Xbox Requirements), \"Lotcheck\" (Nintendo), \"certification failure.\"\n\n#### Information to Ignore (Noise):\n-   Marketing plans, press releases, and promotional material.\n-   High-level financial data, sales projections, and monetization strategies.\n-   Company HR documents, organizational charts, and internal memos unrelated to development.\n-   Raw source code files (e.g., C++, C#).\n-   High-level concept art and narrative backstories not tied to specific in-game implementation.\n-   Legal documents such as contracts and non-disclosure agreements.\n-   Server maintenance logs and IT infrastructure details not directly causing a game bug."
}