{
  "main_persona": "Quality Assurance Tester",
  "sub_persona": "Mobile QA Tester",
  "details": "#### Primary Objective:\nRetrieve all technical specifications, test cases, bug reports, and platform guidelines necessary to perform comprehensive quality assurance testing on mobile applications.\n\n#### Core Information to Retrieve:\n-   **Testing Artifacts:** Phrases like \"test case,\" \"test plan,\" \"test scenario,\" \"acceptance criteria,\" \"user story,\" \"test data.\"\n-   **Bug & Defect Reporting:** Keywords such as \"bug,\" \"defect,\" \"issue,\" \"crash,\" \"stack trace,\" \"logcat,\" \"error code,\" \"reproduction steps,\" \"severity,\" \"priority.\"\n-   **Platform & Device Specifications:** \"iOS,\" \"Android,\" \"iPhone,\" \"iPad,\" \"Samsung Galaxy,\" specific OS versions (e.g., \"iOS 17,\" \"Android 14\"), \"screen resolution,\" \"memory,\" \"CPU.\"\n-   **Mobile-Specific Testing:** Terms related to \"battery consumption,\" \"network conditions\" (e.g., \"3G,\" \"4G,\" \"5G,\" \"Wi-Fi,\" \"offline mode\"), \"performance testing,\" \"usability testing,\" \"UI/UX testing.\"\n-   **Application Requirements:** \"Functional requirements,\" \"non-functional requirements,\" \"UI specifications,\" \"wireframes,\" \"mockups,\" \"design documents.\"\n-   **System Interactions:** Keywords like \"push notification,\" \"location services,\" \"GPS,\" \"camera access,\" \"microphone permission,\" \"contacts,\" \"Bluetooth,\" \"NFC.\"\n-   **Tools and Environments:** Names of testing tools and platforms like \"Xcode,\" \"Android Studio,\" \"TestFlight,\" \"Google Play Console,\" \"Appium,\" \"Jira,\" \"Charles Proxy,\" \"Postman.\"\n-   **Compliance and Guidelines:** \"Apple App Store Review Guidelines,\" \"Human Interface Guidelines (HIG),\" \"Google Play Store Policies,\" \"accessibility,\" \"WCAG,\" \"VoiceOver,\" \"TalkBack.\"\n\n#### Information to Ignore (Noise):\n-   Marketing plans, sales forecasts, and advertising campaign materials.\n-   High-level financial data, budget allocations, and revenue projections.\n-   Server-side backend architecture details (e.g., database schemas, server provisioning, microservice implementation), unless it's an API endpoint definition.\n-   Human Resources documents, such as team rosters, employee reviews, or payroll information.\n-   Company-wide memos or announcements unrelated to product development.\n-   Detailed source code files and implementation logic (the tester is focused on behavior, not code structure).\n-   Legal contracts with third-party vendors or clients."
}