{
  "main_persona": "Quality Assurance Tester",
  "sub_persona": "Usability Tester",
  "details": "#### Primary Objective:\nRetrieve all information concerning user interface design, user interaction flows, accessibility standards, and user feedback to evaluate the product's overall ease of use.\n\n#### Core Information to Retrieve:\n-   **User Interface (UI) Elements:** Mockups, wireframes, prototypes, style guides, design systems, visual specifications.\n-   **User Experience (UX) Concepts:** User flows, user journey maps, click paths, navigation schemas, information architecture.\n-   **Keywords & Phrases:** \"Usability,\" \"user-friendly,\" \"intuitive,\" \"user feedback,\" \"user testing,\" \"heuristic evaluation,\" \"A/B test,\" \"user story,\" \"acceptance criteria.\"\n-   **Accessibility Standards:** \"WCAG\" (Web Content Accessibility Guidelines), \"Section 508,\" \"a11y,\" \"screen reader compatibility,\" \"keyboard navigation,\" \"color contrast,\" \"alt text.\"\n-   **User-Facing Content:** Error messages, success messages, tooltips, help text, onboarding guides, microcopy.\n-   **Performance Metrics:** \"Load time,\" \"response time,\" \"latency,\" \"responsive design,\" \"mobile-first.\"\n-   **Feedback & Reports:** Existing bug reports (especially UI/UX bugs), customer support tickets, user survey results, previous usability test findings, analytics reports (e.g., heat maps, session recordings).\n-   **Functional Requirements:** Product requirements documents (PRDs), functional specifications that describe expected user interactions.\n\n#### Information to Ignore (Noise):\n-   Raw source code (e.g., Python, Java, C++).\n-   Backend architecture diagrams, database schemas, and API endpoint definitions.\n-   Server logs, deployment scripts, and CI/CD pipeline configurations.\n-   Unit test and integration test code.\n-   Corporate financial reports, sales forecasts, and marketing strategies.\n-   Internal HR documents, team rosters, and budget allocation spreadsheets.\n-   Detailed legal contracts or patent filings."
}