{
  "main_persona": "Real Estate Developer",
  "sub_persona": "Urban Infill Developer",
  "details": "#### Primary Objective:\nRetrieve all data pertinent to identifying viable land parcels, understanding zoning regulations, assessing financial feasibility, and managing the development process for urban infill projects.\n\n#### Core Information to Retrieve:\n-   **Land Identification & Acquisition:** Phrases like \"vacant lot,\" \"underutilized property,\" \"blighted property,\" \"brownfield,\" \"greyfield,\" \"redevelopment opportunity,\" \"land assembly,\" \"for sale by owner.\"\n-   **Property Data:** Parcel numbers (APN), property addresses, legal descriptions, lot dimensions, title reports, ownership records.\n-   **Zoning & Land Use Regulations:** Keywords such as \"zoning code,\" \"general plan,\" \"land use map,\" \"mixed-use zoning,\" \"transit-oriented development (TOD),\" \"overlay district.\"\n-   **Entitlement & Permitting:** Specific terms like \"floor area ratio (FAR),\" \"density bonus,\" \"height limit,\" \"setback requirements,\" \"parking minimums,\" \"conditional use permit (CUP),\" \"variance,\" \"entitlement process,\" \"planning commission agenda.\"\n-   **Financial & Market Analysis:** Terms like \"pro forma,\" \"development budget,\" \"construction costs,\" \"soft costs,\" \"land value,\" \"comparable sales (comps),\" \"market analysis,\" \"absorption rate,\" \"capitalization rate (cap rate).\"\n-   **Funding & Incentives:** Phrases such as \"Opportunity Zone,\" \"TIF (Tax Increment Financing),\" \"public-private partnership (P3),\" \"Low-Income Housing Tax Credit (LIHTC),\" \"historic tax credit,\" \"construction loan.\"\n-   **Site Assessment:** Reports and data labeled \"Phase I ESA\" (Environmental Site Assessment), \"geotechnical report,\" \"soil report,\" \"remediation plan,\" \"utility capacity study,\" \"traffic impact analysis.\"\n-   **Community & Stakeholder Documents:** Agendas and minutes from \"neighborhood council meetings,\" \"design review boards,\" \"public hearings,\" and documents mentioning \"community benefits agreement.\"\n\n#### Information to Ignore (Noise):\n-   Information on suburban or exurban \"greenfield\" development.\n-   Single-family home renovation projects or interior design specifications.\n-   Routine municipal operations documents (e.g., park maintenance schedules, public works announcements not related to new infrastructure).\n-   Established Homeowner Association (HOA) bylaws or meeting minutes for projects not under consideration.\n-   Broad, non-local economic reports (e.g., national GDP, global market trends).\n-   Marketing materials for individual real estate agents.\n-   Tenant-level documents like individual lease agreements or maintenance requests in existing buildings."
}