{
  "main_persona": "Real Estate Developer",
  "sub_persona": "Commercial Developer",
  "details": "#### Primary Objective:\nRetrieve all data related to the identification, financial analysis, acquisition, entitlement, construction, and leasing of commercial real estate development opportunities.\n\n#### Core Information to Retrieve:\n-   **Site & Property Data:** Parcel numbers (APN), legal descriptions, acreage, site plans, surveys, title reports, and property listings labeled \"commercial,\" \"industrial,\" \"mixed-use,\" or \"land.\"\n-   **Zoning & Entitlement:** Keywords like \"zoning code,\" \"permitted use,\" \"conditional use permit (CUP),\" \"variance,\" \"entitlement process,\" \"general plan,\" \"Floor Area Ratio (FAR),\" \"setbacks,\" and \"parking requirements.\"\n-   **Market Analysis:** Market reports, feasibility studies, demographic data, traffic counts, competitor analysis, and terms like \"vacancy rate,\" \"absorption rate,\" \"market rent,\" and \"sales comps.\"\n-   **Financial Analysis & Deal Structure:** Pro forma statements, development budgets, cost estimates, \"Net Operating Income (NOI),\" \"Capitalization Rate (Cap Rate),\" \"Internal Rate of Return (IRR),\" \"cash-on-cash return,\" \"joint venture agreements,\" and \"equity partnership.\"\n-   **Financing Documents:** Loan proposals, term sheets, financing commitments, and phrases like \"construction loan,\" \"permanent financing,\" \"mezzanine debt,\" and \"lender requirements.\"\n-   **Leasing Information:** \"Lease agreements,\" \"Letter of Intent (LOI),\" \"rent roll,\" \"tenant improvement allowance (TI),\" \"Common Area Maintenance (CAM),\" and information on \"anchor tenants.\"\n-   **Construction & Design:** \"General contractor\" bids, \"Request for Proposal (RFP),\" architectural drawings, construction schedules, building permits, and cost-to-complete reports.\n-   **Environmental & Geotechnical:** \"Phase I Environmental Site Assessment (ESA),\" soil reports, geotechnical studies, and reports on wetlands or contamination.\n\n#### Information to Ignore (Noise):\n-   Residential real estate listings (e.g., single-family homes, condos, duplexes).\n-   Homeowner Association (HOA) documents and bylaws.\n-   Individual residential lease agreements or rental applications.\n-   Marketing materials for non-real estate products or services.\n-   Internal company administrative documents (e.g., HR policies, IT memos).\n-   Highly detailed technical specifications for individual building components (e.g., HVAC unit manuals, raw material safety data sheets).\n-   Personal correspondence unrelated to a specific deal or project."
}