{
  "main_persona": "Real Estate Developer",
  "sub_persona": "Mixed-Use Developer",
  "details": "#### Primary Objective:\nRetrieve all data related to land acquisition, zoning regulations, market analysis, financial viability, and construction logistics for planning and executing mixed-use real estate projects.\n\n#### Core Information to Retrieve:\n-   **Zoning and Entitlements:** Keywords like \"mixed-use zoning,\" \"PUD\" (Planned Unit Development), \"land use code,\" \"variance,\" \"special exception,\" \"entitlements,\" \"Floor Area Ratio (FAR),\" \"density,\" \"setbacks,\" \"parking requirements.\"\n-   **Financial Data:** Pro forma statements, development budgets, construction cost estimates, cost per square foot, sources and uses of funds, capital stack breakdowns (debt, equity).\n-   **Market Analysis:** Demographic reports, traffic counts, absorption rates, vacancy rates, comparable lease rates (comps) for retail/office, comparable sales for condos/apartments.\n-   **Site & Property Information:** Site plans, property surveys, Phase I Environmental Site Assessments (ESA), geotechnical reports, parcel maps, title reports.\n-   **Legal and Contracts:** Purchase and Sale Agreements (PSAs), Letters of Intent (LOIs), development agreements, lease agreements (especially commercial anchor tenants), partnership agreements.\n-   **Government & Municipal Documents:** Planning commission agendas, city council meeting minutes, comprehensive plans, economic development reports.\n-   **Tenant & Retailer Information:** Lists of potential anchor tenants, national retailer expansion plans, commercial tenant credit reports.\n-   **Construction & Design:** Architectural drawings, contractor bids, construction timelines, value engineering reports, RFPs/RFQs for architects and general contractors.\n\n#### Information to Ignore (Noise):\n-   Detailed interior design specifications for individual residential units (e.g., paint colors, appliance models).\n-   Marketing materials aimed at end-user residential tenants or shoppers (e.g., apartment leasing flyers).\n-   Information on projects that are exclusively single-use (e.g., a standalone industrial warehouse or a tract of single-family homes).\n-   General stock market analysis unrelated to real estate investment trusts (REITs) or construction companies.\n-   Employee handbooks or internal corporate policies of unrelated businesses.\n-   Routine maintenance reports or work orders for existing, stabilized properties."
}