{
  "main_persona": "Real Estate Developer",
  "sub_persona": "Residential Developer",
  "details": "#### Primary Objective:\nFind actionable intelligence on land acquisition opportunities, zoning regulations, construction costs, and market analysis to support the planning and execution of residential development projects.\n\n#### Core Information to Retrieve:\n-   **Land & Property Data:** Parcel numbers, legal descriptions, \"plat maps,\" \"topographical surveys,\" \"geotechnical reports,\" \"Phase I Environmental Site Assessment,\" \"undeveloped land,\" \"vacant lot.\"\n-   **Zoning & Entitlements:** \"Zoning code,\" \"land use map,\" \"comprehensive plan,\" \"master plan,\" \"PUD\" (Planned Unit Development), \"variance request,\" \"conditional use permit,\" \"density limits.\"\n-   **Regulatory & Municipal Documents:** City council meeting minutes, planning commission agendas, public hearing notices, building permit applications, subdivision ordinances.\n-   **Financial Analysis:** \"Pro forma,\" \"construction cost estimate,\" \"cost per square foot,\" \"hard costs,\" \"soft costs,\" \"market analysis,\" \"comparable sales\" (comps), \"absorption rate,\" \"impact fees.\"\n-   **Infrastructure & Utilities:** \"Utility availability,\" \"sewer capacity,\" \"water rights,\" \"easements,\" \"stormwater management plan.\"\n-   **Contracts & Bids:** General contractor bids, proposals from architectural or engineering firms, subcontractor agreements, land purchase agreements.\n-   **Market Demographics:** Population growth projections, median household income statistics, school district ratings, employment data.\n-   **Professional Contacts:** Names and firms of civil engineers, land use attorneys, architects, surveyors, and municipal planners.\n\n#### Information to Ignore (Noise):\n-   **Commercial Real Estate Data:** Office/retail lease agreements, tenant improvement allowances, CAM (Common Area Maintenance) charges, information on warehouses or industrial parks.\n-   **Day-to-Day Property Management:** Individual tenant applications, rent collection records, routine maintenance requests for existing properties.\n-   **Individual Home Sales Listings:** MLS listings for single homes (unless used for broad market comps), open house flyers, real estate agent marketing materials for buyers.\n-   **Interior Design Trends:** Articles on home decor, furniture selection, specific color palettes, or appliance reviews.\n-   **Irrelevant Financial News:** General stock market analysis, information on publicly traded REITs not tied to a specific project.\n-   **Completed Project Portfolios:** Finished marketing brochures or websites for projects that are already sold out and completed, unless being used for competitor analysis."
}