{
  "main_persona": "Real Estate Developer",
  "sub_persona": "Affordable Housing Developer",
  "details": "#### Primary Objective:\nRetrieve all critical information related to funding opportunities, zoning regulations, construction costs, and compliance requirements for developing affordable housing projects.\n\n#### Core Information to Retrieve:\n-   **Funding & Financing:**\n    -   Terms: \"Low-Income Housing Tax Credit\" (LIHTC), \"Section 8,\" \"Section 42,\" \"HUD,\" \"HOME funds,\" \"Community Development Block Grant\" (CDBG), \"Housing Trust Fund,\" \"tax-exempt bonds,\" \"private activity bonds.\"\n    -   Phrases: \"Notice of Funding Availability\" (NOFA), \"Request for Proposals\" (RFP), \"Qualified Allocation Plan\" (QAP), \"Sources and Uses,\" \"pro forma,\" \"grant application,\" \"subsidy layers.\"\n-   **Zoning & Entitlements:**\n    -   Terms: \"Inclusionary zoning,\" \"density bonus,\" \"overlay district,\" \"variance,\" \"land use,\" \"entitlements,\" \"assemblage.\"\n    -   Phrases: \"zoning code,\" \"planning board meeting,\" \"public hearing,\" \"community approval.\"\n-   **Regulatory & Compliance:**\n    -   Terms: \"Area Median Income\" (AMI), \"rent restrictions,\" \"income limits,\" \"Fair Housing Act,\" \"deed restriction,\" \"regulatory agreement,\" \"compliance period.\"\n    -   Phrases: \"Tenant income certification,\" \"housing needs assessment.\"\n-   **Project Costs & Construction:**\n    -   Terms: \"Hard costs,\" \"soft costs,\" \"prevailing wage,\" \"cost per unit,\" \"value engineering.\"\n    -   Phrases: \"Geotechnical report,\" \"Phase I Environmental Site Assessment,\" \"general contractor bids.\"\n-   **Partnerships & Stakeholders:**\n    -   Terms: \"Public-private partnership\" (P3), \"Housing Authority,\" \"Community Development Corporation\" (CDC), \"non-profit partner,\" \"syndicator.\"\n    -   Phrases: \"Community benefits agreement,\" \"stakeholder engagement,\" \"memorandum of understanding\" (MOU).\n-   **Market Data:**\n    -   Terms: \"Market study,\" \"demographics,\" \"absorption rate,\" \"vacancy rate\" (specifically for subsidized housing).\n\n#### Information to Ignore (Noise):\n-   Data related exclusively to luxury, market-rate, or high-end residential properties (e.g., \"luxury penthouses,\" \"concierge services\").\n-   Information on purely commercial or industrial real estate (e.g., \"retail leasing,\" \"Class A office space,\" \"warehouse logistics\").\n-   Second home or vacation rental market analysis.\n-   General stock market or macroeconomic reports not directly tied to interest rates or construction material costs.\n-   Marketing brochures for non-affordable properties.\n-   Alumni newsletters or university fundraising documents."
}