{
  "main_persona": "Real Estate Developer",
  "sub_persona": "Hospitality & Leisure Developer",
  "details": "#### Primary Objective:\nRetrieve all data related to market analysis, site acquisition, zoning, financial metrics, and design requirements for developing new hospitality and leisure properties.\n\n#### Core Information to Retrieve:\n-   **Market Analysis & Feasibility:** Phrases like \"feasibility study,\" \"market analysis,\" \"tourism statistics,\" \"visitor demographics,\" \"demand drivers.\"\n-   **Financial Metrics:** \"Pro forma,\" \"development budget,\" \"construction costs,\" \"cost per key,\" \"capital stack,\" \"cap rate,\" \"Return on Investment (ROI),\" \"Internal Rate of Return (IRR).\"\n-   **Hospitality KPIs:** \"Average Daily Rate (ADR),\" \"Revenue Per Available Room (RevPAR),\" \"occupancy rates.\"\n-   **Site & Zoning Information:** \"Zoning code,\" \"land use designation,\" \"entitlements,\" \"permitting process,\" \"site plan,\" \"environmental impact report,\" \"traffic study,\" \"acreage,\" \"parcel number.\"\n-   **Legal & Contracts:** \"Purchase and Sale Agreement,\" \"development agreement,\" \"hotel management agreement,\" \"franchise agreement,\" \"ground lease.\"\n-   **Design & Construction:** \"Architectural plans,\" \"floor plans,\" \"room mix,\" \"amenity list\" (e.g., pool, spa, conference center, restaurant), \"FF&E budget\" (Furniture, Fixtures, and Equipment), \"brand standards.\"\n-   **Financing Terms:** \"Construction loan,\" \"mezzanine financing,\" \"equity partner,\" \"Tax Increment Financing (TIF),\" \"investor summary.\"\n-   **Competitive Landscape:** Names of competitor hotel brands (Marriott, Hilton, Hyatt, etc.), analysis of local hotels/resorts, \"competitive set.\"\n\n#### Information to Ignore (Noise):\n-   Data related to other real estate sectors (e.g., industrial, multi-family residential, office, self-storage).\n-   Day-to-day hotel operational details such as housekeeping schedules, individual guest reservations, or restaurant menus.\n-   General marketing and advertising materials not related to a property's development or sale.\n-   Internal corporate communications like employee handbooks or IT policies.\n-   Detailed scientific or academic research unrelated to tourism, construction, or real estate.\n-   Vendor solicitations for non-development services (e.g., office supplies, catering)."
}