{
  "main_persona": "Real Estate Developer",
  "sub_persona": "Master-Planned Community Developer",
  "details": "#### Primary Objective:\nRetrieve all data related to land acquisition, zoning regulations, infrastructure requirements, market analysis, construction costs, and sales strategies for developing large-scale, master-planned communities.\n\n#### Core Information to Retrieve:\n-   **Land & Site Analysis:** Site surveys, parcel maps, acreage reports, \"topographical map,\" \"geotechnical report,\" \"soil analysis,\" \"environmental impact statement\" (EIS), \"flood zone,\" \"wetlands delineation.\"\n-   **Zoning & Entitlements:** \"Zoning ordinance,\" \"land use plan,\" \"comprehensive plan,\" \"Planned Unit Development\" (PUD), \"entitlement process,\" \"development agreement,\" \"building permit,\" \"variance request,\" \"municipal code,\" \"impact fees.\"\n-   **Financials & Market Data:** \"Pro forma,\" \"financial model,\" \"construction loan,\" \"project budget,\" \"return on investment\" (ROI), \"market analysis,\" \"demographic data,\" \"absorption rate,\" \"comparable sales\" (comps), \"Tax Increment Financing\" (TIF), \"HOA budget.\"\n-   **Infrastructure & Utilities:** \"Utility capacity study,\" \"water rights,\" \"sewer main extension,\" \"traffic impact study,\" \"road construction costs,\" \"power grid access,\" \"telecom infrastructure.\"\n-   **Design & Engineering:** \"Site plan,\" \"master plan,\" \"lot layout,\" \"architectural guidelines,\" \"landscape architecture,\" \"amenity plan\" (e.g., clubhouse, pool, parks, trail systems), \"civil engineering drawings.\"\n-   **Construction & Bidding:** \"General contractor bids,\" \"subcontractor agreements,\" \"construction timeline,\" \"cost to build,\" \"materials pricing,\" \"request for proposal\" (RFP).\n-   **Sales & Marketing:** \"Real estate marketing plan,\" \"sales velocity,\" \"buyer profile,\" \"home pricing strategy,\" \"model home complex,\" \"broker commission agreement.\"\n\n#### Information to Ignore (Noise):\n-   Individual residential real estate listings or single-family home renovation details.\n-   Small-scale commercial lease agreements or tenant improvement documents.\n-   Specifics of unrelated real estate sectors like high-rise office towers or industrial warehousing.\n-   Day-to-day property management documents (e.g., individual rent rolls, tenant maintenance requests).\n-   General stock market analysis not directly related to real estate or construction materials.\n-   Human resources documents like employee handbooks or payroll from other firms.\n-   Marketing materials for completed and sold-out communities."
}