{
  "main_persona": "Real Estate Developer",
  "sub_persona": "Luxury Property Developer",
  "details": "#### Primary Objective:\nRetrieve all data related to high-value land acquisition opportunities, luxury market analytics, zoning regulations, and financial modeling to identify and execute profitable luxury real estate projects.\n\n#### Core Information to Retrieve:\n-   **Land & Site Information:** Phrases like \"prime parcel,\" \"land for sale,\" \"development site,\" \"assemblage,\" \"entitled land,\" specific high-value addresses or zip codes.\n-   **Zoning & Entitlements:** \"Zoning code,\" \"variance request,\" \"conditional use permit,\" \"floor area ratio (FAR),\" \"density bonus,\" \"environmental impact report (EIR),\" \"entitlement process.\"\n-   **Financial Data & Metrics:** \"Pro forma,\" \"development budget,\" \"construction loan,\" \"cost per square foot,\" \"capital stack,\" \"mezzanine financing,\" \"joint venture (JV) agreement,\" \"return on investment (ROI),\" \"internal rate of return (IRR).\"\n-   **Market Analysis:** \"Comparable sales (comps),\" \"luxury market report,\" \"absorption rate,\" \"price per square foot,\" \"high-net-worth individual (HNWI) demographics,\" \"housing market forecast.\"\n-   **Design & Construction:** Names of renowned architects or interior design firms, \"luxury finishes,\" \"high-end appliances,\" \"smart home integration,\" names of premium material suppliers, \"general contractor bids.\"\n-   **Luxury Amenities:** \"Rooftop terrace,\" \"infinity pool,\" \"concierge service,\" \"valet parking,\" \"private theater,\" \"fitness center,\" \"resident lounge.\"\n-   **Legal & Transactional Terms:** \"Purchase and sale agreement,\" \"due diligence,\" \"title report,\" \"escrow,\" \"letter of intent (LOI).\"\n\n#### Information to Ignore (Noise):\n-   Information on affordable housing projects, low-income housing tax credits (LIHTC), or Section 8 housing.\n-   Single-family home rental listings or individual apartment listings.\n-   Standard residential mortgage applications or first-time homebuyer guides.\n-   Industrial, agricultural, or low-end commercial (e.g., strip mall) real estate listings and reports.\n-   DIY home renovation or interior decorating tips.\n-   General news about interest rate fluctuations not tied to a specific project analysis."
}