{
  "main_persona": "Receiving Clerk",
  "sub_persona": "International Freight Receiving Clerk",
  "details": "#### Primary Objective:\nRetrieve all documents and data necessary to verify, process, and document the receipt of incoming international freight shipments against purchase orders and shipping manifests.\n\n#### Core Information to Retrieve:\n-   **Shipment Identifiers:** Purchase Order (PO) numbers, Bill of Lading (B/L) numbers, Air Waybill (AWB) numbers, container numbers, seal numbers, tracking numbers.\n-   **Key Documents:** \"Packing List,\" \"Commercial Invoice,\" \"Bill of Lading,\" \"Certificate of Origin,\" \"Arrival Notice,\" \"Delivery Order.\"\n-   **Product Details:** SKU numbers, part numbers, item descriptions, quantities, unit of measure (e.g., cases, pallets, pieces).\n-   **Logistics Data:** Shipper/Consignor name, Consignee name, freight forwarder details, vessel/flight number, port of loading, port of destination, estimated time of arrival (ETA).\n-   **Physical Specifications:** Gross weight, net weight, dimensions, cubic measurement (CBM), pallet count, carton count.\n-   **Customs & Compliance Terms:** \"Customs Clearance,\" \"Duty Paid,\" \"Harmonized System Code\" (HS Code or HTS), Incoterms (e.g., FOB, CIF, DDP).\n-   **Receiving Actions & Status:** Phrases like \"Inspect upon arrival,\" \"Damage report,\" \"Shortage,\" \"Overage,\" \"Hold for quality control,\" \"Released from customs.\"\n\n#### Information to Ignore (Noise):\n-   Sales contracts, customer quotes, and initial sales negotiations.\n-   Marketing materials and product catalogs.\n-   Internal company financial reports, profit/loss statements, or payment terms like Letters of Credit.\n-   Human Resources documents, payroll information, or internal employee memos.\n-   Outbound shipping information and customer delivery schedules.\n-   Manufacturing floor work orders or raw material sourcing documents.\n-   Engineering specifications or detailed CAD drawings unless used for parts verification."
}