{
  "main_persona": "Receiving Clerk",
  "sub_persona": "Healthcare Facility Receiving Clerk",
  "details": "#### Primary Objective:\nRetrieve all documentation required to accurately receive, verify, and log incoming shipments of medical supplies, equipment, and pharmaceuticals against purchase orders.\n\n#### Core Information to Retrieve:\n-   **Shipment Identifiers:** Purchase Order (PO) numbers, packing slip numbers, invoice numbers, Bill of Lading (BOL) numbers, tracking numbers (FedEx, UPS, etc.).\n-   **Vendor & Supplier Information:** Supplier names (e.g., \"McKesson,\" \"Medline,\" \"Stryker\"), vendor addresses, contact information.\n-   **Product Details:** Item descriptions, product names (e.g., \"sterile gauze,\" \"IV start kit\"), SKUs, catalog numbers, National Drug Codes (NDC).\n-   **Quantity & Unit Data:** Phrases like \"Quantity Ordered,\" \"Quantity Shipped,\" \"Unit of Measure\" (e.g., box, case, each, pallet), backorder notations.\n-   **Logistics & Destination:** \"Ship To\" address, department names (\"Radiology,\" \"Pharmacy,\" \"Operating Room,\" \"Central Sterile Supply\"), requester names.\n-   **Handling & Compliance:** Special handling instructions like \"Refrigerate Upon Arrival,\" \"Cold Chain,\" \"Fragile,\" \"Biohazard,\" \"Hazardous Material.\"\n-   **Quality Control Data:** Expiration dates, lot numbers, batch numbers, serial numbers for equipment.\n-   **Key Document Types:** The full text or tables within documents titled \"Packing Slip,\" \"Purchase Order,\" \"Invoice,\" \"Shipping Manifest,\" \"Bill of Lading.\"\n-   **Discrepancy Terms:** Phrases indicating issues, such as \"damaged,\" \"shortage,\" \"overage,\" \"wrong item,\" \"return authorization.\"\n\n#### Information to Ignore (Noise):\n-   **Patient Information:** All Protected Health Information (PHI), patient names, medical record numbers, patient bills, insurance details.\n-   **Clinical Documentation:** Surgical procedure notes, diagnostic reports, patient charts, treatment plans, medical research papers.\n-   **Financial Reports:** Hospital-wide budgets, departmental financial statements, shareholder reports, revenue cycle documents.\n-   **Human Resources Documents:** Employee payroll, benefits information, performance reviews, internal HR policy memos.\n-   **Marketing and Public Relations:** Press releases, patient newsletters, advertising materials, community outreach flyers.\n-   **IT and Facilities Management:** IT support tickets, network diagrams, construction plans, maintenance schedules (unless for receiving dock equipment)."
}