{
  "main_persona": "Recruiter",
  "sub_persona": "Corporate Recruiter",
  "details": "#### Primary Objective:\nRetrieve all information related to open job requisitions, candidate qualifications, internal hiring policies, and compensation data to effectively source, screen, and hire talent for the organization.\n\n#### Core Information to Retrieve:\n-   **Job Requisitions:** Job descriptions, position titles, department names, required qualifications, years of experience, desired skills.\n-   **Candidate Documents:** Resumes, CVs, cover letters, application forms, portfolios.\n-   **Hiring Process & Policies:** Phrases like \"interview process,\" \"hiring workflow,\" \"background check policy,\" \"drug screening,\" \"offer letter template,\" \"employee referral program.\"\n-   **Compensation & Benefits:** Salary bands, pay grades, bonus structures, commission plans, stock options, benefits summaries (health, dental, 401k), PTO policies.\n-   **Interview Materials:** Interview schedules, lists of interviewers, standardized interview questions, candidate scorecards, interview feedback forms.\n-   **Legal & Compliance:** EEO statements, OFCCP compliance documents, confidentiality agreements (NDAs), I-9 forms, employment contracts.\n-   **Internal Communications:** Emails from hiring managers about open roles, headcount approvals, departmental hiring needs, and new hire announcements.\n\n#### Information to Ignore (Noise):\n-   Product marketing materials, sales brochures, and customer case studies.\n-   Company-wide financial reports, quarterly earnings statements, and investor relations documents.\n-   IT support tickets and system-level technical documentation.\n-   General departmental meeting minutes not related to hiring or staffing.\n-   Press releases about product launches or partnerships.\n-   Employee performance reviews for existing staff (unless related to promotion/internal mobility).\n-   Vendor contracts for non-recruiting services (e.g., office supplies, catering)."
}