{
  "main_persona": "Recruiter",
  "sub_persona": "Diversity & Inclusion Recruiter",
  "details": "#### Primary Objective:\nRetrieve all information related to diversity initiatives, inclusive hiring practices, talent pipelines, and company policies to attract and recruit a diverse workforce.\n\n#### Core Information to Retrieve:\n-   **Diversity & Inclusion Keywords:** \"Diversity,\" \"Inclusion,\" \"Equity,\" \"Belonging,\" \"DEI,\" \"D&I,\" \"Underrepresented Groups,\" \"URM\" (Underrepresented Minority).\n-   **Equal Opportunity Statements:** Phrases like \"Equal Opportunity Employer,\" \"EEO,\" \"Affirmative Action,\" \"commitment to diversity.\"\n-   **Demographic Data & Metrics:** Reports on workforce demographics, representation statistics (by gender, ethnicity, disability, etc.), diversity reports, hiring and promotion rates for different groups.\n-   **Talent Sourcing Partnerships:** Names of organizations like \"National Black MBA Association,\" \"Society of Women Engineers (SWE),\" \"HBCUs,\" \"Hispanic-Serving Institutions (HSIs),\" \"Out in Tech,\" \"Grace Hopper Celebration.\"\n-   **Inclusive Job Descriptions:** Analysis of language in job postings, lists of required vs. preferred qualifications, statements on accommodating disabilities.\n-   **Employee Resource Groups (ERGs):** Names and activities of groups like \"Women's Leadership Network,\" \"Pride Alliance,\" \"Black Professionals Group,\" \"Veterans Network.\"\n-   **Inclusive Benefits & Policies:** Information on parental leave, flexible work arrangements, floating holidays, gender-neutral restrooms, and other benefits that support a diverse workforce.\n-   **Recruitment Programs:** Details on diverse slate requirements, returnship programs, mentorship programs for diverse talent, and targeted recruiting events.\n\n#### Information to Ignore (Noise):\n-   Detailed technical specifications for products or services.\n-   General financial statements, quarterly earnings reports, and stock performance data.\n-   Supply chain, logistics, and manufacturing process documents.\n-   IT support documentation, server maintenance logs, and internal software guides.\n-   Patents and intellectual property filings not related to HR technology.\n-   Marketing materials and press releases focused solely on product launches."
}