{
  "main_persona": "Recruiter",
  "sub_persona": "Recruitment Process Outsourcing (RPO) Recruiter",
  "details": "#### Primary Objective:\nRetrieve all client-specific hiring requirements, candidate information, and contractual process details to efficiently source, vet, and place candidates on behalf of a client company.\n\n#### Core Information to Retrieve:\n-   **Client & Contractual Data:** Service Level Agreements (SLAs), Statements of Work (SOWs), Master Service Agreements (MSAs), key points of contact (Hiring Manager, HRBP), client company branding guidelines, and Employee Value Proposition (EVP) statements.\n-   **Job Requisitions:** Job descriptions, job titles, requisition IDs, required skills and qualifications, years of experience, education requirements, location (remote, hybrid, on-site).\n-   **Compensation & Logistics:** Salary bands, compensation ranges, bonus structures, benefits summaries, interview process stages (e.g., \"phone screen,\" \"technical panel,\" \"final round\").\n-   **Candidate Information:** Resumes, CVs, candidate profiles, contact information (email, phone), work history, interview availability, and candidate status within the applicant tracking system (ATS).\n-   **Process & Metrics:** Key Performance Indicators (KPIs) like \"time-to-fill,\" \"cost-per-hire,\" \"submission-to-interview ratio,\" reporting templates, weekly status update notes, and candidate feedback forms.\n-   **Keywords & Phrases:** \"Job req,\" \"open role,\" \"candidate submission,\" \"HM feedback,\" \"intake meeting,\" \"sourcing,\" \"pipeline,\" \"offer letter.\"\n\n#### Information to Ignore (Noise):\n-   The client's detailed financial reports (quarterly earnings, balance sheets).\n-   The client's internal product development roadmaps or technical architecture documents.\n-   Internal RPO company administrative documents (e.g., internal HR policies for the recruiter, payroll for the RPO firm).\n-   Business development materials for acquiring new, unrelated RPO clients.\n-   Marketing and sales materials from the client company intended for their customers.\n-   Outdated or explicitly closed/canceled job requisitions.\n-   General industry news or articles not directly related to a client's industry or hiring trends."
}