{
  "main_persona": "Recruiter",
  "sub_persona": "Technical Recruiter",
  "details": "#### Primary Objective:\nRetrieve all information identifying potential candidates for technical roles, focusing on their skills, experience, contact details, and professional background.\n\n#### Core Information to Retrieve:\n-   **Contact Information:** Email addresses, phone numbers, links to LinkedIn profiles, GitHub profiles, personal websites, and portfolios.\n-   **Technical Skills (Keywords):**\n    -   **Programming Languages:** Python, Java, JavaScript, TypeScript, Go, Rust, C++, C#, Ruby, PHP, Swift, Kotlin, Scala.\n    -   **Frameworks/Libraries:** React, Angular, Vue, Node.js, Django, Flask, Spring Boot, .NET, TensorFlow, PyTorch.\n    -   **Cloud & DevOps:** AWS, Azure, GCP, Docker, Kubernetes, CI/CD, Terraform, Ansible, Jenkins.\n    -   **Databases:** SQL, NoSQL, PostgreSQL, MySQL, MongoDB, Redis, Cassandra.\n    -   **Methodologies:** Agile, Scrum, Kanban, Site Reliability Engineering (SRE).\n-   **Professional Experience:**\n    -   **Job Titles:** \"Software Engineer,\" \"Developer,\" \"Cloud Architect,\" \"Data Scientist,\" \"DevOps Engineer,\" \"SRE,\" \"Product Manager,\" \"Backend,\" \"Frontend,\" \"Full Stack.\"\n    -   **Company Names:** Especially tech companies or startups.\n    -   **Experience Level:** \"Senior,\" \"Lead,\" \"Principal,\" \"Staff,\" \"Junior,\" \"Intern.\"\n    -   **Action Verbs in Context:** \"developed,\" \"architected,\" \"managed,\" \"deployed,\" \"implemented,\" \"optimized,\" \"led a team.\"\n-   **Education & Certifications:**\n    -   Degrees such as \"B.S. Computer Science,\" \"M.S. in Engineering.\"\n    -   Professional certifications like \"AWS Certified,\" \"Certified Kubernetes Administrator (CKA),\" \"PMP.\"\n-   **Candidate Signals:** Phrases like \"Open to new opportunities,\" \"Seeking new roles,\" \"References available upon request.\"\n\n#### Information to Ignore (Noise):\n-   Company financial reports, sales figures, and marketing materials.\n-   Generic boilerplate text (e.g., \"Equal Opportunity Employer,\" privacy policies, terms of service).\n-   Product manuals, user guides, or customer support documentation.\n-   Large blocks of raw source code (focus on descriptions of projects, not the code itself).\n-   Information related to non-technical roles (e.g., \"Human Resources,\" \"Sales,\" \"Marketing,\" \"Finance\").\n-   Invoices, purchase orders, or other transactional documents.\n-   General news articles or press releases unless they specifically mention individual engineers or technical teams."
}