{
  "main_persona": "Recruiter",
  "sub_persona": "Executive Recruiter",
  "details": "#### Primary Objective:\nIdentify potential executive-level candidates, key company leadership structures, and strategic business information to facilitate high-level talent acquisition.\n\n#### Core Information to Retrieve:\n-   **Executive Titles:** CEO, CFO, COO, CTO, CIO, CMO, President, Chairman, Board of Directors, Vice President (VP), Senior Vice President (SVP), Managing Director, Head of [Department].\n-   **Leadership Language:** Phrases like \"reports to the CEO,\" \"member of the executive team,\" \"P&L responsibility,\" \"led a team of,\" \"strategic direction,\" \"corporate governance.\"\n-   **Candidate Background:** Executive biographies, professional summaries, resumes, CVs, lists of board memberships.\n-   **Company Structure:** Organizational charts, leadership team pages, lists of executives in annual reports or proxy statements (DEF 14A).\n-   **Compensation Data:** Keywords such as \"executive compensation,\" \"long-term incentive plan (LTIP),\" \"stock options,\" \"equity grants,\" \"base salary,\" \"annual bonus,\" \"severance.\"\n-   **Company Performance:** Press releases announcing executive appointments, departures, or promotions. Mentions of M&A activity, revenue growth, EBITDA, funding rounds, and IPO filings.\n-   **Contact Information:** Professional email addresses, office locations, and phone numbers associated with executive-level individuals.\n\n#### Information to Ignore (Noise):\n-   Job descriptions for non-executive roles (e.g., Analyst, Coordinator, Manager, Specialist).\n-   General employee handbooks and company-wide benefit summaries (non-executive).\n-   Product marketing materials, user guides, and technical specifications.\n-   Customer support documents and FAQs.\n-   Press releases about product launches unless a key executive is quoted or featured.\n-   Low-level financial data like departmental budgets or expense reports.\n-   Information about university recruiting programs or internships."
}