{
  "main_persona": "Recruiter",
  "sub_persona": "Sourcer",
  "details": "#### Primary Objective:\nRetrieve all information identifying potential job candidates, including their skills, experience, contact details, and professional background, to build a robust talent pipeline.\n\n#### Core Information to Retrieve:\n-   **Candidate Identity & Contact:** Full names, email addresses, phone numbers, links to personal websites or professional profiles (LinkedIn, GitHub).\n-   **Professional Experience:** Current and past job titles (e.g., \"Software Engineer,\" \"Product Manager\"), company names, dates of employment.\n-   **Key Skills & Technologies:** Specific programming languages (Python, Java), software (Salesforce, Adobe Creative Suite), frameworks (React, .NET), methodologies (Agile, Scrum).\n-   **Qualifications & Education:** University degrees (B.S., MBA), certifications (PMP, AWS Certified), major fields of study, graduation dates.\n-   **Location:** City, state, country, or mentions of \"remote\" work availability.\n-   **Projects & Accomplishments:** Phrases like \"led a team,\" \"managed a project,\" \"launched,\" \"developed,\" \"achieved X% growth,\" \"patents,\" \"publications.\"\n-   **Source Document Keywords:** Terms like \"Resume,\" \"CV,\" \"Curriculum Vitae,\" \"Bio,\" \"About Me\" sections, conference speaker lists, author pages.\n\n#### Information to Ignore (Noise):\n-   Generic job descriptions and job postings from other companies (e.g., \"We are hiring,\" \"Responsibilities include,\" \"Qualifications needed\").\n-   Company financial data, such as annual reports, stock prices, and quarterly earnings.\n-   Marketing materials, product descriptions, and press releases.\n-   Boilerplate legal text like \"Terms of Service,\" \"Privacy Policy,\" and \"Equal Opportunity Employer\" statements.\n-   Reference lists or contact information for anyone other than the potential candidate.\n-   Non-professional personal details such as hobbies, marital status, or date of birth."
}