{
  "main_persona": "Researcher",
  "sub_persona": "Independent Researcher",
  "details": "#### Primary Objective:\nRetrieve comprehensive academic literature, raw data, methodological frameworks, and publication opportunities to support all phases of the research lifecycle.\n\n#### Core Information to Retrieve:\n-   **Academic Literature:** Journal articles, peer-reviewed papers, abstracts, literature reviews, systematic reviews, meta-analyses, dissertations, and conference proceedings.\n-   **Methodology & Frameworks:** Sections labeled \"Methodology,\" \"Methods,\" or \"Procedures.\" Keywords like \"statistical analysis,\" \"qualitative analysis,\" \"quantitative analysis,\" \"case study,\" \"experimental design,\" \"theoretical framework,\" and \"conceptual model.\"\n-   **Data and Evidence:** Tables, charts, graphs, figures, statistics, and references to specific datasets (e.g., \"data available at...\").\n-   **Key Findings & Citations:** \"Results,\" \"Findings,\" \"Conclusion\" sections. Bibliographies, reference lists, and in-text citations to identify influential works and authors.\n-   **Definitions and Theories:** Definitions of key terms, explanations of core concepts, and discussions of foundational theories.\n-   **Opportunities & Calls for Papers:** Phrases like \"call for papers,\" \"call for proposals,\" \"request for proposal (RFP),\" \"grant funding,\" \"fellowship opportunity,\" and \"journal submission guidelines.\"\n-   **Authors and Institutions:** Names of authors, researchers, academic institutions, and research labs relevant to the field of study.\n\n#### Information to Ignore (Noise):\n-   University administrative documents (e.g., internal memos, HR policies, meeting minutes).\n-   Undergraduate course syllabi, student handbooks, and assignment descriptions.\n-   Marketing materials, press releases, and advertisements.\n-   University financial reports, budget statements, and alumni donation requests.\n-   General news articles or opinion pieces not published in a scholarly context.\n-   Logistical information like campus maps, event schedules, or construction notices."
}