{
  "main_persona": "Researcher",
  "sub_persona": "Corporate R&D Scientist",
  "details": "#### Primary Objective:\nRetrieve technical specifications, experimental data, patent filings, and competitive intelligence to drive innovation and the development of new commercial products and technologies.\n\n#### Core Information to Retrieve:\n-   **Technical & Scientific Data:** Experimental methodologies, protocols, material properties, chemical formulas, schematics, and data tables/graphs.\n-   **Keywords:** \"State-of-the-art,\" \"prior art,\" \"methodology,\" \"results and discussion,\" \"experimental setup,\" \"prototype,\" \"proof of concept.\"\n-   **Patents & IP:** Patent numbers, patent applications, inventor names, assignee (company) names, and phrases like \"claims,\" \"novelty,\" and \"inventive step.\"\n-   **Competitor Information:** Competitor company names, product data sheets, technical white papers, and analysis of their technology.\n-   **Materials & Components:** Names of chemical compounds, material suppliers, specific equipment models, and part numbers.\n-   **Quantitative Data:** Specific measurements, performance metrics, efficacy rates, yields, statistical analyses (e.g., p-values, standard deviation).\n-   **Regulatory & Standards:** References to industry standards (ISO, ASTM, IEEE) and regulatory bodies (FDA, EPA) relevant to product development and safety.\n-   **Academic Research:** Scientific papers, conference proceedings, and university research directly applicable to the company's field.\n\n#### Information to Ignore (Noise):\n-   General corporate financial reports (e.g., quarterly earnings, shareholder letters).\n-   Marketing and advertising copy not containing technical specifications.\n-   Human Resources documents (e.g., job postings, employee policies, benefits).\n-   General news articles and press releases about company personnel or social initiatives.\n-   Legal documents unrelated to patents or technology licensing (e.g., real estate contracts, general terms of service).\n-   Research from completely unrelated scientific fields.\n-   Logistical or administrative information (e.g., meeting schedules, cafeteria menus, IT support tickets)."
}