{
  "main_persona": "Researcher",
  "sub_persona": "Social Science Researcher",
  "details": "#### Primary Objective:\nRetrieve scholarly articles, methodological frameworks, datasets, and ethical guidelines to support the design, execution, and publication of social science research.\n\n#### Core Information to Retrieve:\n-   **Research Methodologies:** Keywords like \"qualitative research,\" \"quantitative analysis,\" \"mixed-methods,\" \"ethnography,\" \"case study,\" \"survey design,\" \"interview protocol,\" \"focus groups,\" \"statistical modeling,\" \"content analysis,\" \"longitudinal study.\"\n-   **Theoretical Concepts:** Phrases like \"theoretical framework,\" \"conceptual model,\" \"literature review,\" and specific social science concepts (e.g., \"social capital,\" \"structural inequality,\" \"cognitive dissonance,\" \"political behavior\").\n-   **Data & Statistics:** References to \"dataset,\" \"census data,\" \"survey results,\" \"statistical significance,\" \"p-value,\" \"correlation,\" \"regression analysis,\" \"standard deviation,\" and mentions of data tables, figures, and charts.\n-   **Ethical Considerations:** Terms such as \"Institutional Review Board (IRB),\" \"informed consent,\" \"human subjects protection,\" \"anonymity,\" \"confidentiality,\" \"research ethics.\"\n-   **Academic Publishing:** Phrases like \"peer-reviewed journal,\" \"call for papers,\" \"manuscript submission,\" \"abstract,\" \"citations,\" \"bibliography,\" \"references,\" \"literature cited.\"\n-   **Grant & Funding Information:** Keywords such as \"research grant,\" \"funding opportunity,\" \"call for proposals,\" \"grant application,\" and names of major funding bodies (e.g., \"NSF,\" \"NIH,\" \"SSHRC\").\n-   **Key Thinkers & Literature:** Citations and discussions of foundational and contemporary authors in relevant social science fields (e.g., Sociology, Anthropology, Psychology, Political Science, Economics).\n\n#### Information to Ignore (Noise):\n-   Research from the hard sciences (e.g., physics, chemistry, biology) unless explicitly linked to a social impact.\n-   University administrative documents (e.g., internal memos, departmental budgets, construction plans).\n-   Undergraduate-level course materials, syllabi, and student assignments.\n-   General news articles, opinion pieces, or non-scholarly blog posts.\n-   Marketing materials, advertisements, and corporate financial reports.\n-   Technical manuals for non-research hardware or software."
}