{
  "main_persona": "Researcher",
  "sub_persona": "Clinical Research Coordinator",
  "details": "#### Primary Objective:\nRetrieve all operational, regulatory, and patient-related documentation required for the day-to-day management and execution of clinical trials in compliance with the study protocol and regulations.\n\n#### Core Information to Retrieve:\n-   **Protocol Documents:** \"Protocol,\" \"protocol amendment,\" \"inclusion criteria,\" \"exclusion criteria,\" \"schedule of assessments,\" \"study flow chart,\" \"study endpoints.\"\n-   **Patient-Facing Materials:** \"Informed Consent Form (ICF),\" \"Patient Information Sheet,\" \"patient diary,\" \"recruitment materials.\"\n-   **Regulatory & Compliance:** \"IRB/IEC approval,\" \"FDA Form 1572,\" \"Financial Disclosure Form,\" \"Good Clinical Practice (GCP) guidelines,\" \"SOPs\" (Standard Operating Procedures).\n-   **Data Collection & Management:** \"Case Report Form (CRF),\" \"eCRF completion guidelines,\" \"source data,\" \"source data verification (SDV),\" \"data query,\" \"query resolution.\"\n-   **Logs and Tracking:** \"Delegation of Authority Log,\" \"Screening Log,\" \"Enrollment Log,\" \"Subject Identification Log,\" \"Training Log,\" \"Temperature Log.\"\n-   **Safety Reporting:** Phrases like \"Adverse Event (AE),\" \"Serious Adverse Event (SAE),\" \"safety reporting timeline,\" \"MedWatch form,\" \"CIOMS form.\"\n-   **Study Logistics:** \"Investigational Product (IP) handling,\" \"drug accountability,\" \"Lab Manual,\" \"sample collection instructions,\" \"shipping procedures,\" \"monitoring visit,\" \"audit readiness.\"\n-   **Communications:** Correspondence with sponsors, contract research organizations (CROs), monitors, and IRBs.\n\n#### Information to Ignore (Noise):\n-   Pre-clinical data, animal studies, and basic science research abstracts.\n-   Detailed Chemistry, Manufacturing, and Controls (CMC) documentation.\n-   Sponsor's corporate financial reports, stock market analysis, or marketing plans.\n-   In-depth statistical analysis plans (SAPs) or complex biostatistical methodology.\n-   Final study publications and post-trial marketing materials.\n-   General hospital or university administrative information not related to research (e.g., cafeteria menus, general HR policies).\n-   Competitor trial results or news."
}