{
  "main_persona": "Researcher",
  "sub_persona": "Policy Researcher",
  "details": "#### Primary Objective:\nRetrieve specific legislation, government reports, statistical data, and academic analyses related to the development, implementation, and impact of public policies.\n\n#### Core Information to Retrieve:\n-   **Legislation and Regulation:** Bill numbers (e.g., H.R. 1, S. 5), Public Law numbers, specific act titles (e.g., \"The Civil Rights Act of 1964\"), Code of Federal Regulations (CFR) citations, executive orders, statutes, ordinances.\n-   **Government and Agency Reports:** Reports from entities like the Congressional Research Service (CRS), Government Accountability Office (GAO), and Congressional Budget Office (CBO); departmental reports (e.g., from the Department of Education, Environmental Protection Agency).\n-   **Policy Analysis Terms:** Phrases like \"policy brief,\" \"cost-benefit analysis,\" \"impact assessment,\" \"regulatory impact analysis,\" \"program evaluation,\" \"white paper.\"\n-   **Statistical Data and Metrics:** References to demographic data, economic indicators (GDP, unemployment), public health statistics, crime rates, educational attainment levels. Look for tables, charts, and figures with sourced data.\n-   **Academic and Research Content:** Peer-reviewed articles, academic studies, literature reviews, citations, bibliographies, and references to established theories or models.\n-   **Key Stakeholders and Institutions:** Names of think tanks (e.g., Brookings Institution, Heritage Foundation), advocacy groups, non-governmental organizations (NGOs), legislative committees, and specific government agencies.\n-   **Arguments and Testimony:** Verbatim from congressional hearings, public comments on proposed rules, and formal position statements from organizations.\n\n#### Information to Ignore (Noise):\n-   Internal corporate policies (e.g., HR policies, internal memos, brand guidelines).\n-   General news articles or press releases that only summarize policy without providing data or in-depth analysis.\n-   Purely anecdotal accounts or unsubstantiated opinions from blogs or social media.\n-   Marketing materials, product advertisements, and sales brochures.\n-   Boilerplate document sections such as privacy policies, terms of service, or legal disclaimers.\n-   Financial reports or SEC filings for private corporations, unless directly relevant to a specific economic policy analysis.\n-   Meeting minutes or internal administrative documents from non-policy-making entities."
}