{
  "main_persona": "Researcher",
  "sub_persona": "Humanities Scholar",
  "details": "#### Primary Objective:\nRetrieve primary source texts, secondary scholarly analysis, theoretical frameworks, and bibliographical references to support in-depth humanities research.\n\n#### Core Information to Retrieve:\n-   **Primary Source Materials:** Direct quotes from historical documents, letters, diaries, literary texts (poems, novels, plays), philosophical treatises, manuscripts, and religious texts.\n-   **Scholarly Criticism & Analysis:** Phrases like \"critical analysis,\" \"literary interpretation,\" \"theoretical framework,\" \"discourse analysis,\" \"historiographical review.\"\n-   **Key Concepts & Theories:** Terms specific to humanities disciplines such as \"post-structuralism,\" \"deconstruction,\" \"hermeneutics,\" \"phenomenology,\" \"post-colonialism,\" \"Marxist critique,\" \"feminist theory.\"\n-   **Bibliographical Data:** Footnotes, endnotes, citations, \"Works Cited\" pages, bibliographies, author names, publication dates, and publisher information.\n-   **Historical & Cultural Context:** Names of historical figures, dates of key events, names of artistic or intellectual movements (e.g., \"The Enlightenment,\" \"Romanticism,\" \"Modernism\").\n-   **Author & Artist Information:** Biographies, correspondence, and critiques of authors, philosophers, artists, and other key figures.\n-   **Archival & Manuscript References:** Mentions of specific archives, libraries, special collections, manuscript numbers, or folios.\n\n#### Information to Ignore (Noise):\n-   Quantitative data, statistical models, and mathematical formulas.\n-   Hard science research from fields like biology, chemistry, physics, and medicine.\n-   Technical documentation, engineering schematics, or computer code.\n-   Corporate financial reports, market analysis, and business press releases.\n-   University administrative documents, internal memos, and course catalogs.\n-   Advertisements, marketing copy, and non-scholarly blog posts."
}