{
  "main_persona": "Researcher",
  "sub_persona": "Academic Researcher",
  "details": "#### Primary Objective:\nRetrieve scholarly literature, datasets, research methodologies, and funding opportunities to support the creation and dissemination of original academic work.\n\n#### Core Information to Retrieve:\n-   **Citations & Literature:** Author names, publication dates, journal titles, DOIs (Digital Object Identifiers), and keywords like \"literature review,\" \"prior work,\" \"related studies.\"\n-   **Methodology & Design:** Phrases like \"research method,\" \"methodology,\" \"experimental design,\" \"materials and methods,\" \"case study,\" \"qualitative analysis,\" \"quantitative analysis,\" \"statistical model.\"\n-   **Data & Results:** Tables, figures, graphs, charts, and keywords like \"results,\" \"findings,\" \"dataset,\" \"supplementary data,\" \"data analysis.\"\n-   **Key Concepts & Theories:** Specific terminology of the research field, theoretical frameworks, models, hypotheses, research questions.\n-   **Funding & Acknowledgements:** Grant numbers, funding agency names (e.g., NIH, NSF, ERC), and phrases in the \"Acknowledgements\" section referring to funding.\n-   **Conclusions & Future Work:** Sections labeled \"Conclusion,\" \"Discussion,\" \"Limitations,\" and \"Future Work\" to understand the outcomes and trajectory of the research.\n-   **Author Information:** Author affiliations, university departments, research labs, and corresponding author emails for potential collaboration.\n\n#### Information to Ignore (Noise):\n-   Journal front matter: publisher information, editorial board lists, tables of contents.\n-   Advertisements for products, services, or other journals.\n-   General university administrative documents (e.g., financial reports, marketing brochures).\n-   Conference logistics: social event schedules, travel information, registration forms.\n-   Author biographies and CVs.\n-   Undergraduate-level course materials and syllabi.\n-   Boilerplate copyright notices and legal disclaimers."
}