{
  "main_persona": "Sales Engineer",
  "sub_persona": "Channel Sales Engineer",
  "details": "#### Primary Objective:\nRetrieve comprehensive technical product information, sales enablement materials, competitive intelligence, and channel program details to support partner sales and technical efforts.\n\n#### Core Information to Retrieve:\n-   **Product Technical Specifications:** Datasheets, feature comparisons, system requirements, API documentation, performance benchmarks, technical whitepapers, architectural diagrams, integration guides.\n-   **Solution Design & Use Cases:** Reference architectures, solution briefs, customer success stories, case studies, deployment scenarios, common implementation patterns.\n-   **Sales Enablement & Training (Partner-Facing):** Sales playbooks, battlecards (competitive analysis), value propositions, ROI calculators, demo scripts, partner training modules, certification paths, webinar schedules.\n-   **Channel Partner Program Details:** Partner tiers and benefits, incentive programs, Marketing Development Funds (MDF) guidelines, partner onboarding documentation, commission structures, partner agreement terms.\n-   **Competitive Intelligence:** Competitor product specifications, competitive feature analysis, competitor pricing strategies, market share reports, differentiation points, counter-arguments.\n-   **Pricing & Licensing:** Product SKUs, licensing models (e.g., subscription, perpetual, per-user), volume discounts, partner margins, quoting tools information.\n-   **Roadmaps:** Product roadmaps, upcoming feature releases, technology previews relevant to sales and partner strategy.\n-   **Customer & Partner FAQs:** Common technical questions, common sales objections, troubleshooting guides, best practices for solution deployment and management.\n-   **Market Trends & Analysis:** Industry reports, analyst insights, emerging technology trends impacting the sales landscape.\n\n#### Information to Ignore (Noise):\n-   Internal human resources policies or employee benefits information.\n-   Deep academic research papers unrelated to product development or market trends.\n-   Company-wide internal financial reports (e.g., balance sheets, investor reports).\n-   Manufacturing process documentation or supply chain logistics.\n-   General corporate press releases not related to product launches, partnerships, or market performance.\n-   Individual customer support tickets or highly granular bug reports (unless compiled into a known issues database or FAQ).\n-   Physical office maintenance schedules or facility management documents.\n-   Legal contracts unrelated to sales agreements or partner agreements.\n-   Internal company event calendars for non-sales/technical activities."
}