{
  "main_persona": "Sales Engineer",
  "sub_persona": "Pre-Sales Solutions Architect",
  "details": "#### Primary Objective:\nRetrieve all technical requirements, business challenges, and existing infrastructure details from customer-facing documents to architect a viable and compelling pre-sales solution.\n\n#### Core Information to Retrieve:\n-   **Business & Technical Requirements:** \"Requirements,\" \"RFP\" (Request for Proposal), \"RFI\" (Request for Information), \"problem statement,\" \"business goals,\" \"pain points,\" \"use cases,\" \"user stories,\" \"success criteria,\" \"KPIs.\"\n-   **Current Infrastructure Details:** \"Current architecture,\" \"system diagram,\" \"network topology,\" \"as-is state,\" \"data center,\" \"cloud environment\" (AWS, Azure, GCP), \"server specifications.\"\n-   **Existing Technology Stack:** \"Software stack,\" \"applications,\" \"database\" (MySQL, Oracle, Postgres, MongoDB), \"programming languages,\" \"frameworks,\" \"operating systems.\"\n-   **Integration & Data:** \"API,\" \"data format\" (JSON, XML, CSV), \"data migration,\" \"ETL,\" \"integration points,\" \"single sign-on (SSO),\" \"authentication methods.\"\n-   **Security & Compliance:** \"Security requirements,\" \"compliance,\" \"data privacy,\" \"encryption,\" \"firewall,\" \"SOC 2,\" \"HIPAA,\" \"GDPR,\" \"ISO 27001.\"\n-   **Project & Commercial Context:** \"Project scope,\" \"timeline,\" \"milestones,\" \"budget,\" \"stakeholders,\" \"decision makers,\" \"evaluation criteria.\"\n-   **Competitor Mentions:** Names of known competitor products or companies.\n-   **Performance Metrics:** \"Latency,\" \"throughput,\" \"scalability requirements,\" \"uptime,\" \"disaster recovery,\" \"RTO/RPO.\"\n\n#### Information to Ignore (Noise):\n-   Post-sales implementation plans, support tickets, and bug tracking reports.\n-   Detailed corporate financial reports (e.g., balance sheets, quarterly earnings reports).\n-   Internal administrative documents (e.g., HR policies, employee handbooks, expense reports).\n-   Generic marketing content, press releases, and blog posts that lack technical specifications.\n-   Legal contract boilerplate, standard terms & conditions, and privacy policy sections.\n-   Raw source code, individual developer scripts, or low-level commit logs.\n-   Meeting minutes unrelated to a specific customer opportunity or solution design."
}