{
  "main_persona": "Sales Engineer",
  "sub_persona": "Network & Telecom Sales Engineer",
  "details": "#### Primary Objective:\nRetrieve detailed technical specifications, product data sheets, competitive comparisons, and solution architecture examples to support the design and sale of network and telecommunications solutions.\n\n#### Core Information to Retrieve:\n-   **Technical Specifications:** Data rates (Gbps, Mbps), throughput, latency, port density, power consumption (Watts), hardware dimensions, CPU/memory specs.\n-   **Product Data:** Model numbers (e.g., \"Cisco Catalyst 9300,\" \"Juniper MX204\"), SKUs, part numbers, product datasheets, feature lists.\n-   **Networking Protocols & Features:** BGP, OSPF, MPLS, VLAN, LACP, Spanning Tree (STP), QoS, VXLAN.\n-   **Security Concepts:** Firewall throughput, VPN (IPsec, SSL), Access Control Lists (ACLs), Intrusion Prevention/Detection Systems (IPS/IDS), threat intelligence.\n-   **Telecom & Wireless Technologies:** 5G, LTE, Wi-Fi standards (e.g., \"Wi-Fi 6E,\" \"802.11ax\"), VoIP, SIP, SD-WAN, fiber optics (DWDM).\n-   **Sales & Solution Assets:** Phrases like \"case study,\" \"reference architecture,\" \"solution design,\" \"proof of concept\" (PoC), \"bill of materials\" (BOM).\n-   **Competitive Information:** Comparisons tables, feature parity analysis, phrases like \"vs. Cisco,\" \"alternative to Juniper,\" \"Arista competitor.\"\n-   **Lifecycle & Support:** End-of-Life (EOL), End-of-Sale (EOS) announcements, Service Level Agreements (SLAs), support contract details, warranty information.\n-   **Compliance & Certifications:** FedRAMP, HIPAA, ISO 27001, SOC 2, JITC.\n\n#### Information to Ignore (Noise):\n-   Company financial reports (e.g., quarterly earnings, 10-K filings, stock performance).\n-   Human Resources documents (e.g., internal job postings, benefits summaries, company policies).\n-   High-level marketing materials that lack specific technical data.\n-   Press releases about corporate awards, sponsorships, or executive appointments.\n-   Internal logistics, manufacturing, or supply chain data.\n-   Legal documents such as patent filings or generic terms of service.\n-   General IT topics unrelated to networking, such as database administration or application development."
}