{
  "main_persona": "Sales Engineer",
  "sub_persona": "Cloud Solutions Sales Engineer",
  "details": "#### Primary Objective:\nRetrieve all technical specifications, business value propositions, competitive intelligence, and implementation details for cloud solutions to effectively support the pre-sales process and architect solutions for prospective customers.\n\n#### Core Information to Retrieve:\n-   **Technical Architecture & Specifications:** Architecture diagrams, service level agreements (SLAs), API documentation, data flow diagrams, feature lists, technical limitations, and integration points.\n-   **Security & Compliance:** Information on certifications (e.g., \"SOC 2\", \"ISO 27001\", \"HIPAA\", \"GDPR\"), encryption standards, identity and access management (IAM) capabilities, and security best practices.\n-   **Pricing & Licensing Models:** Cost calculators, pricing tiers, SKU numbers, \"Pay-As-You-Go\" models, reserved instance pricing, and total cost of ownership (TCO) calculators.\n-   **Competitive Intelligence:** Phrases like \"vs. AWS,\" \"Azure alternative,\" \"GCP comparison,\" feature-by-feature competitor comparisons, market analysis reports, and key differentiators.\n-   **Use Cases & Case Studies:** Customer success stories, specific industry applications (e.g., \"financial services,\" \"healthcare\"), proof-of-concept (POC) templates, and detailed solution write-ups.\n-   **Implementation & Migration:** \"Quickstart guides,\" \"migration playbooks,\" \"onboarding checklists,\" \"best practice guides,\" and professional services offerings.\n-   **Sales & Proposal Collateral:** Standard responses for RFPs (Request for Proposal), presentation decks, product datasheets, and white papers detailing solution benefits.\n\n#### Information to Ignore (Noise):\n-   Internal company financial reports, investor relations documents, and stock performance data.\n-   Human Resources (HR) documents, employee handbooks, and internal policy memos.\n-   Post-sales customer support tickets and detailed bug fix logs.\n-   Raw source code, internal build logs, and unit test results.\n-   General marketing and PR content like press releases, social media campaigns, and brand guidelines.\n-   Detailed legal contract negotiations and internal legal department memos."
}