{
  "main_persona": "Salesperson",
  "sub_persona": "Automotive Salesperson",
  "details": "#### Primary Objective:\nRetrieve all information related to vehicle specifications, pricing, competitor comparisons, financing options, and sales processes to support closing deals.\n\n#### Core Information to Retrieve:\n-   **Vehicle Specifications:** Model names, trim levels (e.g., \"LX\", \"EX\", \"Touring\"), engine details (horsepower, torque), MPG ratings, VINs, stock numbers.\n-   **Features & Packages:** Keywords like \"technology package,\" \"leather seats,\" \"sunroof,\" \"Apple CarPlay,\" \"blind-spot monitoring,\" \"towing capacity,\" \"payload.\"\n-   **Pricing & Financials:** MSRP, invoice price, dealer cost, \"holdback,\" customer quotes, deal structures.\n-   **Promotions & Incentives:** Phrases like \"manufacturer rebate,\" \"cash back offer,\" \"special financing,\" \"0% APR,\" \"lease special.\"\n-   **Competitor Information:** Side-by-side comparisons, names of competing models (e.g., \"Camry vs. Accord\"), competitor pricing and features.\n-   **Trade-in Data:** Trade-in appraisal forms, vehicle condition reports, values from \"Kelley Blue Book (KBB)\" or \"NADA Guides.\"\n-   **Customer Information:** Customer names, contact details, vehicle of interest, past communications, credit applications.\n-   **Inventory & Logistics:** Current inventory lists, \"in-transit\" vehicle reports, vehicle location on the lot.\n-   **Warranty & Service:** Details on \"powertrain warranty,\" \"bumper-to-bumper warranty,\" included maintenance plans, and service contract options.\n\n#### Information to Ignore (Noise):\n-   Automotive company stock performance and shareholder reports.\n-   In-depth engineering schematics or raw material reports.\n-   Dealership's internal HR documents like payroll, time-off requests, or benefits administration (unless related to sales commissions).\n-   General marketing campaign analysis or brand-level advertising strategy documents.\n-   Service department repair orders for unrelated vehicles.\n-   Building maintenance or janitorial schedules for the dealership.\n-   Press releases about corporate executive hires or promotions."
}