{
  "main_persona": "Sales Engineer",
  "sub_persona": "Cybersecurity Sales Engineer",
  "details": "#### Primary Objective:\nRetrieve technical details, security vulnerabilities, business requirements, and competitive information from customer documents to map cybersecurity solutions to specific needs and support the sales process.\n\n#### Core Information to Retrieve:\n-   **Technical Environment & Infrastructure:**\n    -   Network architecture diagrams, cloud environment details (AWS, Azure, GCP), data center schematics.\n    -   Lists of current security tools: Firewall (Palo Alto, Cisco, Fortinet), SIEM (Splunk, QRadar), EDR (CrowdStrike, SentinelOne), IAM (Okta, Ping).\n    -   Operating systems (Windows Server, RHEL), virtualization platforms (VMware, Hyper-V), and database types (SQL, Oracle).\n    -   Keywords: \"SaaS,\" \"IaaS,\" \"cloud migration,\" \"API security,\" \"container,\" \"Kubernetes.\"\n-   **Security Pain Points & Gaps:**\n    -   Phrases like \"risk assessment,\" \"vulnerability scan results,\" \"penetration test findings,\" \"audit report,\" \"security incident,\" \"data breach.\"\n    -   Statements of need like \"lack of visibility,\" \"alert fatigue,\" \"slow incident response,\" \"compliance gaps,\" \"unmanaged assets.\"\n-   **Business & Purchase Drivers:**\n    -   Compliance frameworks: \"GDPR,\" \"HIPAA,\" \"PCI DSS,\" \"ISO 27001,\" \"SOC 2,\" \"NIST.\"\n    -   Project names or initiatives related to security or IT upgrades.\n    -   Key stakeholder titles: CISO, \"Chief Information Security Officer,\" \"Director of Security,\" \"Security Architect,\" \"IT Manager.\"\n    -   Budgetary terms: \"budget,\" \"ROI,\" \"TCO\" (Total Cost of Ownership), \"cost savings,\" \"proposal.\"\n-   **Requirements & Specifications:**\n    -   Terms from RFPs/RFIs: \"mandatory requirement,\" \"technical specification,\" \"shall support,\" \"must integrate with.\"\n    -   Feature checklists and comparison tables.\n-   **Competitive Intelligence:**\n    -   Names of competing cybersecurity vendors or products.\n    -   Discussions of dissatisfaction with incumbent/current solutions.\n\n#### Information to Ignore (Noise):\n-   Human Resources documents (e.g., employee directories, payroll, benefits information).\n-   General marketing and public relations materials not related to a security incident.\n-   Company-wide financial statements (unless they specify the IT/security budget).\n-   Legal contracts unrelated to technology procurement or data privacy (e.g., real estate leases).\n-   Raw, voluminous log files or packet captures (the analysis/summary is important, not the raw data).\n-   Physical security details (e.g., building access controls, guard schedules)."
}