{
  "main_persona": "Sales Engineer",
  "sub_persona": "SMB Sales Engineer",
  "details": "#### Primary Objective:\nRetrieve technical product specifications, implementation details, and business value propositions tailored specifically to solve the problems of Small and Medium-sized Business (SMB) clients.\n\n#### Core Information to Retrieve:\n-   **Technical Specifications:** API documentation, system requirements, performance benchmarks, security protocols (e.g., SOC 2, ISO 27001), data encryption standards.\n-   **Implementation & Onboarding:** Phrases like \"quick start guide,\" \"implementation plan,\" \"onboarding process,\" \"setup time,\" \"time to value.\"\n-   **Integration Capabilities:** Information on integrations with common SMB software (e.g., QuickBooks, HubSpot, Salesforce, Slack, Zapier, Microsoft 365).\n-   **Business Value & ROI:** Keywords like \"ROI calculator,\" \"total cost of ownership (TCO),\" \"cost savings,\" \"efficiency gains,\" \"productivity increase.\"\n-   **SMB Use Cases:** Case studies, testimonials, or examples specifically mentioning \"SMB,\" \"small business,\" or \"startup\" clients.\n-   **Competitive Intelligence:** Competitor names combined with terms like \"vs,\" \"comparison,\" \"alternative,\" \"feature gap,\" \"strengths,\" \"weaknesses.\"\n-   **Sales & Demo Assets:** Demo scripts, discovery questions, proof of concept (PoC) templates, standard RFI/RFP answers.\n-   **Pricing & Packaging:** SKU lists, feature matrices for different tiers, SMB-specific pricing packages, or entry-level subscription options.\n\n#### Information to Ignore (Noise):\n-   **Enterprise-Focus Content:** Documents detailing \"Fortune 500\" case studies, global deployment strategies, or multi-year enterprise-only contracts.\n-   **Internal Corporate Information:** HR policies, high-level corporate financial reports, stock performance, marketing campaign analytics, internal memos unrelated to product.\n-   **Highly Complex Legal Documents:** Master Service Agreements (MSAs) for enterprise clients, vendor contracts, patent filings.\n-   **Deep R&D Material:** Raw research data, theoretical academic papers, or early-stage experimental project notes not yet on the product roadmap.\n-   **Irrelevant Technical Details:** Information on deprecated features, end-of-life products, or infrastructure details for internal IT teams (unless directly relevant to product hosting)."
}