{
  "main_persona": "Sales Engineer",
  "sub_persona": "Hardware Sales Engineer",
  "details": "#### Primary Objective:\nRetrieve comprehensive technical and commercial information on hardware products, competitive offerings, and customer requirements to facilitate successful sales engagements and provide expert technical support.\n\n#### Core Information to Retrieve:\n-   **Hardware Product Specifications:** Technical datasheets, performance benchmarks, dimensions, weight, power consumption, thermal characteristics, CPU, memory, storage, I/O ports, connectivity options (e.g., Wi-Fi standards, Ethernet speeds).\n-   **System Compatibility:** Interoperability matrices, supported operating systems, driver requirements, integration guides with third-party hardware/software.\n-   **Pricing and SKUs:** Product codes, bill of materials (BOMs), list prices, discounted pricing structures, bundling options, renewal costs for associated services.\n-   **Competitive Analysis:** Competitor product specifications, pricing, performance comparisons, market positioning, SWOT analysis related to hardware.\n-   **Technical Documentation:** Installation manuals, user guides, troubleshooting guides, service manuals, API documentation for hardware integration, firmware release notes.\n-   **Sales Enablement Materials:** Product presentations, solution architectures, case studies, customer success stories, ROI calculators, sales scripts focused on technical benefits.\n-   **Customer Requirements:** RFPs (Request for Proposals), RFI (Request for Information) responses, technical specifications provided by potential clients, use case descriptions, existing infrastructure details.\n-   **Warranty and Support:** Warranty terms, service level agreements (SLAs), support tiers, return merchandise authorization (RMA) procedures, technical support contact information.\n-   **Certifications and Compliance:** Industry standards (e.g., IEEE, USB-IF), regulatory compliance (e.g., FCC, CE, RoHS, UL), safety certifications.\n-   **Supply Chain & Availability:** Product lead times, End-of-Life (EOL) notices, inventory levels (if directly impacts sales proposals).\n-   **Software/Firmware Requirements:** Specific OS versions, driver updates, management software compatibility necessary for hardware functionality.\n\n#### Information to Ignore (Noise):\n-   Non-hardware specific general company news or press releases.\n-   Detailed internal HR policies or employee benefits information.\n-   High-level financial statements not related to product line profitability.\n-   Marketing materials lacking specific technical details or product numbers.\n-   Legal documents unrelated to sales contracts, warranties, or product liability.\n-   Detailed manufacturing process instructions or factory floor schematics.\n-   General market trend reports without specific product relevance.\n-   Recruitment materials or job postings.\n-   Internal company event calendars for non-sales related activities."
}