{
  "main_persona": "Salesperson",
  "sub_persona": "Sales Development Representative (SDR)",
  "details": "#### Primary Objective:\nRetrieve actionable contact information, company details, and buying signals to identify and qualify potential sales leads for outreach.\n\n#### Core Information to Retrieve:\n-   **Contact Details:** Names, direct job titles, email addresses, direct phone numbers, LinkedIn profile URLs.\n-   **Key Job Titles:** \"Director of,\" \"VP of,\" \"Head of,\" \"Manager,\" \"Chief,\" \"CEO,\" \"CTO,\" \"CIO.\" Focus on decision-making roles relevant to the product being sold.\n-   **Company Firmographics:** Company name, industry, employee count, annual revenue, office locations (HQ and regional).\n-   **Buying Signals & Pain Points:** Keywords like \"challenge,\" \"inefficiency,\" \"bottleneck,\" \"struggling with,\" \"looking to improve,\" \"seeking a solution,\" \"upgrade,\" \"new initiative.\"\n-   **Technology Stack Information:** Mentions of current software, tools, or competitors (e.g., \"currently using [Competitor Name],\" \"our tech stack includes,\" \"powered by\").\n-   **Trigger Events:** News articles or press releases mentioning \"funding round,\" \"acquisition,\" \"merger,\" \"new executive hire,\" \"market expansion,\" \"reorganization.\"\n-   **Strategic Language:** Phrases from reports or plans like \"strategic priorities,\" \"quarterly objectives,\" \"annual plan,\" \"growth targets.\"\n-   **Conference & Trade Show Data:** Attendee lists, speaker lists, and exhibitor lists from relevant industry events.\n\n#### Information to Ignore (Noise):\n-   **Deep Financial Reports:** Full, detailed financial statements like balance sheets, income statements, or cash flow statements.\n-   **Highly Technical Documentation:** API documentation, source code, detailed engineering schematics, product user manuals.\n-   **Internal HR & Administrative Documents:** Employee handbooks, internal memos, vacation policies, benefits guides.\n-   **Generic Marketing Content:** Top-of-funnel blog posts or social media updates from the target company that lack specific names or initiatives.\n-   **Legal & Compliance Documents:** Full text of Terms of Service, Privacy Policies, or detailed boilerplate legal contracts.\n-   **Customer Support Information:** Customer support logs, helpdesk articles, FAQs.\n-   **Irrelevant Job Postings:** Postings for junior, intern, or non-decision-making roles."
}