{
  "main_persona": "Salesperson",
  "sub_persona": "B2B Account Executive",
  "details": "#### Primary Objective:\nRetrieve actionable intelligence on prospective clients, key decision-makers, and market opportunities to drive B2B sales.\n\n#### Core Information to Retrieve:\n-   **Company & Contact Data:** Company names, executive titles (CEO, CFO, CTO, VP, Director), key decision-maker names, email addresses, direct phone lines.\n-   **Business Intelligence:** Phrases like \"strategic initiatives,\" \"key challenges,\" \"business goals,\" \"pain points,\" \"growth plans,\" \"annual report,\" \"quarterly earnings.\"\n-   **Financial Indicators:** Revenue figures, funding announcements, budget allocations, \"investment in technology.\"\n-   **Technological Landscape:** Current software stack (e.g., \"uses Salesforce,\" \"SAP environment\"), \"IT infrastructure,\" \"legacy systems,\" \"digital transformation.\"\n-   **Competitive Information:** Competitor names, \"market share,\" \"competitive analysis,\" \"strengths and weaknesses.\"\n-   **Opportunity Keywords:** \"looking for a solution,\" \"request for proposal (RFP),\" \"seeking to improve,\" \"bottleneck,\" \"inefficiency.\"\n-   **Contractual & Pricing Terms:** \"Master Service Agreement (MSA),\" \"Statement of Work (SOW),\" \"pricing,\" \"licensing model,\" \"ROI calculator,\" \"Total Cost of Ownership (TCO).\"\n-   **Sales Enablement:** \"Case study,\" \"testimonial,\" \"white paper,\" \"product one-pager,\" \"battle card.\"\n\n#### Information to Ignore (Noise):\n-   Detailed source code, developer logs, or highly technical API documentation.\n-   Internal Human Resources documents like payroll information, employee benefits enrollment, or vacation policies.\n-   Low-level administrative records such as office supply orders, facilities requests, or catering invoices.\n-   General marketing content aimed at consumers (B2C).\n-   Irrelevant press releases or news about topics outside of the business/technology sphere.\n-   Personal employee information or non-work-related communications."
}