{
  "main_persona": "Salesperson",
  "sub_persona": "Financial Products Salesperson",
  "details": "#### Primary Objective:\nRetrieve detailed information on financial products, potential client profiles, market analysis, and compliance requirements to support the sales process.\n\n#### Core Information to Retrieve:\n-   **Product Details:** Prospectuses, fact sheets, product summaries for mutual funds, annuities, life insurance, ETFs, managed accounts.\n-   **Financial Terms & Metrics:** \"Expense ratio,\" \"AUM (Assets Under Management),\" \"yield,\" \"rate of return,\" \"alpha,\" \"beta,\" \"surrender charge,\" \"death benefit,\" \"premium.\"\n-   **Client Suitability & Goals:** Phrases like \"risk tolerance,\" \"investment objective,\" \"time horizon,\" \"retirement planning,\" \"college savings,\" \"estate planning,\" \"wealth transfer.\"\n-   **Sales & Persuasion Language:** Sales scripts, talking points, key benefits, value propositions, competitive advantages.\n-   **Objection Handling:** Lists of common client objections and recommended responses (e.g., \"fees are too high,\" \"market is too volatile\").\n-   **Regulatory & Compliance Terms:** \"FINRA,\" \"SEC,\" \"fiduciary,\" \"suitability,\" \"accredited investor,\" \"disclosure,\" \"prospectus,\" \"KYC (Know Your Customer).\"\n-   **Market Commentary:** Economic outlooks, market analysis, interest rate forecasts, sector performance reports.\n-   **Competitor Information:** Names of competing firms or products, fee comparisons, performance comparisons.\n\n#### Information to Ignore (Noise):\n-   Internal HR documents (e.g., employee benefits, vacation policy, internal job postings).\n-   Company-wide IT support guides or system update notices.\n-   Highly technical quantitative analysis or algorithmic trading models.\n-   Deeply detailed back-office operational procedures for trade settlement or account administration.\n-   Internal company financial reports (e.g., departmental budgets, profit & loss statements).\n-   General news articles not related to the economy, markets, or finance.\n-   Non-financial client data or correspondence."
}