{
  "main_persona": "Sales Engineer",
  "sub_persona": "Sales Engineer",
  "details": "#### Primary Objective:\nRetrieve technical product specifications, implementation guides, competitive analyses, and use cases to support the sales process by demonstrating product value and addressing customer-specific technical challenges.\n\n#### Core Information to Retrieve:\n-   **Technical Specifications:** Data sheets, spec sheets, system requirements, hardware/software prerequisites.\n-   **Product Architecture:** System diagrams, workflow charts, data flow models.\n-   **Integration Details:** API documentation, SDKs, integration guides, compatibility matrices.\n-   **Security & Compliance:** Security protocols (e.g., \"encryption in transit\"), compliance certifications (e.g., \"SOC 2,\" \"ISO 27001,\" \"HIPAA\"), data governance policies.\n-   **Performance Metrics:** Benchmarks, load times, scalability limits, performance testing results.\n-   **Implementation & Deployment:** Installation guides, setup instructions, configuration steps, \"getting started\" guides.\n-   **Sales Enablement Material:** Case studies, white papers, technical FAQs, demo scripts, proof-of-concept (PoC) frameworks.\n-   **Competitive Intelligence:** Competitor names, feature comparisons, \"battle cards,\" analyses of competitor products.\n-   **Pricing & Licensing:** SKUs, feature tiers, licensing models, pricing lists (to correlate features with cost).\n-   **Product Roadmap:** Phrases like \"coming soon,\" \"in development,\" \"future release,\" \"Q3 roadmap.\"\n\n#### Information to Ignore (Noise):\n-   Internal HR documents (e.g., employee reviews, benefits information, vacation policy).\n-   Company financial reports, shareholder letters, stock performance data.\n-   General marketing and advertising campaign materials not focused on product features.\n-   Individual customer support tickets and bug tracking logs.\n-   Internal administrative documents (e.g., expense reports, office logistics).\n-   Raw source code."
}