{
  "main_persona": "School Administrator",
  "sub_persona": "Assistant Principal",
  "details": "#### Primary Objective:\nRetrieve all information related to student discipline, attendance, school safety procedures, operational logistics, and staff/student support to ensure a well-managed and secure learning environment.\n\n#### Core Information to Retrieve:\n-   **Student Conduct & Discipline:** Keywords like \"student code of conduct,\" \"discipline policy,\" \"detention,\" \"suspension,\" \"expulsion,\" \"behavioral contract,\" \"incident report,\" \"referral,\" \"dress code,\" and \"plagiarism.\"\n-   **Attendance Records:** Policies and procedures related to \"attendance,\" \"truancy,\" \"unexcused absence,\" \"tardy policy,\" and student sign-in/sign-out logs.\n-   **Safety & Emergency Procedures:** Documents titled \"emergency plan,\" \"safety plan,\" \"fire drill procedure,\" \"lockdown procedure,\" \"evacuation routes,\" and \"visitor policy.\"\n-   **School Operations & Schedules:** \"Bell schedules,\" \"master schedule,\" \"duty rosters\" (e.g., lunch, recess, bus duty), \"bus schedules/routes,\" \"assembly schedules,\" and \"school calendars.\"\n-   **Staff Management & Support:** \"Teacher handbook,\" \"substitute teacher\" information, \"teacher observation\" schedules and forms, \"professional development\" opportunities, and staff meeting agendas.\n-   **Student Support & Services:** Information on \"504 Plans,\" \"IEP meetings,\" \"counseling referrals,\" \"student support team (SST),\" and anti-bullying policies.\n-   **Extracurricular Activities:** Policies for \"field trips,\" chaperone requirements, club advisor lists, and school event logistics.\n-   **Parent Communication:** Templates for disciplinary notices, parent-teacher conference schedules, and logs of parent contact.\n\n#### Information to Ignore (Noise):\n-   Individual student assignments, grades, and report cards (unless attached to a disciplinary report).\n-   Detailed curriculum documents, lesson plans, or state academic standards.\n-   School district budget formulation and detailed financial statements.\n-   PTA/PTO meeting minutes and fundraising-specific materials.\n-   Teacher union contracts and salary negotiation documents.\n-   Purchase orders for classroom supplies or textbooks.\n-   School board meeting minutes that do not pertain to discipline or safety policies."
}