{
  "main_persona": "School Administrator",
  "sub_persona": "Technology Director (School/District)",
  "details": "#### Primary Objective:\nRetrieve comprehensive information regarding technology infrastructure, cybersecurity, software/hardware management, IT support, and technology-related policies and budgets for the school or district.\n\n#### Core Information to Retrieve:\n-   **Network Infrastructure:** Network diagrams, server configurations, firewall rules, Wi-Fi access point locations, bandwidth reports, VPN setup instructions.\n-   **Hardware & Software Management:** Device inventory lists (computers, tablets, projectors), asset tags, purchasing agreements, license keys, warranty information, software installation guides, operating system updates, EOL (End-of-Life) notices for equipment.\n-   **Cybersecurity & Data Privacy:** Data breach incident response plans, vulnerability assessment reports, penetration test results, data encryption policies, acceptable use policies (AUP), FERPA/COPPA compliance documents, phishing awareness training materials.\n-   **IT Support & Helpdesk:** Helpdesk ticket trends, common troubleshooting guides, user account management procedures, password reset protocols, knowledge base articles for staff and students.\n-   **Vendor Management & Procurement:** Vendor contracts, service level agreements (SLAs), quotes for new equipment/software, purchase orders, budget allocations for technology, grant applications for tech funding.\n-   **Educational Technology Tools:** Learning Management System (LMS) documentation, Student Information System (SIS) specifications, educational software licenses, integration guides for various platforms (e.g., Google Workspace, Microsoft 365).\n-   **Technology Policies & Procedures:** Data retention policies, disaster recovery plans, device deployment strategies, software update schedules, remote access policies, accessibility standards (WCAG, ADA compliance for digital assets).\n-   **Communication Systems:** VOIP system configurations, inter-school communication platform details, emergency notification system setup.\n-   **Professional Development:** Training materials for staff on new technology tools, IT staff certifications, professional development plans for the tech team.\n\n#### Information to Ignore (Noise):\n-   General academic curriculum documents not directly related to educational technology tools.\n-   Detailed K-12 pedagogical theories or teaching methodologies unrelated to technology integration.\n-   School cafeteria menus or daily student lunch schedules.\n-   Sports schedules, extracurricular activity calendars, or school play announcements.\n-   Fundraising event details not specifically for technology initiatives.\n-   General human resources policies unrelated to IT staff roles or tech-specific training.\n-   Construction plans for new buildings unrelated to network cabling or server room specifications.\n-   Parent-teacher conference schedules or general student disciplinary records."
}