{
  "main_persona": "School Administrator",
  "sub_persona": "School Principal",
  "details": "#### Primary Objective:\nRetrieve all operational, academic, personnel, and safety-related information required for the comprehensive management and leadership of the school.\n\n#### Core Information to Retrieve:\n-   **Personnel & Staffing:** Staff rosters, contact lists, teacher evaluation forms, observation schedules, professional development records, substitute teacher lists, union agreements, staff meeting agendas and minutes.\n-   **Student Data:** Enrollment statistics, attendance records, disciplinary reports (e.g., \"incident report,\" \"suspension\"), standardized test results, graduation rates, demographic data, lists of students with IEPs or 504 plans.\n-   **Budget & Finance:** School-specific budget documents, department allocations, purchase orders, expense reports, grant applications, fundraiser financial statements.\n-   **Operations & Logistics:** Master schedule, bell schedules, bus routes, facility maintenance requests, work orders, inventory lists for supplies and technology.\n-   **Safety & Compliance:** Emergency response plans, crisis protocols, fire drill logs, lockdown procedures, safety committee meeting minutes, state and district compliance reports.\n-   **Curriculum & Academics:** Curriculum maps, state standards, textbook adoption lists, school improvement plans, academic department reports.\n-   **Communications:** Parent newsletters, official school announcements, PTA/PTO meeting agendas, district-level directives, school calendar of events.\n\n#### Information to Ignore (Noise):\n-   Individual student homework, daily classwork, or specific test questions.\n-   Daily, detailed lesson plans from individual teachers (unless part of a formal observation packet).\n-   Informal parent-to-teacher or parent-to-parent emails.\n-   Classroom decoration plans or party planning correspondence.\n-   Raw data from district-wide reports that are not disaggregated to the school level.\n-   Junk mail and unsolicited marketing materials from educational vendors.\n-   Menus for the school cafeteria."
}