{
  "main_persona": "School Administrator",
  "sub_persona": "Human Resources Director (School/District)",
  "details": "#### Primary Objective:\nRetrieve all information pertaining to school district personnel management, including recruitment, compensation, benefits, compliance, employee relations, and professional development.\n\n#### Core Information to Retrieve:\n-   **Recruitment & Hiring:** Job descriptions, application forms, interview guides, candidate résumés, offer letters, onboarding checklists, background check policies.\n-   **Employee Data:** Staff rosters, employee contact information, emergency contacts, professional licenses, certifications, credentials, employee demographic data.\n-   **Compensation & Benefits:** Salary schedules, pay scales, benefit plan summaries (health, dental, vision, life insurance), retirement plan details (401k, pension), leave policies (sick, vacation, FMLA), payroll procedures.\n-   **Policy & Procedure:** Employee handbooks, codes of conduct, disciplinary procedures, grievance processes, performance review forms and guidelines, termination policies, anti-harassment policies, non-discrimination statements.\n-   **Legal & Compliance:** Labor laws (e.g., FMLA, ADA, FLSA), collective bargaining agreements (union contracts), state and federal employment regulations, compliance training materials, workplace safety guidelines.\n-   **Professional Development:** Training schedules, professional development opportunities, continuing education requirements, certification renewal processes, performance improvement plans.\n-   **Employee Relations:** Records of disciplinary actions, complaint forms, investigation reports, mediation notes, exit interview summaries.\n-   **HR Budgets:** Staffing allocations, salary line items, benefits cost projections, HR department operational budgets.\n-   **Internal Communications:** HR department memos, policy updates, staff newsletters (focused on HR topics).\n\n#### Information to Ignore (Noise):\n-   Student academic records, grades, and transcripts.\n-   Curriculum development plans and specific lesson plans.\n-   Detailed school-level budgeting unrelated to HR expenditures.\n-   Extracurricular activity schedules and event flyers for students.\n-   Parent-teacher organization (PTO) meeting minutes.\n-   Student disciplinary reports not involving staff conduct.\n-   Facilities maintenance schedules, building blueprints, or capital improvement project details.\n-   School lunch menus or bus transportation schedules.\n-   Fundraising campaign materials or alumni donation reports."
}