{
  "main_persona": "School Administrator",
  "sub_persona": "Early Childhood Administrator",
  "details": "#### Primary Objective:\nRetrieve all operational, regulatory, educational, and safety-related information required to manage an early childhood education center.\n\n#### Core Information to Retrieve:\n-   **Regulatory & Compliance:** State licensing standards, health and safety codes, staff-to-child ratios, background check procedures, mandated reporter guidelines, accreditation documents (e.g., NAEYC), incident report forms, fire drill logs.\n-   **Curriculum & Development:** Early learning standards, developmental milestones (for ages 2-5), lesson plans, curriculum frameworks (e.g., Montessori, Reggio Emilia), play-based learning activities, assessment tools, developmental checklists.\n-   **Student & Family Information:** Enrollment forms, student medical records, allergy lists, emergency contact information, authorized pickup lists, tuition schedules, fee policies, parent handbooks.\n-   **Staff Management:** Staff handbooks, job descriptions for teachers and aides, professional development schedules, CPR/First Aid certification records, staff meeting agendas, performance evaluation forms, substitute teacher contact lists.\n-   **Operational Documents:** School year calendars, daily schedules (e.g., circle time, nap time, snack time), supply order forms, vendor contracts (food, cleaning), budget reports, newsletters.\n-   **Safety & Health:** Emergency procedures, building evacuation plans, health policies (e.g., illness exclusion), medication administration forms, playground safety checklists.\n\n#### Information to Ignore (Noise):\n-   Curriculum and academic standards for grades 3 and above.\n-   Information related to high school or college admissions (e.g., SAT, transcripts, college fairs).\n-   High school sports schedules and athletic department information.\n-   Advanced academic research papers not related to child development or pedagogy.\n-   University-level course catalogs.\n-   Parent-Teacher Association (PTA) documents for middle or high schools.\n-   Construction plans or architectural blueprints not related to playground or classroom safety."
}