{
  "main_persona": "School Administrator",
  "sub_persona": "Online School Administrator",
  "details": "#### Primary Objective:\nRetrieve all operational, academic, and policy-related information required to effectively manage the students, staff, and digital infrastructure of an online school.\n\n#### Core Information to Retrieve:\n-   **Platform & Technology Management:** Phrases like \"Learning Management System (LMS),\" \"Student Information System (SIS),\" \"vendor contract,\" \"software license,\" \"Acceptable Use Policy (AUP),\" \"IT support tickets.\" Specific platform names like \"Canvas,\" \"Blackboard,\" \"Google Classroom,\" \"PowerSchool.\"\n-   **Student & Enrollment Data:** Enrollment forms, registration data, student rosters, attendance logs (login records, activity metrics), withdrawal information.\n-   **Academic Policies (Online Context):** \"Academic integrity,\" \"plagiarism detection,\" \"netiquette,\" \"online proctoring,\" \"grading policy for digital submissions,\" \"synchronous vs. asynchronous instruction.\"\n-   **Staff Administration:** Teacher contracts, remote work policies, virtual observation rubrics, professional development schedules (especially for technology training), staff directories.\n-   **Compliance & Security:** Documents related to \"FERPA,\" \"COPPA,\" \"CIPA,\" \"data privacy policy,\" \"cybersecurity plan,\" \"data breach protocol,\" \"accreditation standards.\"\n-   **Curriculum & Instruction:** Digital curriculum guides, online course catalogs, pacing guides, state standards alignment documents, assessment schedules.\n-   **School Operations:** School calendars, bell schedules (for synchronous classes), communication plans, emergency procedures (e.g., for system outages), budget reports, enrollment forecasts.\n-   **Student Support:** Contact information for virtual counseling, special education (IEP/504) documentation for remote learning, tech support help guides for students/parents.\n\n#### Information to Ignore (Noise):\n-   Information related to physical school buildings: \"building maintenance,\" \"custodial services,\" \"HVAC,\" \"fire drill procedures,\" \"facility rentals.\"\n-   Transportation logistics: \"bus routes,\" \"parking permits,\" \"student drop-off.\"\n-   Physical supplies: \"textbook inventory\" (unless for digital license counts), \"classroom furniture,\" \"lab equipment\" (unless for at-home kits).\n-   Cafeteria and food service information: \"lunch menus,\" \"free and reduced lunch applications\" (unless handled as part of a general financial aid process).\n-   Individual student assignments, essays, or routine homework submissions (unless flagged for disciplinary or academic integrity review).\n-   Marketing material from non-educational technology vendors."
}