{
  "main_persona": "School Administrator",
  "sub_persona": "School Business Manager",
  "details": "#### Primary Objective:\nRetrieve all financial, operational, and compliance-related information necessary for managing the school's budget, resources, and facilities effectively.\n\n#### Core Information to Retrieve:\n-   **Financial Documents:** Phrases like \"annual budget,\" \"financial statement,\" \"balance sheet,\" \"general ledger,\" \"audit report,\" \"fiscal year,\" \"revenue,\" and \"expenditure.\"\n-   **Budgeting Data:** Specific line items, account codes, departmental budgets (e.g., \"Athletics Budget,\" \"IT Department Budget\"), budget variance reports.\n-   **Procurement & Contracts:** Terms like \"purchase order,\" \"invoice,\" \"RFP\" (Request for Proposal), \"vendor contract,\" \"service agreement,\" \"supplier,\" \"bid.\"\n-   **Human Resources & Payroll:** Data on \"salary schedules,\" \"payroll register,\" \"benefits administration,\" \"pension contributions,\" \"staffing FTE\" (Full-Time Equivalent), union contracts, and stipend amounts.\n-   **Facilities & Operations:** Information on \"facilities maintenance,\" \"capital projects,\" \"utility costs\" (gas, electric, water), \"custodial services,\" \"transportation contracts,\" and \"asset inventory.\"\n-   **Grants & Funding:** Keywords like \"grant application,\" \"Title I funding,\" \"E-rate,\" \"state aid,\" \"endowment,\" \"fundraising,\" and \"donation records.\"\n-   **Compliance & Insurance:** Documents related to \"liability insurance,\" \"property insurance,\" \"workers' compensation,\" \"compliance audit,\" and legal notices.\n\n#### Information to Ignore (Noise):\n-   Individual student grades, report cards, and disciplinary records.\n-   Detailed curriculum documents, lesson plans, and pedagogical materials.\n-   Classroom-specific communications, such as newsletters to parents or homework assignments.\n-   Student admissions applications and enrollment forms.\n-   PTA/PTO meeting minutes (unless they contain a formal budget request).\n-   School event flyers, cafeteria menus, and sports schedules.\n-   Content of Individualized Education Programs (IEPs), except for associated staffing or resource costs."
}