{
  "main_persona": "School Administrator",
  "sub_persona": "School Administrator",
  "details": "#### Primary Objective:\nRetrieve all documents and data related to school operations, staff management, student administration, budget allocation, and policy compliance to ensure the effective and safe functioning of the institution.\n\n#### Core Information to Retrieve:\n-   **Policy and Compliance:** Keywords like \"district policy,\" \"state education code,\" \"FERPA,\" \"Title IX,\" \"accreditation,\" \"compliance report,\" \"student handbook,\" \"code of conduct.\"\n-   **Budget and Finance:** Phrases like \"school budget,\" \"departmental allocation,\" \"purchase order,\" \"expense report,\" \"grant application,\" \"fundraising records.\"\n-   **Staff Management:** Documents such as \"teacher evaluations,\" \"professional development schedules,\" \"staff contracts,\" \"hiring committee notes,\" \"substitute teacher lists,\" \"staff meeting minutes.\"\n-   **Student Data and Administration:** \"Enrollment statistics,\" \"attendance records,\" \"discipline reports,\" \"standardized test scores,\" \"assessment data,\" \"graduation rates,\" \"IEP/504 plans.\"\n-   **Operations and Safety:** \"Emergency response plan,\" \"safety drill logs,\" \"incident reports,\" \"building maintenance schedule,\" \"master schedule,\" \"bus routes,\" \"facility usage requests.\"\n-   **Communications:** \"Parent newsletters,\" \"school board meeting agendas,\" \"PTA/PTO minutes,\" \"official school announcements,\" \"press releases.\"\n-   **Academic Planning:** \"Curriculum guides,\" \"academic calendar,\" \"course catalogs,\" \"textbook adoption lists.\"\n\n#### Information to Ignore (Noise):\n-   Individual student assignments, essays, or daily homework.\n-   Specific classroom lesson plans or daily teaching materials.\n-   Informal email exchanges between individual teachers on non-administrative matters.\n-   Cafeteria daily menus or specific food supply orders.\n-   Flyers for minor, student-run club events.\n-   Personal notes or communications from students.\n-   Individual permission slips for routine field trips."
}