{
  "main_persona": "School Administrator",
  "sub_persona": "Athletic Director",
  "details": "#### Primary Objective:\nRetrieve all information necessary for managing school athletic programs, including scheduling, budgeting, compliance, student eligibility, and team logistics.\n\n#### Core Information to Retrieve:\n-   **Student-Athlete Information:** \"Academic eligibility,\" \"GPA requirements,\" \"student-athlete handbook,\" \"code of conduct,\" \"physical examination forms,\" \"concussion protocol,\" \"permission slips,\" \"team rosters.\"\n-   **Schedules & Logistics:** \"Game schedule,\" \"practice schedule,\" \"tournament bracket,\" \"bus request,\" \"transportation itinerary,\" \"facility reservation,\" \"gym schedule,\" \"field schedule.\"\n-   **Financial Documents:** \"Athletic department budget,\" \"team budget,\" \"purchase order,\" \"expense report,\" \"gate receipts,\" \"ticket sales,\" \"fundraising reports,\" \"booster club meeting minutes.\"\n-   **Coaching & Staff:** \"Coaching contract,\" \"coaching staff list,\" \"contact information,\" \"background check,\" \"CPR/First Aid certification,\" \"coaching evaluation,\" \"scouting reports.\"\n-   **Compliance & Regulations:** Keywords for state athletic associations (e.g., \"UIL,\" \"CIF,\" \"FHSAA\"), \"league bylaws,\" \"transfer policy,\" \"game rules,\" \"Title IX compliance.\"\n-   **Equipment & Facilities:** \"Equipment inventory,\" \"uniform order,\" \"vendor quotes,\" \"maintenance request,\" \"facility use agreement.\"\n-   **Communication:** Parent emails regarding athletics, league-wide announcements, athletic department newsletters.\n\n#### Information to Ignore (Noise):\n-   Non-athletic academic curriculum, such as lesson plans or syllabi for subjects like Math or History.\n-   General school board meeting minutes unless athletics are a specific agenda item.\n-   Information on non-athletic extracurricular clubs (e.g., drama club, debate team).\n-   General student admission and enrollment data that is not broken down by athletic participation.\n-   Cafeteria menus and school lunch program details.\n-   Standardized test score reports for the general student population.\n-   Library records and acquisition lists."
}