{
  "main_persona": "Software Developer",
  "sub_persona": "Mobile App Developer",
  "details": "#### Primary Objective:\nRetrieve technical specifications, API documentation, code examples, and platform-specific guidelines necessary for building, deploying, and maintaining mobile applications.\n\n#### Core Information to Retrieve:\n-   **Platform-Specific SDKs & Frameworks:**\n    -   iOS: SwiftUI, UIKit, Combine, Core Data, XCTest\n    -   Android: Jetpack Compose, Android SDK, Kotlin Coroutines, Room\n-   **Cross-Platform Frameworks:** React Native, Flutter, .NET MAUI, Xamarin\n-   **Programming Languages & Syntax:** Swift, Objective-C, Kotlin, Java, Dart, JavaScript/TypeScript\n-   **Code Snippets & Examples:** Function implementations, class definitions, usage examples for libraries, UI component code.\n-   **API Documentation:** REST API endpoints, GraphQL schemas, function signatures, parameter descriptions, return values, JSON/XML structures.\n-   **Architecture & Design Patterns:** MVVM, MVC, MVI, VIPER, Clean Architecture, Singleton, Dependency Injection, State Management.\n-   **Development Tools & IDEs:** Keywords like \"Xcode,\" \"Android Studio,\" \"VS Code configuration,\" \"Gradle,\" \"CocoaPods,\" \"Swift Package Manager.\"\n-   **Version Control Commands:** Phrases related to \"Git,\" \"pull request,\" \"merge,\" \"rebase,\" \"commit,\" \"branch.\"\n-   **Deployment & Distribution:**\n    -   iOS: \"App Store Connect,\" \"TestFlight,\" \"Code Signing,\" \"Provisioning Profile,\" \"App Store Review Guidelines.\"\n    -   Android: \"Google Play Console,\" \"APK,\" \"AAB\" (Android App Bundle), \"Signing Key,\" \"Play Store Policies.\"\n-   **Performance & Optimization:** Terms like \"memory leak,\" \"profiling,\" \" Instruments,\" \"Android Profiler,\" \"battery optimization,\" \"app startup time,\" \"UI jank.\"\n-   **Testing:** \"Unit Test,\" \"UI Test,\" \"Integration Test,\" \"Mocking,\" \"Espresso,\" \"JUnit.\"\n\n#### Information to Ignore (Noise):\n-   **Non-Mobile Development:** Web development frameworks (e.g., ReactJS, Angular, Vue), backend languages (e.g., PHP, Ruby, Python in a Django/Flask context), desktop-only frameworks.\n-   **High-Level Business & Marketing Documents:** Marketing strategies, user acquisition reports, sales figures, press releases, ad campaign metrics.\n-   **Project Management & Financials:** Budgets, resource allocation spreadsheets, stakeholder meeting minutes, quarterly business reviews (QBRs).\n-   **General Corporate/HR Documents:** Employee handbooks, onboarding presentations, benefits information, company-wide newsletters.\n-   **Hardware & Network Infrastructure:** Server specifications, network topology diagrams, data center information."
}