{
  "main_persona": "Software Developer",
  "sub_persona": "Full-stack Developer",
  "details": "#### Primary Objective:\nRetrieve technical documentation, code examples, architectural patterns, and error solutions relevant to building, testing, and deploying full-stack web applications.\n\n#### Core Information to Retrieve:\n-   **Code Snippets & Examples:** Working code in languages like JavaScript, TypeScript, Python, Java, Go, C#, Ruby, or PHP.\n-   **Front-End Technologies:** Keywords related to frameworks (React, Angular, Vue), libraries (jQuery), and core technologies (HTML, CSS, DOM), including terms like \"component,\" \"props,\" \"state management,\" \"hooks,\" \"CSS Grid,\" \"Flexbox.\"\n-   **Back-End Technologies:** Keywords related to server-side frameworks (Node.js/Express, Django, Flask, Spring, Rails, ASP.NET), API design (REST, GraphQL), and concepts like \"middleware,\" \"routing,\" \"ORM,\" \"controllers.\"\n-   **Database Queries & Schemas:** SQL statements (SELECT, INSERT, UPDATE, JOIN), NoSQL queries (e.g., MongoDB find), schema definitions, migration scripts, and terms like \"index,\" \"foreign key,\" \"collection.\"\n-   **DevOps & Infrastructure:** Configuration files (`Dockerfile`, `docker-compose.yml`, `.travis.yml`, `kubernetes.yaml`), CLI commands (for `git`, `docker`, `kubectl`, `aws`, `gcloud`), and terms like \"CI/CD,\" \"pipeline,\" \"containerization,\" \"serverless,\" \"EC2,\" \"S3,\" \"Lambda.\"\n-   **Error Messages & Debugging:** Stack traces, error codes (e.g., \"404 Not Found,\" \"500 Internal Server Error\"), exception names (e.g., \"NullPointerException\"), and phrases like \"troubleshooting,\" \"debug,\" \"fix.\"\n-   **Configuration & APIs:** Environment variables (`.env`), configuration files (`.json`, `.xml`, `.yaml`), API documentation, mentions of \"API key,\" \"authentication,\" \"OAuth,\" \"JWT.\"\n-   **Testing:** Code related to testing frameworks (Jest, Cypress, Pytest, JUnit), keywords like \"unit test,\" \"integration test,\" \"mock,\" \"assertion.\"\n\n#### Information to Ignore (Noise):\n-   Marketing materials, sales pitches, and press releases.\n-   User interface mockups, user personas, and high-level design documents without code.\n-   Project management artifacts like Gantt charts, budget spreadsheets, and resource plans.\n-   General company communications, HR policies, and employee handbooks.\n-   Legal documents, terms of service, and privacy policies.\n-   Customer support tickets or user feedback that does not contain specific technical details or error logs.\n-   Financial reports, invoices, and billing information."
}