{
  "main_persona": "Software Developer",
  "sub_persona": "Machine Learning Engineer",
  "details": "#### Primary Objective:\nRetrieve technical information about machine learning models, data pipelines, MLOps, and the software engineering practices required to build and deploy them.\n\n#### Core Information to Retrieve:\n-   **ML Frameworks & Libraries:** \"TensorFlow,\" \"PyTorch,\" \"Scikit-learn,\" \"Keras,\" \"Hugging Face,\" \"spaCy,\" \"OpenCV,\" \"XGBoost.\"\n-   **Model Architecture & Concepts:** \"Neural Network,\" \"Transformer,\" \"LSTM,\" \"CNN,\" \"ResNet,\" \"hyperparameters,\" \"loss function,\" \"activation function,\" \"gradient descent.\"\n-   **Data Processing & Engineering:** \"Data pipeline,\" \"ETL,\" \"feature engineering,\" \"data augmentation,\" \"data preprocessing,\" \"Pandas,\" \"NumPy,\" \"Apache Spark.\"\n-   **MLOps & Deployment:** \"MLflow,\" \"Kubeflow,\" \"model deployment,\" \"inference,\" \"API endpoint,\" \"Docker,\" \"Kubernetes,\" \"CI/CD for ML.\"\n-   **Infrastructure & Hardware:** \"AWS SageMaker,\" \"Azure Machine Learning,\" \"Google AI Platform,\" \"GPU,\" \"TPU,\" \"CUDA.\"\n-   **Performance Metrics:** \"Accuracy,\" \"precision,\" \"recall,\" \"F1-score,\" \"AUC-ROC,\" \"latency,\" \"throughput,\" \"mean squared error (MSE).\"\n-   **Code & Algorithms:** Code snippets in Python, pseudocode, algorithm descriptions, mathematical formulas related to models.\n-   **Data Management:** \"Model versioning,\" \"data versioning,\" \"DVC,\" \"training data,\" \"validation set,\" \"data drift,\" \"concept drift.\"\n\n#### Information to Ignore (Noise):\n-   High-level business strategy, marketing plans, and sales forecasts.\n-   User interface (UI) and user experience (UX) design documents, including CSS, HTML, or front-end JavaScript frameworks.\n-   Project management artifacts like budgets, team rosters, and non-technical meeting minutes.\n-   Corporate financial reports, investor relations documents, and earnings calls transcripts.\n-   Human Resources (HR) policies, employee performance reviews, and company-wide announcements.\n-   Standard legal boilerplate, terms of service, and privacy policy text."
}