{
  "main_persona": "Software Developer",
  "sub_persona": "Game Developer",
  "details": "#### Primary Objective:\nRetrieve technical documentation, code examples, API references, and performance optimization guides relevant to game engine features, graphics programming, and gameplay mechanics.\n\n#### Core Information to Retrieve:\n-   **Engine-Specific Keywords:** \"Unreal Engine,\" \"Unity,\" \"Godot,\" \"Blueprints,\" \"C# scripting,\" \"GDScript,\" \"prefabs,\" \"actors,\" \"scenes.\"\n-   **Graphics & Rendering:** \"Shader,\" \"HLSL,\" \"GLSL,\" \"rendering pipeline,\" \"OpenGL,\" \"DirectX,\" \"Vulkan,\" \"ray tracing,\" \"rasterization,\" \"texture mapping,\" \"lighting,\" \"shadows,\" \"anti-aliasing,\" \"post-processing.\"\n-   **Physics:** \"Collision detection,\" \"rigid body,\" \"physics engine\" (e.g., PhysX, Havok), \"hitbox,\" \"raycast,\" \"kinematics.\"\n-   **Gameplay Programming:** \"Game loop,\" \"input handling,\" \"player controller,\" \"state machine,\" \"event handling,\" \"inventory system,\" \"quest logic.\"\n-   **AI Concepts:** \"Pathfinding,\" \"A* algorithm,\" \"behavior tree,\" \"navigation mesh\" (NavMesh), \"NPC logic,\" \"Finite State Machine\" (FSM).\n-   **Performance & Optimization:** \"Profiling,\" \"memory management,\" \"garbage collection,\" \"CPU bound,\" \"GPU bound,\" \"draw calls,\" \"batching,\" \"culling,\" \"LOD\" (Level of Detail), \"frame rate,\" \"FPS.\"\n-   **Code & API:** Code snippets in C++, C#, Python; function names (e.g., `GetComponent`, `SpawnActor`), class references, API documentation.\n-   **Networking:** \"Multiplayer,\" \"replication,\" \"client-server,\" \"peer-to-peer,\" \"latency,\" \"RPC\" (Remote Procedure Call), \"network sockets.\"\n-   **Audio:** \"Audio engine,\" \"spatial audio,\" \"sound mixing,\" \"DSP\" (Digital Signal Processing), \"FMOD,\" \"Wwise.\"\n-   **Data Formats:** \"JSON,\" \"XML,\" \"FBX,\" \"OBJ,\" \"glTF,\" \"PNG,\" \"DDS.\"\n\n#### Information to Ignore (Noise):\n-   Marketing materials, press releases, and sales figures.\n-   Game reviews, player feedback, and forum discussions.\n-   Narrative design documents, character backstories, and script dialogue.\n-   Concept art, storyboards, and mood boards.\n-   Financial reports, investor relations documents, and budget spreadsheets.\n-   EULAs (End User License Agreements), terms of service, and privacy policies.\n-   HR documents, company-wide announcements, and employee handbooks.\n-   High-level project management documents like Gantt charts or release roadmaps."
}