{
  "main_persona": "Software Developer",
  "sub_persona": "Embedded Systems Developer",
  "details": "#### Primary Objective:\nRetrieve technical specifications, programming guides, and hardware documentation necessary for developing, debugging, and optimizing software on resource-constrained embedded devices.\n\n#### Core Information to Retrieve:\n-   **Hardware Documentation:** Datasheets, reference manuals, schematics, errata sheets, pinout diagrams, register maps, memory maps.\n-   **Processor Architectures:** ARM (Cortex-M, Cortex-A), RISC-V, AVR, ESP32, PIC, MIPS.\n-   **Programming Languages & Concepts:** C, C++, Assembly (ASM), linker scripts, memory-mapped I/O, volatile keyword, bit manipulation, firmware.\n-   **Real-Time Operating Systems (RTOS):** Keywords like \"RTOS,\" \"FreeRTOS,\" \"Zephyr,\" \"VxWorks,\" \"QNX,\" and concepts like \"task scheduling,\" \"semaphores,\" \"mutexes,\" \"interrupts (ISRs).\"\n-   **Communication Protocols:** I2C, SPI, UART, CAN bus, LIN bus, Ethernet, Modbus, BLE (Bluetooth Low Energy), Zigbee.\n-   **Development Tools:** Compilers (GCC, Keil, IAR), debuggers (JTAG, SWD, GDB), build systems (Makefiles, CMake), toolchains, cross-compilation.\n-   **Low-Level Drivers:** Code and documentation for GPIO, ADC, DAC, PWM, Timers, Watchdog timers.\n-   **Performance & Constraints:** Phrases like \"power consumption,\" \"low-power mode,\" \"sleep mode,\" \"real-time constraints,\" \"latency,\" \"memory footprint,\" \"bootloader.\"\n-   **Testing & Validation:** Unit testing frameworks for C/C++, hardware-in-the-loop (HIL) testing, static analysis.\n\n#### Information to Ignore (Noise):\n-   High-level application development: Web frameworks (React, Angular), mobile development (Swift, Kotlin), desktop UI toolkits.\n-   Enterprise software architecture: Microservices (unless IoT-related), large-scale database management, corporate IT infrastructure.\n-   Marketing and Sales Material: Product brochures, press releases, competitive analysis, pricing information.\n-   Corporate Information: Financial reports, HR policies, investor relations, company mission statements.\n-   End-user product manuals and user guides.\n-   Web design and front-end development content (HTML, CSS, JavaScript)."
}