{
  "main_persona": "Software Developer",
  "sub_persona": "Cybersecurity Software Engineer",
  "details": "#### Primary Objective:\nRetrieve technical information on secure coding practices, vulnerability analysis, cryptographic implementations, and security-focused development tools to build and maintain robust cybersecurity software.\n\n#### Core Information to Retrieve:\n-   **Vulnerabilities & Threats:** Keywords like \"CVE,\" \"vulnerability,\" \"exploit,\" \"threat model,\" \"attack vector,\" \"OWASP Top 10,\" \"SQL Injection,\" \"Cross-Site Scripting (XSS),\" \"Buffer Overflow,\" \"Zero-Day.\"\n-   **Secure Coding Practices:** Phrases like \"secure coding standards,\" \"input validation,\" \"output encoding,\" \"principle of least privilege,\" \"defense in depth,\" \"threat modeling,\" \"secure defaults.\"\n-   **Static & Dynamic Analysis:** Information on tools and techniques for \"SAST\" (Static Application Security Testing), \"DAST\" (Dynamic Application Security Testing), \"fuzzing,\" \"penetration testing.\"\n-   **Cryptography:** Terms like \"encryption,\" \"hashing,\" \"digital signature,\" \"key management,\" and specific algorithms/protocols like \"AES,\" \"RSA,\" \"SHA-256,\" \"TLS/SSL,\" \"IPsec.\"\n-   **Authentication & Authorization:** Concepts and protocols such as \"OAuth,\" \"SAML,\" \"OpenID Connect,\" \"JWT,\" \"MFA\" (Multi-Factor Authentication), \"Identity and Access Management (IAM),\" \"password hashing.\"\n-   **Security Tools & Libraries:** Names of security-focused libraries, APIs, and frameworks (e.g., \"OpenSSL,\" \"Bouncy Castle,\" \"libsodium\") and analysis tools (e.g., \"Wireshark,\" \"Nmap,\" \"Metasploit,\" \"Burp Suite\").\n-   **Network Security:** Concepts like \"Firewall,\" \"Intrusion Detection System (IDS),\" \"Intrusion Prevention System (IPS),\" \"VPN,\" \"DNSSEC,\" \"secure network protocols.\"\n-   **Compliance & Standards:** References to security standards and regulations like \"NIST Cybersecurity Framework,\" \"ISO 27001,\" \"PCI DSS,\" \"FedRAMP.\"\n\n#### Information to Ignore (Noise):\n-   High-level marketing material, press releases, and sales pitches for security products.\n-   UI/UX design specifications, color palettes, and front-end aesthetic discussions.\n-   Corporate financial reports, investor relations documents, and sales forecasts.\n-   General project management documents (e.g., meeting minutes, team schedules) unless they specifically discuss security milestones or reviews.\n-   HR policies, employee handbooks, and company-wide announcements.\n-   Physical security details like building access, guard schedules, or camera placements."
}