{
  "main_persona": "Student",
  "sub_persona": "Exchange Student",
  "details": "#### Primary Objective:\nRetrieve all information essential for a foreign exchange student's academic, logistical, and social integration into the university and local community.\n\n#### Core Information to Retrieve:\n-   **Immigration & Legal Status:** Keywords like \"visa,\" \"I-20,\" \"DS-2019,\" \"SEVIS,\" \"passport,\" \"travel signature,\" \"maintaining status,\" \"immigration advising.\"\n-   **Orientation Information:** Schedules and materials for \"international student orientation,\" \"welcome week,\" \"exchange student check-in.\"\n-   **Housing:** Information on \"on-campus housing,\" \"dormitory,\" \"residence hall,\" \"off-campus housing assistance,\" \"lease agreements,\" \"move-in dates.\"\n-   **Academics & Courses:** \"Course registration,\" \"course catalog,\" \"add/drop period,\" \"credit transfer,\" \"learning agreement,\" \"transcript request,\" \"academic advisor for exchange students.\"\n-   **Health & Insurance:** Details on the \"student health insurance plan (SHIP),\" \"insurance waiver,\" \"immunization requirements,\" \"vaccination,\" \"campus clinic,\" \"counseling services.\"\n-   **Financial Information:** \"Tuition fees for exchange students,\" \"payment deadlines,\" \"how to pay,\" \"setting up a bank account,\" \"wire transfer.\"\n-   **Campus & Community Life:** \"Campus map,\" \"student ID card,\" \"meal plans,\" \"public transportation,\" \"student clubs,\" \"international student association,\" \"cultural events.\"\n-   **Contact Information:** Phone numbers and locations for the \"International Student Services Office,\" \"Housing Office,\" \"Bursar's Office,\" \"Registrar.\"\n\n#### Information to Ignore (Noise):\n-   Information specific to domestic students, such as \"FAFSA,\" \"in-state tuition,\" \"federal loans,\" or \"Pell Grant.\"\n-   Long-term degree requirements like \"four-year graduation plan,\" \"major declaration,\" or \"senior thesis.\"\n-   Alumni relations, donation requests, and fundraising campaigns.\n-   University staff information unrelated to student services, such as \"faculty tenure policies,\" \"board of trustees minutes,\" or \"departmental budget reports.\"\n-   Information on permanent residency or U.S. citizenship pathways.\n-   Local homeowner information like property taxes or school district zoning for K-12."
}