{
  "main_persona": "Student",
  "sub_persona": "International Student",
  "details": "#### Primary Objective:\nRetrieve critical academic, legal, financial, and logistical information required for an international student to successfully live and study at the institution.\n\n#### Core Information to Retrieve:\n-   **Immigration & Legal Status:**\n    -   Visa requirements (F-1, J-1), I-20 or DS-2019 form information.\n    -   Keywords: \"SEVIS,\" \"maintaining status,\" \"full course of study,\" \"grace period.\"\n    -   Employment authorization: \"CPT\" (Curricular Practical Training), \"OPT\" (Optional Practical Training), on-campus employment rules.\n    -   Contact information for the International Student Services Office (ISSO).\n    -   Passport and visa renewal procedures.\n-   **Financial Information:**\n    -   International student tuition rates, fee schedules, and payment deadlines.\n    -   Scholarships or financial aid specifically for international students.\n    -   Instructions for wire transfers, proof of funds, and financial certification.\n    -   Information on U.S. bank accounts and tax obligations (e.g., \"Form 8843,\" \"1040-NR,\" \"ITIN,\" \"tax treaty\").\n-   **Academic & Language Support:**\n    -   ESL (English as a Second Language) or EAL (English as an Additional Language) programs, placement tests, and support services.\n    -   Academic advising resources, especially those for international students.\n    -   Course registration requirements to maintain full-time enrollment status.\n    -   Explanations of the university's grading system, GPA, and academic integrity policies.\n-   **Housing & Logistics:**\n    -   On-campus housing application process and deadlines for international students.\n    -   Resources for finding off-campus housing, understanding leases, and renter's rights.\n    -   Information on setting up utilities, cell phone plans, and public transportation.\n    -   Procedures for obtaining a state ID or driver's license.\n-   **Health & Insurance:**\n    -   Mandatory health insurance plan details, costs, and enrollment instructions.\n    -   Keywords: \"deductible,\" \"co-pay,\" \"in-network provider.\"\n    -   Location and services of the university health center.\n    -   Required immunization forms and deadlines.\n-   **Orientation & Cultural Adjustment:**\n    -   Schedules for mandatory international student orientation.\n    -   Workshops or resources on cultural adjustment, social norms, and campus life.\n    -   Lists of international or cultural student organizations and clubs.\n\n#### Information to Ignore (Noise):\n-   Financial aid information exclusive to domestic students (e.g., FAFSA, federal loans, state-specific grants).\n-   Admissions criteria for U.S. high school applicants.\n-   In-state vs. out-of-state tuition debates (international tuition is a separate category).\n-   University board of trustees meeting minutes and high-level financial endowment reports.\n-   Alumni fundraising campaigns and donation information.\n-   Information on local K-12 school districts.\n-   U.S. domestic political campaign literature."
}