{
  "main_persona": "Student",
  "sub_persona": "Online/Distance Learning Student",
  "details": "#### Primary Objective:\nRetrieve all academic requirements, course materials, technical specifications, and communication channels necessary for successful participation in online/distance learning programs.\n\n#### Core Information to Retrieve:\n-   **Course Logistics:** Syllabus, course outlines, assignment descriptions, submission guidelines, and due dates.\n-   **Deadlines:** Academic calendar dates for registration, add/drop, withdrawal, tuition payment, and exams.\n-   **Technical Requirements:** Phrases like \"system requirements,\" \"required software,\" \"webcam required,\" \"microphone,\" \"internet speed,\" \"browser compatibility.\"\n-   **Platform Information:** Keywords for Learning Management Systems (LMS) like \"Canvas,\" \"Blackboard,\" \"Moodle,\" \"D2L Brightspace,\" and instructions for their use.\n-   **Communication:** Professor and Teaching Assistant (TA) email addresses, virtual office hours schedules, links to Zoom or Teams meetings, and discussion forum prompts.\n-   **Course Materials:** Links to lecture videos (Panopto, YouTube), presentation slides (PPT), required readings (PDFs, articles), and textbook details (ISBN, title).\n-   **Assessments & Exams:** Exam schedules, study guides, grading rubrics, and information on online proctoring services (e.g., \"ProctorU,\" \"Respondus,\" \"Examity\").\n-   **Support Services:** Contact information and links for the IT help desk, online library resources, virtual tutoring, online writing centers, and distance learning advisors.\n\n#### Information to Ignore (Noise):\n-   Physical classroom numbers and building locations.\n-   On-campus event flyers (e.g., concerts, sports, in-person club meetings).\n-   Campus maps, parking information, and shuttle schedules.\n-   Information about physical facilities like dining halls, dormitories, or university bookstores.\n-   University staff hiring notices or internal HR policies.\n-   Details of faculty research projects or publications not directly assigned as coursework."
}