{
  "main_persona": "Student",
  "sub_persona": "Vocational/Trade Student",
  "details": "#### Primary Objective:\nRetrieve all practical information related to coursework, hands-on training requirements, tool lists, safety protocols, certification processes, and career opportunities for a specific trade.\n\n#### Core Information to Retrieve:\n-   **Program & Course Details:** Course syllabi, project descriptions, course codes (e.g., \"ELEC 101,\" \"WELD 250\"), program completion checklists, workshop schedules.\n-   **Tools & Materials:** Phrases like \"required tool list,\" \"equipment needed,\" \"materials fee,\" \"personal protective equipment (PPE),\" specific tool names (e.g., \"multimeter,\" \"torque wrench\").\n-   **Safety & Procedures:** Safety Data Sheets (SDS), \"lockout/tagout procedures,\" \"workshop safety rules,\" \"emergency protocols,\" hazard warnings.\n-   **Practical Skills & Assessments:** Lab assignments, hands-on project outlines, practical exam schedules, competency checklists, grading rubrics for practical work.\n-   **Certification & Licensing:** Information on \"OSHA certification,\" \"ASE certification,\" \"journeyman license,\" state licensing board requirements, exam study guides, application deadlines.\n-   **Career & Employment:** \"Apprenticeship opportunities,\" \"internship programs,\" \"job fairs,\" contact information for industry partners, job postings from local employers.\n-   **Technical Documents:** Blueprints, schematics, wiring diagrams, technical manuals for equipment, building codes.\n\n#### Information to Ignore (Noise):\n-   General academic courses unrelated to the trade (e.g., philosophy, art history, literature).\n-   Theoretical academic research papers and publications.\n-   University-wide student government information or general campus clubs.\n-   Alumni donation reports and university fundraising campaigns.\n-   Information on traditional four-year degree programs and their general education requirements.\n-   Campus housing information, meal plans, and general student life events not related to the trade school."
}