{
  "main_persona": "Supply Chain Manager",
  "sub_persona": "Supply Chain Risk & Compliance Manager",
  "details": "#### Primary Objective:\nRetrieve all data pertaining to potential supply chain disruptions, supplier vulnerabilities, regulatory obligations, and compliance frameworks to identify and mitigate risks.\n\n#### Core Information to Retrieve:\n-   **Risk Identification Terms:** \"Risk assessment,\" \"vulnerability,\" \"disruption,\" \"threat,\" \"force majeure,\" \"shortage,\" \"delay,\" \"bottleneck,\" \"incident report,\" \"single-source supplier.\"\n-   **Geopolitical & Trade Risks:** \"Sanctions,\" \"tariffs,\" \"embargo,\" \"trade war,\" \"export control,\" \"geopolitical instability,\" \"customs delay.\"\n-   **Compliance & Regulatory Keywords:** \"Compliance,\" \"regulation,\" \"audit,\" \"non-compliance,\" \"certification,\" \"standard,\" \"policy,\" \"inspection,\" \"violation,\" \"penalty,\" \"fine.\"\n-   **Specific Regulations & Standards:**\n    -   Trade/Security: C-TPAT, AEO (Authorized Economic Operator), Incoterms.\n    -   Quality/Risk: ISO 9001 (Quality), ISO 31000 (Risk Management), ISO 28000 (Supply Chain Security).\n    -   Environmental: RoHS, REACH, conflict minerals, carbon footprint, EPA regulations.\n    -   Ethical/Social: \"Modern Slavery Act,\" \"forced labor,\" \"child labor,\" \"ethical sourcing,\" \"code of conduct.\"\n-   **Supplier Documentation:**\n    -   Supplier audit reports, scorecards, and performance reviews.\n    -   Contracts and Service Level Agreements (SLAs), especially clauses on liability, insurance, and termination.\n    -   Supplier Code of Conduct documents.\n    -   Certificates of Compliance / Certificates of Conformance.\n-   **Internal Risk Documents:** Business Continuity Plans (BCP), Disaster Recovery Plans (DRP), Corrective Action Reports (CAR), risk registers, business impact analysis (BIA).\n-   **Financial & Legal Data:** Supplier credit reports, financial stability assessments, insurance policies, legal notices, litigation involving suppliers.\n-   **Operational Metrics (related to risk):** On-time in-full (OTIF) failures, supplier defect rates, inventory shortages, safety incident rates.\n\n#### Information to Ignore (Noise):\n-   General marketing materials and product advertisements.\n-   Routine transactional documents like individual purchase orders, standard invoices, or packing slips.\n-   Internal HR documents unrelated to labor risk (e.g., vacation policies, benefits enrollment).\n-   Detailed product engineering specifications or software source code.\n-   Customer-facing sales data and marketing campaign results.\n-   General company financial reports (P&L, balance sheets) that do not specifically break out supply chain risks or costs.\n-   News articles about general market trends that don't mention specific supply chain impacts."
}