{
  "main_persona": "Supply Chain Manager",
  "sub_persona": "Sustainable Supply Chain Manager",
  "details": "#### Primary Objective:\nRetrieve all data related to environmental, social, and governance (ESG) performance, compliance, risks, and improvement opportunities across the entire supply chain, from raw material sourcing to final delivery.\n\n#### Core Information to Retrieve:\n-   **Environmental Metrics & Reports:** Keywords like \"carbon footprint,\" \"greenhouse gas emissions,\" \"GHG emissions,\" \"Scope 1,\" \"Scope 2,\" \"Scope 3,\" \"water usage,\" \"waste management,\" \"recycling rates,\" \"energy consumption,\" \"sustainability report,\" \"environmental impact assessment,\" and \"tCO2e\" (tonnes of carbon dioxide equivalent).\n-   **Supplier Compliance & Audits:** Phrases like \"supplier code of conduct,\" \"social audit,\" \"environmental audit,\" \"SMETA report,\" \"corrective action plan,\" \"supplier performance scorecards\" that include ESG metrics.\n-   **Sustainable Sourcing & Materials:** Terms like \"ethical sourcing,\" \"sustainable procurement policy,\" \"sustainable materials,\" \"recycled content,\" \"bio-based materials,\" \"deforestation-free,\" \"conflict minerals,\" \"fair trade.\"\n-   **Certifications & Standards:** Names of specific standards and certifications such as \"ISO 14001\" (Environmental Management), \"SA8000\" (Social Accountability), \"Fair Trade,\" \"FSC\" (Forest Stewardship Council), \"B Corp,\" and reporting frameworks like \"GRI\" (Global Reporting Initiative) and \"SASB\" (Sustainability Accounting Standards Board).\n-   **Logistics & Packaging:** Phrases like \"green logistics,\" \"transportation emissions,\" \"route optimization,\" \"modal shift,\" \"sustainable packaging,\" \"packaging-to-product ratio,\" \"reverse logistics,\" \"circular economy.\"\n-   **Risk & Transparency:** Keywords like \"supply chain risk,\" \"climate risk,\" \"human rights risk,\" \"supply chain mapping,\" \"traceability,\" \"supply chain transparency,\" \"tier 1 supplier,\" \"tier 2 supplier.\"\n-   **Legal & Regulatory:** Terms related to environmental and social regulations such as \"EPA,\" \"REACH,\" \"RoHS,\" \"Modern Slavery Act,\" \"conflict minerals reporting.\"\n\n#### Information to Ignore (Noise):\n-   Detailed financial reports (P&L, balance sheets) that do not explicitly break out sustainability-related investments, costs, or risks.\n-   General consumer-facing marketing campaigns and sales promotions.\n-   Internal corporate HR announcements (e.g., office parties, benefits enrollment for non-operational staff).\n-   IT department reports on general cybersecurity or internal software updates, unless the software is for ESG or supply chain management.\n-   General market analysis or stock price reports of competitors that do not mention their sustainability or supply chain practices.\n-   Raw, highly technical engineering schematics unless they are directly related to material composition, product lifecycle, or energy efficiency."
}