{
  "main_persona": "Supply Chain Manager",
  "sub_persona": "Procurement Manager",
  "details": "#### Primary Objective:\nRetrieve all critical data related to supplier capabilities, pricing, contract terms, and material specifications to strategically source goods and services and mitigate supply chain risk.\n\n#### Core Information to Retrieve:\n-   **Supplier Information:** Supplier names, contact details, supplier IDs, performance scorecards, quality certifications (e.g., \"ISO 9001\"), audit reports.\n-   **Pricing and Costing Terms:** Phrases like \"unit price,\" \"cost breakdown,\" \"volume discount,\" \"tiered pricing,\" \"rebates,\" \"total cost of ownership (TCO),\" \"payment terms\" (e.g., \"Net 30,\" \"Net 60\").\n-   **Contractual Language:** Keywords such as \"Master Service Agreement (MSA),\" \"Statement of Work (SOW),\" \"Service Level Agreement (SLA),\" \"indemnity,\" \"liability,\" \"force majeure,\" \"termination clause,\" \"exclusivity.\"\n-   **Product & Material Details:** Part numbers, SKUs, material specifications, bill of materials (BOM), certificates of analysis (CoA), country of origin.\n-   **Logistics & Fulfillment:** Phrases like \"lead time,\" \"minimum order quantity (MOQ),\" \"shipping terms,\" \"Incoterms\" (e.g., \"FOB,\" \"EXW,\" \"DDP\"), carrier names, freight costs.\n-   **Procurement Documents:** Request for Proposal (RFP), Request for Quotation (RFQ), Purchase Orders (POs), supplier quotes, invoices.\n-   **Risk & Compliance:** Supplier risk assessments, business continuity plans, ethical sourcing statements, conflict minerals reports, compliance documentation.\n\n#### Information to Ignore (Noise):\n-   Internal Human Resources documents (e.g., employee performance reviews, payroll, benefits information).\n-   Downstream sales and marketing materials targeting the final customer.\n-   Detailed manufacturing floor work instructions or production schedules.\n-   Customer service call logs and support tickets.\n-   High-level corporate financial reports (e.g., annual reports, shareholder letters) unless they specifically discuss procurement strategy or supply chain costs.\n-   Internal IT support tickets or system update logs."
}