{
  "main_persona": "Supply Chain Manager",
  "sub_persona": "Supply Chain Manager",
  "details": "#### Primary Objective:\nRetrieve all data and documentation related to procurement, logistics, inventory management, and supplier performance to optimize the end-to-end supply chain.\n\n#### Core Information to Retrieve:\n-   **Procurement & Sourcing:** Purchase Orders (POs), supplier contracts, vendor agreements, Requests for Quotation (RFQs), material price lists, and supplier performance scorecards.\n-   **Logistics & Transportation:** Bills of Lading (BOL), shipping manifests, freight invoices, carrier names, tracking numbers, customs declarations, and Incoterms (e.g., FOB, CIF).\n-   **Inventory Management:** Stock Keeping Units (SKUs), part numbers, inventory level reports, warehouse stock counts, demand forecasts, safety stock calculations, and reorder points.\n-   **Performance Metrics (KPIs):** Data on \"lead time,\" \"on-time in-full\" (OTIF), \"inventory turnover,\" \"carrying costs,\" \"cost of goods sold\" (COGS), and \"perfect order rate.\"\n-   **Risk & Compliance:** Supply chain risk assessments, supplier audit reports, quality control inspections, compliance certificates (e.g., ISO 9001), and notices of disruption (e.g., port closures, factory shutdowns).\n-   **System Identifiers:** ERP system codes, Warehouse Management System (WMS) reports, and specific part or material IDs.\n-   **Supplier Communication:** Emails and formal correspondence regarding order status, delays, price changes, or quality issues.\n\n#### Information to Ignore (Noise):\n-   Human Resources documents like employee performance reviews, payroll, or job postings for non-supply chain roles.\n-   Marketing materials, advertising campaign details, and customer demographic analysis.\n-   High-level corporate financial reports like shareholder statements or stock performance.\n-   Internal IT support tickets or software development documentation unrelated to supply chain systems (ERP, WMS).\n-   Sales team meeting minutes and individual sales commission reports.\n-   General company announcements, internal newsletters, or non-operational event planning."
}