{
  "main_persona": "Supply Chain Manager",
  "sub_persona": "Retail Supply Chain Manager",
  "details": "#### Primary Objective:\nRetrieve all data and reports related to inventory, logistics, supplier performance, and distribution operations to optimize the retail supply chain from manufacturer to customer.\n\n#### Core Information to Retrieve:\n-   **Inventory Management:** Terms like \"inventory levels,\" \"stock on hand (SOH),\" \"SKU velocity,\" \"safety stock,\" \"reorder points,\" \"inventory turnover,\" \"stockouts,\" \"overstock,\" and \"cycle count reports.\"\n-   **Logistics & Transportation:** Shipping manifests, bills of lading (BOL), freight costs, carrier performance scorecards, delivery lead times, on-time delivery metrics, and data from Transportation Management Systems (TMS).\n-   **Warehousing & Distribution:** Information on \"warehouse capacity,\" \"distribution center (DC) throughput,\" \"picking and packing efficiency,\" \"cross-docking,\" \"put-away times,\" and reports from Warehouse Management Systems (WMS).\n-   **Supplier & Vendor Management:** Purchase Orders (POs), supplier contracts, vendor compliance reports, supplier scorecards, cost of goods sold (COGS), and lead time data.\n-   **Forecasting & Planning:** Demand forecasts, Sales & Operations Planning (S&OP) documents, and reports on forecast accuracy.\n-   **Retail-Specific Operations:** Point-of-Sale (POS) data related to inventory, replenishment reports, \"omnichannel\" or \"click-and-collect\" performance, returns data, and reverse logistics costs.\n-   **Key Performance Indicators (KPIs):** \"Order fill rate,\" \"perfect order percentage,\" \"cash-to-cash cycle time,\" \"supply chain costs,\" and \"dock-to-stock\" metrics.\n-   **Risk & Compliance:** Reports on supply chain disruptions, port delays, tariff impacts, customs clearance documents, and risk mitigation plans.\n\n#### Information to Ignore (Noise):\n-   Store-level marketing materials, advertising campaign details, and customer demographic analysis.\n-   Human Resources documents such as employee performance reviews, company-wide HR policies, or payroll for non-logistics staff.\n-   Detailed corporate financial reports like quarterly earnings calls, shareholder updates, or stock performance.\n-   In-depth product research and development (R&D) specifications.\n-   Store-level operational details unrelated to inventory, such as employee shift schedules or visual merchandising guides.\n-   IT infrastructure reports on server uptime, cybersecurity protocols, or internal software development."
}