{
  "main_persona": "Supply Chain Manager",
  "sub_persona": "Healthcare Supply Chain Manager",
  "details": "#### Primary Objective:\nRetrieve all critical data related to the procurement, inventory management, logistics, and regulatory compliance for medical supplies, pharmaceuticals, and equipment.\n\n#### Core Information to Retrieve:\n-   **Supplier & Vendor Data:** Vendor contracts, pricing agreements, contact information for suppliers (e.g., Medtronic, Johnson & Johnson, Pfizer), Group Purchasing Organization (GPO) details.\n-   **Product Identification:** Product names, SKUs, model numbers, National Drug Codes (NDC), lot numbers, serial numbers, Unique Device Identification (UDI) codes.\n-   **Inventory Management:** Phrases like \"inventory levels,\" \"par levels,\" \"reorder points,\" \"safety stock,\" \"stock-out,\" \"backorder,\" \"inventory turnover.\"\n-   **Procurement Documents:** Purchase Orders (POs), requisitions, invoices, packing slips, requests for proposal (RFP).\n-   **Logistics & Shipping:** Shipping manifests, carrier details, tracking numbers, delivery schedules, lead times, \"cold chain\" or \"temperature control\" requirements.\n-   **Regulatory & Compliance:** Terms like \"FDA approval,\" \"The Joint Commission,\" \"Drug Supply Chain Security Act (DSCSA),\" \"product recall,\" \"safety alert,\" \"sterilization,\" \"certificate of compliance.\"\n-   **Storage & Handling:** Expiration dates, storage condition requirements (e.g., temperature, humidity), material safety data sheets (MSDS).\n-   **Cost & Analytics:** Spend reports, cost-per-case analysis, supply chain KPIs, budget variance reports.\n-   **Equipment Categories:** Terms like \"Personal Protective Equipment (PPE),\" \"surgical instruments,\" \"diagnostics equipment,\" \"capital equipment,\" \"disposables,\" \"implants.\"\n\n#### Information to Ignore (Noise):\n-   Individual patient medical records, patient diagnoses, or treatment plans (HIPAA-sensitive data).\n-   Clinical trial results and detailed academic medical research.\n-   Hospital marketing materials, press releases, and patient satisfaction surveys.\n-   Human Resources documents like employee performance reviews, payroll, or job applications.\n-   Hospital-wide financial statements, investor relations reports, and stock performance.\n-   Foodservice menus and general, non-medical administrative documents."
}