{
  "main_persona": "Systems Administrator",
  "sub_persona": "Network Systems Administrator",
  "details": "#### Primary Objective:\nRetrieve all technical documentation, configurations, performance metrics, and security policies related to the organization's network infrastructure.\n\n#### Core Information to Retrieve:\n-   **Network Configuration:** IP addresses, subnets, VLAN IDs, CIDR notation, routing tables, and protocols (BGP, OSPF, EIGRP).\n-   **Hardware & Device Information:** Model numbers (e.g., \"Cisco 2960\", \"Palo Alto PA-5220\"), serial numbers, firmware versions, hardware specifications, end-of-life (EOL) dates.\n-   **Security Policies:** Firewall rules, Access Control Lists (ACLs), NAT policies, port security configurations, VPN (IPsec, SSL) settings, IDS/IPS signatures.\n-   **Protocols & Services:** DNS records, DHCP scopes, SNMP configurations, QoS policies, NTP settings, SSH/TLS configurations.\n-   **Monitoring & Performance:** Keywords like \"latency,\" \"jitter,\" \"packet loss,\" \"bandwidth utilization,\" \"uptime,\" and \"throughput.\" Service Level Agreements (SLAs), network performance reports, log files.\n-   **Physical & Logical Topology:** Network diagrams, rack elevations, port mapping documents, wiring schematics, data flow diagrams.\n-   **Procedures & Documentation:** Standard Operating Procedures (SOPs), change management requests, incident response plans, maintenance window schedules, vendor support contract numbers.\n\n#### Information to Ignore (Noise):\n-   Application-level software code and user manuals.\n-   Database schemas and query performance reports.\n-   End-user account information or HR records.\n-   General company financial reports, marketing materials, or sales data.\n-   Desktop support tickets unrelated to network connectivity.\n-   Physical building maintenance information (e.g., HVAC, non-data-center electrical).\n-   Server operating system configurations unless directly related to network services (e.g., DNS server role)."
}