{
  "main_persona": "Systems Administrator",
  "sub_persona": "Infrastructure Engineer",
  "details": "#### Primary Objective:\nRetrieve technical specifications, configuration guides, logs, and performance data necessary for designing, deploying, and maintaining core IT infrastructure.\n\n#### Core Information to Retrieve:\n-   **Hardware Specifications:** Server models (e.g., \"Dell PowerEdge,\" \"HPE ProLiant\"), CPU types, RAM configurations, storage controller models, firmware versions, BIOS settings.\n-   **Network Configuration:** IP address schemas, subnet masks, VLAN IDs, firewall rules, access control lists (ACLs), BGP/OSPF routes, and VPN tunnel configurations.\n-   **Device Configurations:** Configuration files for routers, switches, and load balancers (e.g., Cisco IOS, Juniper Junos, F5 BIG-IP).\n-   **Virtualization & Cloud:** Hypervisor details (\"VMware ESXi,\" \"Hyper-V\"), virtual machine configurations, cloud provider names (\"AWS,\" \"Azure,\" \"GCP\"), and service names (\"EC2,\" \"S3,\" \"VPC,\" \"Azure VMs\").\n-   **Infrastructure as Code (IaC):** Terraform (.tf) files, Ansible playbooks, Kubernetes manifests, Dockerfiles, CloudFormation templates.\n-   **Storage Systems:** SAN zoning configurations, LUN details, NAS share permissions, RAID levels, and storage array models (e.g., \"NetApp,\" \"Pure Storage\").\n-   **Operating Systems & Services:** OS versions (\"Windows Server 2019,\" \"RHEL 8\"), Active Directory/LDAP configurations, DNS records, DHCP scopes.\n-   **Monitoring & Logs:** System logs, error codes, performance metrics (CPU utilization, memory usage, network latency, disk I/O), security alerts, vulnerability scan reports.\n-   **Backup & Recovery:** Backup software names (\"Veeam,\" \"Commvault\"), backup schedules, job reports, and data retention policies.\n-   **Documentation:** Network topology diagrams, rack elevation diagrams, standard operating procedures (SOPs), runbooks, and disaster recovery plans.\n\n#### Information to Ignore (Noise):\n-   Application-level source code and user interface design documents.\n-   End-user support tickets and user-facing software manuals.\n-   Project budgets, vendor invoices, and financial reports.\n-   Company-wide HR policies, marketing materials, and sales reports.\n-   Legal contracts and high-level, non-technical compliance documents.\n-   Minutes from non-technical meetings."
}