{
  "main_persona": "Systems Administrator",
  "sub_persona": "Systems Administrator",
  "details": "#### Primary Objective:\nRetrieve all information necessary for managing, maintaining, troubleshooting, securing, and optimizing IT infrastructure, systems, and networks.\n\n#### Core Information to Retrieve:\n-   **System Logs & Metrics:** Error messages, warning codes, audit logs, performance data (CPU usage, RAM, disk I/O, network traffic), uptime reports.\n-   **Configuration Files & Settings:** Server configurations (Apache, Nginx, IIS), database configurations (MySQL, PostgreSQL, SQL Server), operating system settings (Windows Server, Linux distributions), network device configurations (routers, switches, firewalls), DNS records, DHCP settings.\n-   **Security Information:** Vulnerability reports, patch notes, security advisories, firewall rules, access control lists (ACLs), intrusion detection system (IDS) alerts, security policies, incident response procedures.\n-   **Troubleshooting Guides & Documentation:** Knowledge base articles, error code explanations, diagnostic procedures, known issues, resolution steps, vendor documentation, runbooks, SOPs (Standard Operating Procedures).\n-   **Software & Hardware Details:** Software versions, build numbers, compatibility matrices, driver versions, hardware specifications, asset inventories, license keys, warranty information.\n-   **Network Information:** IP address assignments, subnet masks, VLAN configurations, network topology diagrams, VPN settings, port assignments, bandwidth usage reports.\n-   **User & Access Management:** User account lists, group policies, permissions matrices, authentication methods (LDAP, Active Directory).\n-   **Backup & Recovery:** Backup schedules, recovery procedures, disaster recovery plans, data retention policies.\n-   **Maintenance & Upgrade Information:** Patching schedules, upgrade paths, release notes, end-of-life (EOL) notifications.\n\n#### Information to Ignore (Noise):\n-   Human Resources policies not directly related to IT staff management or access.\n-   Marketing campaigns or public relations announcements.\n-   Detailed financial statements or budget reports not pertaining to IT expenditure.\n-   Sales forecasts, customer acquisition strategies, or lead generation reports.\n-   Customer service call logs or general customer feedback not related to system outages or performance.\n-   Academic research papers on unrelated scientific or social topics.\n-   Legal contracts or terms of service unrelated to IT vendor agreements.\n-   Press releases or general corporate news."
}