{
  "main_persona": "Technical Writer",
  "sub_persona": "Software Documentation Writer",
  "details": "#### Primary Objective:\nRetrieve all technical specifications, feature descriptions, API details, and user interface elements required to produce clear and accurate software documentation.\n\n#### Core Information to Retrieve:\n-   **API Specifications:** Keywords like \"API endpoint,\" \"REST,\" \"GraphQL,\" \"request/response,\" \"JSON payload,\" \"parameters,\" \"authentication,\" \"API key,\" \"rate limit,\" \"HTTP status codes.\"\n-   **Feature Descriptions:** Phrases like \"feature spec,\" \"user story,\" \"acceptance criteria,\" \"business logic,\" \"use case,\" and descriptions of software functionality.\n-   **User Interface (UI) Elements:** Names of buttons, menus, dialog boxes, screen titles, field labels, and specific error message text. Search for \"UI mockups,\" \"wireframes,\" \"GUI.\"\n-   **Configuration & Installation:** System requirements, dependencies, installation steps, setup scripts, and details on configuration files (e.g., `.yaml`, `.xml`, `.conf`).\n-   **Technical Architecture:** System architecture diagrams, data flow diagrams, database schemas, table and column names.\n-   **Code-Level Details:** Code comments explaining logic, method names, class definitions, and environment variables.\n-   **Error Handling & Troubleshooting:** Lists of error codes, exception names, log messages, and \"known issues\" or \"FAQ\" sections.\n-   **Glossaries & Definitions:** Official definitions of technical terms, acronyms, and concepts specific to the software.\n\n#### Information to Ignore (Noise):\n-   **Project Management Artifacts:** Sprint plans, burndown charts, story point estimates, team member assignments, and meeting minutes focused on logistics rather than technical decisions.\n-   **Marketing and Sales Material:** Sales decks, competitor analysis, pricing models, marketing copy, and customer testimonials.\n-   **Corporate Financial & HR Documents:** Quarterly financial reports, investor relations updates, HR policies, employee performance reviews.\n-   **Legal Documents:** Contracts, NDAs, terms of service, and privacy policies (unless documenting a feature related to these).\n-   **Raw, Uncommented Source Code Files:** Large blocks of source code without explanatory comments or documentation strings.\n-   **Informal Team Communication:** Casual chat logs, non-technical email threads, and meeting invitations."
}