{
  "main_persona": "Technical Support Engineer",
  "sub_persona": "Technical Support Engineer",
  "details": "#### Primary Objective:\nRetrieve all technical specifications, troubleshooting guides, error code resolutions, and knowledge base articles to diagnose and solve customer issues efficiently.\n\n#### Core Information to Retrieve:\n-   **Error Identification:** Error codes (e.g., \"0x80070005,\" \"HTTP 403\"), specific error messages (e.g., \"Access Denied,\" \"Null Pointer Exception\"), keywords like \"bug,\" \"issue,\" \"failure,\" \"crash,\" \"glitch,\" \"hang.\"\n-   **Solution-Oriented Language:** Phrases like \"how to fix,\" \"troubleshooting guide,\" \"step-by-step,\" \"workaround,\" \"resolution,\" \"known issue,\" \"best practices.\"\n-   **Technical Documentation:** Product manuals, user guides, API documentation, technical specifications, system requirements, architecture diagrams.\n-   **Knowledge Base Artifacts:** Knowledge Base (KB) article numbers, FAQs, release notes, patch details, version numbers (e.g., \"v3.1.2,\" \"Build 1024\").\n-   **Diagnostic Data & Logs:** Log file snippets, stack traces, memory dumps, configuration file examples (`.xml`, `.conf`, `.ini`), registry keys.\n-   **Commands & Scripts:** Specific command-line inputs, PowerShell/Bash scripts, SQL queries.\n-   **Internal Support History:** Previous ticket numbers, case IDs, incident reports, problem summaries, escalations.\n-   **Product Information:** Specific software names, hardware models, feature names, service names, and component dependencies.\n\n#### Information to Ignore (Noise):\n-   **Marketing & Sales Material:** Press releases, product advertisements, pricing sheets, sales forecasts, customer testimonials, case studies focused on business value.\n-   **Corporate Finance & Legal:** Annual reports, stock performance, legal disclaimers, end-user license agreements (EULA), privacy policies.\n-   **Human Resources Content:** HR policies, open job requisitions, employee performance review templates, corporate hierarchy charts.\n-   **High-Level Business Strategy:** Long-term product roadmaps, market analysis, competitive intelligence reports, mission statements.\n-   **General Office Communications:** Meeting minutes for non-technical teams, company newsletters, announcements for social events."
}