{
  "main_persona": "Technical Support Engineer",
  "sub_persona": "SaaS Support Engineer",
  "details": "#### Primary Objective:\nRetrieve technical documentation, troubleshooting guides, bug reports, and API specifications to diagnose and resolve customer-reported issues with the SaaS application.\n\n#### Core Information to Retrieve:\n-   **Troubleshooting & How-To Guides:** Phrases like \"how to fix,\" \"troubleshoot,\" \"resolve error,\" \"common issues,\" \"FAQ,\" \"step-by-step guide,\" \"workaround.\"\n-   **Error Messages & Codes:** Specific error codes (e.g., \"Error 403,\" \"502 Bad Gateway\") and full error message strings (e.g., \"authentication token expired,\" \"API rate limit exceeded\").\n-   **Product Functionality:** Documentation on feature configuration, user settings, admin panels, user roles, and permissions.\n-   **API & Integration Details:** \"API documentation,\" \"REST endpoint,\" \"API key,\" \"authentication,\" \"webhook,\" \"JSON example,\" \"SDK,\" \"integration guide.\"\n-   **Known Issues & Bug Reports:** \"Bug ID,\" \"JIRA ticket,\" \"known issue,\" \"hotfix,\" \"patch notes,\" \"release notes,\" \"version history.\"\n-   **Technical Specifications:** \"System requirements,\" \"supported browsers,\" \"compatibility matrix,\" \"service level agreement (SLA),\" \"uptime.\"\n-   **Account & Billing Information:** Keywords related to user states like \"account locked,\" \"subscription status,\" \"billing tier,\" \"usage limits,\" \"access denied.\"\n-   **Diagnostic Procedures:** Information on \"log analysis,\" \"how to pull logs,\" \"diagnostic tools,\" \"stack trace,\" \"network trace (HAR file).\"\n-   **Escalation Policies:** Contact information and procedures for \"Tier 2/3 support,\" \"engineering team,\" \"on-call developer,\" \"escalation path.\"\n\n#### Information to Ignore (Noise):\n-   Marketing and sales collateral (e.g., \"customer testimonials,\" \"case studies,\" \"pricing pages,\" \"sales scripts\").\n-   Corporate financial reports (e.g., \"quarterly earnings,\" \"annual reports,\" \"investor relations\").\n-   Human Resources documents (e.g., \"employee handbook,\" \"benefits information,\" \"hiring policies,\" \"company events\").\n-   Raw source code files.\n-   High-level business strategy and long-term product roadmap documents.\n-   Physical data center schematics and hardware maintenance logs.\n-   Press releases and media kits."
}