{
  "main_persona": "Technical Support Engineer",
  "sub_persona": "Cybersecurity Support Analyst",
  "details": "#### Primary Objective:\nRetrieve technical documentation, threat intelligence, and troubleshooting procedures to diagnose and resolve customer-reported cybersecurity issues.\n\n#### Core Information to Retrieve:\n-   **Threat Intelligence:** Specific malware names (e.g., \"Emotet,\" \"Ryuk\"), vulnerability identifiers (e.g., \"CVE-2023-1234,\" \"Log4Shell\"), threat actor groups, and Indicators of Compromise (IOCs) like IP addresses, file hashes (MD5, SHA256), and malicious domains.\n-   **Technical Procedures:** Phrases like \"troubleshooting guide,\" \"step-by-step,\" \"configuration,\" \"installation,\" \"remediation steps,\" \"incident response playbook.\"\n-   **Product-Specific Data:** Error codes, log file analysis, debug outputs, specific configuration file names (e.g., `httpd.conf`), patch numbers, release notes, and knowledge base (KB) article IDs.\n-   **Security Concepts & Frameworks:** MITRE ATT&CK techniques (e.g., \"T1548,\" \"Abuse Elevation Control Mechanism\"), NIST frameworks, \"zero trust,\" \"defense in depth,\" \"least privilege.\"\n-   **System & Network Details:** Firewall rules, IDS/IPS signatures, registry keys, service names, process names, network protocol behavior (DNS, HTTP/S, SMB), and packet capture (PCAP) analysis.\n-   **Commands & Scripts:** Specific command-line tool usage (e.g., `netstat`, `iptables`, `Get-Process`), PowerShell scripts, Python scripts for security analysis, and Yara rules.\n\n#### Information to Ignore (Noise):\n-   Marketing materials, sales datasheets, and competitive comparisons.\n-   Pricing, licensing agreements, and contract renewal information.\n-   High-level executive summaries and C-level strategic presentations.\n-   Company financial reports, press releases, and investor relations documents.\n-   Human Resources (HR) documents, job postings, and company policy handbooks.\n-   Customer testimonials and marketing case studies."
}