{
  "main_persona": "Technical Support Engineer",
  "sub_persona": "Escalation Engineer",
  "details": "#### Primary Objective:\nRetrieve highly detailed technical documentation, bug reports, system logs, and configuration data to diagnose and resolve complex, escalated customer issues.\n\n#### Core Information to Retrieve:\n-   **Error Data:** Error codes, exception messages, stack traces, core dumps, crash reports.\n-   **Log Files:** Debug logs, application logs, system event logs, access logs, verbose output with timestamps.\n-   **Bug & Issue Tracking:** Ticket numbers (e.g., JIRA, Zendesk IDs), bug reports, problem descriptions, known issues lists, hotfix documentation.\n-   **Technical Specifications:** Architecture diagrams, API documentation, internal developer notes, database schemas, network topology diagrams.\n-   **Configuration Details:** Configuration files (`.xml`, `.conf`, `.ini`, `.yaml`), environment variables, system property settings, registry keys.\n-   **Version Information:** Software version numbers, patch levels, build numbers, library dependencies, OS versions.\n-   **Diagnostic Scripts & Queries:** SQL queries, PowerShell/Bash scripts, command-line tool outputs, API calls used for troubleshooting.\n-   **Knowledge Base Articles:** Internal and external knowledge base (KB) articles, especially those labeled \"troubleshooting,\" \"workaround,\" or \"root cause analysis.\"\n-   **Previous Support History:** Notes and steps taken by Tier 1 and Tier 2 support agents on the same ticket.\n\n#### Information to Ignore (Noise):\n-   High-level marketing materials, product brochures, and sales presentations.\n-   End-user guides for basic functionality.\n-   Company financial reports, HR policies, and press releases.\n-   User interface (UI) mockups and graphic design assets.\n-   Sales contracts and Service Level Agreements (SLAs), unless a specific clause is being investigated.\n-   General customer feedback and feature requests that are not tied to a specific bug or error."
}