{
  "main_persona": "Technical Support Engineer",
  "sub_persona": "Enterprise Technical Support Engineer",
  "details": "#### Primary Objective:\nRetrieve technical documentation, error code solutions, known issue databases, and customer configuration details to resolve enterprise-level product issues efficiently.\n\n#### Core Information to Retrieve:\n-   **Error Information:** Specific error codes, log messages, stack traces, \"fatal error,\" \"segmentation fault,\" \"exception.\"\n-   **Technical Specifications:** Product version numbers, build numbers, API documentation, SDKs, system requirements, architecture diagrams.\n-   **Solution-Oriented Keywords:** \"Troubleshooting guide,\" \"workaround,\" \"hotfix,\" \"patch,\" \"root cause analysis (RCA),\" \"known issues,\" \"bug report.\"\n-   **Configuration Details:** File names like `config.xml`, `settings.json`, `.conf`; keywords like \"parameter,\" \"registry key,\" \"environment variable.\"\n-   **Procedural Guides:** \"Installation guide,\" \"upgrade procedure,\" \"migration steps,\" \"how-to,\" \"best practices.\"\n-   **Customer Context:** Customer account numbers, support ticket IDs, incident reports, Service Level Agreements (SLAs).\n-   **Networking & Security:** Firewall rules, port numbers, IP addresses, SSL certificates, authentication protocols (e.g., \"OAuth,\" \"SAML\"), vulnerability reports (CVE numbers).\n-   **Diagnostic Tools & Commands:** Command-line syntax (e.g., `netstat`, `grep`, `ps`), diagnostic scripts (PowerShell, Bash), SQL queries.\n\n#### Information to Ignore (Noise):\n-   Marketing materials, sales pitches, and product brochures.\n-   Pricing information, customer invoices, and billing statements.\n-   General company press releases and corporate news.\n-   Human Resources documents, internal memos on company policy, and employee directories.\n-   End-user feedback on product aesthetics or feature requests not related to a bug.\n-   Legal documents like End-User License Agreements (EULAs) or terms of service.\n-   Consumer-level support articles for non-enterprise products."
}