{
  "main_persona": "Technical Support Engineer",
  "sub_persona": "Network Support Engineer",
  "details": "#### Primary Objective:\nRetrieve technical documentation, configuration examples, and troubleshooting procedures to diagnose and resolve network connectivity and performance issues.\n\n#### Core Information to Retrieve:\n-   **Error Codes & Log Messages:** Specific error codes (e.g., \"%SPANTREE-2-BLOCK_PVID_LOCAL\"), syslog messages, and their meanings or solutions.\n-   **CLI Commands:** Command syntax and output examples for network operating systems (e.g., Cisco IOS, Junos). Phrases like \"show run,\" \"debug ip packet,\" \"traceroute,\" \"ping.\"\n-   **Configuration Snippets:** Examples of device configurations for routers, switches, and firewalls. Keywords: \"config,\" \"sample configuration,\" \"setup example.\"\n-   **Network Protocols & Acronyms:** BGP, OSPF, EIGRP, STP, VLAN, VPN, IPsec, SSL, DHCP, DNS, NAT, QoS.\n-   **Troubleshooting Guides:** Step-by-step procedures. Phrases like \"troubleshooting guide,\" \"how to fix,\" \"known issue,\" \"workaround,\" \"resolution.\"\n-   **Technical Specifications:** Hardware datasheets detailing port speeds, MAC address tables, memory, CPU capabilities, and supported features.\n-   **Network Topologies:** Diagrams showing network layouts, data flow, and device interconnectivity.\n-   **Vendor & Model Numbers:** Specific product names like \"Cisco Catalyst 9300,\" \"Palo Alto PA-400 Series,\" \"Juniper MX204.\"\n-   **Key Performance Metrics:** Terms like \"latency,\" \"jitter,\" \"packet loss,\" \"throughput,\" \"bandwidth utilization.\"\n\n#### Information to Ignore (Noise):\n-   **Marketing & Sales Material:** Product brochures, customer testimonials, competitive comparisons, and press releases.\n-   **Pricing & Purchasing Information:** Price lists, SKU numbers for sales, \"how to buy\" guides, and partner program details.\n-   **Company Financial Reports:** Annual reports, investor relations documents, and stock performance data.\n-   **Legal & Licensing Agreements:** End-User License Agreements (EULAs), lengthy terms of service, and privacy policies.\n-   **High-Level Business Strategy:** Market analysis, C-level presentations, and future business roadmaps.\n-   **Human Resources Content:** Job descriptions, company culture documents, and employee benefits information."
}