{
  "main_persona": "Technical Writer",
  "sub_persona": "Technical Content Strategist",
  "details": "#### Primary Objective:\nRetrieve all information related to content architecture, audience analysis, content performance metrics, and documentation best practices to inform the overall technical content strategy.\n\n#### Core Information to Retrieve:\n-   **Content Strategy & Architecture:** Phrases like \"content strategy,\" \"information architecture,\" \"content model,\" \"taxonomy,\" \"topic-based authoring,\" \"structured content,\" \"DITA,\" \"single-sourcing,\" and \"content reuse.\"\n-   **Audience Information:** \"User personas,\" \"target audience,\" \"audience analysis,\" \"user roles,\" \"customer journey maps,\" \"developer,\" \"end-user,\" \"administrator.\"\n-   **Performance & Analytics:** \"Content analytics,\" \"user feedback,\" \"support tickets,\" \"ticket deflection,\" \"customer satisfaction\" (CSAT), \"search analytics,\" \"page views,\" \"SEO,\" \"findability.\"\n-   **Tools & Platforms:** \"Content Management System\" (CMS), \"Component Content Management System\" (CCMS), \"knowledge base,\" \"documentation portal,\" \"MadCap Flare,\" \"Oxygen XML,\" \"Confluence,\" \"static site generators.\"\n-   **Processes & Governance:** \"Content lifecycle,\" \"style guide,\" \"voice and tone,\" \"content governance,\" \"SME review process,\" \"localization strategy,\" \"translation workflow.\"\n-   **Product & Development Inputs:** \"Product roadmap,\" \"feature requirements document\" (FRD), \"technical specifications,\" \"API documentation,\" \"release notes,\" \"user stories\" related to documentation.\n-   **Content Types:** Mentions of creating or structuring \"user guides,\" \"tutorials,\" \"how-to guides,\" \"API references,\" \"getting started guides,\" \"troubleshooting,\" \"FAQs.\"\n\n#### Information to Ignore (Noise):\n-   Source code, unit tests, and build scripts.\n-   Individual, low-level bug reports or crash logs (high-level trends are okay).\n-   Company financial reports, sales figures, and pricing models.\n-   Marketing campaign materials, press releases, and ad copy.\n-   Internal HR documents like payroll, employee reviews, or general company announcements.\n-   Vendor invoices and purchasing orders for non-content-related tools."
}