{
  "main_persona": "Technical Writer",
  "sub_persona": "Technical Writer",
  "details": "#### Primary Objective:\nRetrieve technical specifications, procedural instructions, and product design information to produce clear and accurate documentation.\n\n#### Core Information to Retrieve:\n-   **Technical Specifications:** \"Spec sheet,\" \"technical data,\" hardware requirements, software dependencies, system architecture diagrams.\n-   **Product Functionality:** Feature lists, product requirement documents (PRDs), user stories, \"how it works,\" functional descriptions.\n-   **Procedural Guides:** \"Step-by-step\" instructions, installation guides, configuration steps, \"how-to\" tutorials, user workflows.\n-   **API & Code-Level Information:** API endpoints, method names, parameters, return values, sample code snippets, SDK documentation, library functions.\n-   **UI/UX Elements:** UI mockups, wireframes, screenshots, field labels, menu names, button text, icon descriptions.\n-   **Error Handling:** Lists of \"error codes,\" \"error messages,\" \"warnings,\" troubleshooting guides, FAQs.\n-   **Release Information:** \"Release notes,\" version numbers, \"what's new,\" bug fixes, known issues.\n-   **Key Terminology:** Glossaries, definitions of terms, acronym lists, style guides.\n-   **Subject Matter Experts (SMEs):** Names of engineers, product managers, or developers associated with specific features.\n\n#### Information to Ignore (Noise):\n-   Financial reports, sales data, revenue projections, and marketing analytics.\n-   General marketing copy, press releases, and advertising campaign materials.\n-   Human Resources documents like performance reviews, payroll information, or company-wide HR policies.\n-   Internal meeting minutes unrelated to product features or functionality (e.g., budget meetings, all-hands).\n-   Legal contracts, non-disclosure agreements (NDAs), and terms of service documents.\n-   Raw, uncommented source code files.\n-   Server logs, crash dumps, and raw performance metrics."
}