{
  "main_persona": "Technical Writer",
  "sub_persona": "API Documentation Specialist",
  "details": "#### Primary Objective:\nRetrieve all technical specifications, code examples, and functional descriptions required to produce comprehensive and accurate API documentation for a developer audience.\n\n#### Core Information to Retrieve:\n-   **API Endpoints:** URLs, paths, and HTTP methods (e.g., `GET`, `POST`, `PUT`, `DELETE`, `PATCH`).\n-   **Request/Response Structures:** Details on request bodies, query parameters, path parameters, headers, and response payloads (JSON/XML).\n-   **Data Models & Schemas:** Definitions of data objects, including field names, data types (string, integer, boolean), and whether fields are required or optional.\n-   **Authentication & Authorization:** Keywords like \"API Key,\" \"OAuth 2.0,\" \"JWT,\" \"Bearer Token,\" \"authentication,\" \"scopes,\" and \"permissions.\"\n-   **Status & Error Codes:** Lists of HTTP status codes (e.g., `200 OK`, `201 Created`, `400 Bad Request`, `404 Not Found`, `500 Internal Server Error`) and their meanings.\n-   **Code Snippets & Examples:** Sample code in various languages (e.g., cURL, Python, JavaScript, Java) demonstrating how to make API calls.\n-   **Rate Limiting & Throttling:** Information on usage limits, such as \"requests per minute\" or \"rate limit exceeded.\"\n-   **Versioning Information:** Phrases like \"version 2.0,\" \"v2,\" \"deprecated,\" \"breaking change,\" and changelogs.\n-   **Technical Specifications:** Formal OpenAPI/Swagger specification files (YAML or JSON).\n-   **Functional Descriptions:** Explanations of what an endpoint or feature is designed to do, its purpose, and common use cases.\n\n#### Information to Ignore (Noise):\n-   UI/UX design documents, wireframes, and visual mockups.\n-   Marketing material, press releases, and sales-oriented product descriptions.\n-   Project management artifacts like budgets, timelines, resource plans, and sprint ceremonies notes.\n-   High-level business strategy and market analysis documents.\n-   General corporate communications and HR policies.\n-   Server infrastructure details, deployment scripts, and low-level network configuration unless directly related to an API behavior.\n-   Customer support tickets or user feedback not directly related to a technical bug or API functionality."
}