{
  "main_persona": "Technical Support Engineer",
  "sub_persona": "Database Support Engineer",
  "details": "#### Primary Objective:\nRetrieve all technical documentation, error codes, and troubleshooting guides to effectively diagnose and resolve customer-reported database issues.\n\n#### Core Information to Retrieve:\n-   **Error Codes & Messages:** Specific error codes (e.g., \"ORA-01555\", \"SQLSTATE: 23505\"), keywords like \"exception,\" \"segmentation fault,\" \"deadlock,\" \"corruption,\" \"timeout.\"\n-   **Performance & Tuning:** Phrases like \"performance tuning,\" \"slow query,\" \"query optimization,\" \"execution plan,\" \"indexing strategy,\" \"contention,\" \"wait stats.\"\n-   **Configuration Parameters:** Specific parameter names (e.g., `shared_buffers`, `innodb_buffer_pool_size`, `max_connections`) and configuration file names (`postgresql.conf`, `my.cnf`, `init.ora`).\n-   **Troubleshooting Guides:** Keywords like \"troubleshoot,\" \"diagnose,\" \"resolve,\" \"workaround,\" \"how to fix,\" \"step-by-step.\"\n-   **Backup & Recovery:** Terms such as \"backup,\" \"restore,\" \"RMAN,\" `pg_dump`, \"point-in-time recovery\" (PITR), \"disaster recovery,\" \"log shipping.\"\n-   **High Availability & Replication:** Phrases like \"high availability\" (HA), \"failover,\" \"clustering,\" \"replication lag,\" \"standby database,\" \"Always On.\"\n-   **Security & Patches:** Keywords like \"vulnerability,\" \"CVE,\" \"security patch,\" \"authentication,\" \"encryption,\" \"privileges,\" \"grant,\" \"audit.\"\n-   **Version-Specific Information:** Version numbers (e.g., \"PostgreSQL 14,\" \"SQL Server 2019\"), release notes, known bugs, feature deprecation notices.\n-   **System Logs:** Log snippets, stack traces, crash dumps, and alert log entries.\n-   **Commands & Utilities:** Specific tool names (`sqlplus`, `psql`, `mysqldump`) and system view/table names (`v$session`, `pg_stat_activity`).\n\n#### Information to Ignore (Noise):\n-   Marketing materials, sales brochures, and product datasheets.\n-   Pricing, licensing agreements, and subscription models.\n-   High-level business case studies and customer success stories.\n-   Company financial reports, press releases, and investor relations documents.\n-   Human Resources documents, such as job descriptions or internal policies.\n-   Introductory \"What is a database?\" or beginner-level SQL tutorials.\n-   Information on unrelated technologies like front-end development (HTML, CSS) or application-layer business logic."
}