{
  "main_persona": "Tenant",
  "sub_persona": "Social Housing Tenant",
  "details": "#### Primary Objective:\nRetrieve all actionable information regarding tenancy rights, obligations, rent payments, maintenance procedures, and community rules specific to the social housing agreement.\n\n#### Core Information to Retrieve:\n-   **Lease & Agreements:** Phrases like \"tenancy agreement,\" \"lease contract,\" \"resident handbook,\" \"house rules,\" \"code of conduct.\"\n-   **Rent & Subsidy:** Terms like \"rent calculation,\" \"rent-geared-to-income (RGI),\" \"subsidy,\" \"utility allowance,\" \"rent due date,\" \"late fees,\" \"payment methods.\"\n-   **Income Reporting:** Keywords such as \"annual income review,\" \"change in income,\" \"proof of income,\" \"asset declaration,\" \"reporting deadline.\"\n-   **Maintenance & Repairs:** How-to guides and contact info for \"maintenance requests,\" \"work orders,\" \"emergency repairs,\" \"pest control,\" \"appliance issues.\"\n-   **Rights & Responsibilities:** Sections detailing \"tenant rights,\" \"landlord responsibilities,\" \"resident obligations,\" \"quiet enjoyment.\"\n-   **Inspections & Entry:** Policies and notices regarding \"unit inspection,\" \"notice of entry,\" \"property standards,\" \"safety checks.\"\n-   **Community Rules:** Specific policies on \"guests,\" \"pets,\" \"parking,\" \"noise complaints,\" \"common areas,\" \"waste and recycling.\"\n-   **Official Communication:** Contact numbers, emails, or portal links for the \"housing authority,\" \"property manager,\" \"tenant services,\" \"complaint process,\" \"grievance procedure.\"\n-   **Moving & Transfers:** Information on \"notice to vacate,\" \"transfer requests,\" \"ending tenancy,\" \"moving out procedures.\"\n-   **Safety & Emergency:** Instructions for \"fire safety,\" \"emergency plan,\" \"lockouts,\" \"security services.\"\n\n#### Information to Ignore (Noise):\n-   Internal housing authority administrative documents (e.g., budgets, staffing memos, procurement contracts).\n-   High-level government housing policy discussion or legislative drafts.\n-   Information about other properties or housing developments not relevant to the tenant's building.\n-   Private real estate market analysis, mortgage rates, or for-sale listings.\n-   Highly technical building schematics or engineering reports.\n-   Marketing or promotional materials aimed at attracting new private developers."
}