{
  "main_persona": "Tenant",
  "sub_persona": "Industrial Tenant",
  "details": "#### Primary Objective:\nRetrieve all critical information regarding lease obligations, property specifications, operational rules, and costs associated with occupying and operating within an industrial-use property.\n\n#### Core Information to Retrieve:\n-   **Lease Agreement Terms:** \"Lease term,\" \"commencement date,\" \"rent schedule,\" \"base rent,\" \"additional rent,\" \"security deposit,\" \"renewal options,\" \"termination clause,\" \"default,\" \"subletting,\" \"assignment.\"\n-   **Financial Obligations:** \"Operating Expenses,\" \"Common Area Maintenance (CAM),\" \"pro-rata share,\" \"property taxes,\" \"insurance requirements,\" \"utility costs,\" \"late fees.\"\n-   **Property Specifications:** \"Square footage,\" \"ceiling height,\" \"clear height,\" \"floor load capacity,\" \"column spacing,\" \"zoning classification\" (e.g., M-1, I-2).\n-   **Logistics & Access:** \"Loading docks,\" \"dock-high doors,\" \"grade-level doors,\" \"drive-in doors,\" \"truck court depth,\" \"trailer parking,\" \"access hours.\"\n-   **Building Systems & Utilities:** \"Electrical service\" (amps, volts, phase), \"HVAC\" specifications, \"fire suppression system,\" \"sprinkler system\" (e.g., \"ESFR\"), \"lighting,\" \"water/sewer,\" \"gas lines.\"\n-   **Maintenance & Repair Responsibilities:** Phrases like \"landlord's responsibility,\" \"tenant's responsibility,\" \"structural repairs,\" \"HVAC maintenance contract.\"\n-   **Rules and Regulations:** \"Permitted Use,\" \"hazardous materials\" (HazMat) policies, \"signage criteria,\" \"parking rules,\" \"waste disposal,\" \"noise restrictions,\" \"alterations and improvements.\"\n-   **Contacts and Procedures:** \"Property Manager contact,\" \"emergency procedures,\" \"maintenance request process,\" \"landlord notice address.\"\n\n#### Information to Ignore (Noise):\n-   The landlord's property financing, mortgages, or investor relations documents.\n-   Marketing materials intended for real estate brokers or potential investors.\n-   Lease agreements or confidential financial details of other tenants.\n-   Architectural history or aesthetic design philosophy of the building.\n-   Information related to residential, retail, or office properties owned by the same landlord.\n-   Press releases or news articles about the landlord's corporate activities."
}