{
  "main_persona": "Tenant",
  "sub_persona": "Self-Storage Tenant",
  "details": "#### Primary Objective:\nRetrieve all information pertinent to the rental agreement, access procedures, payment details, facility rules, security protocols, and termination policies for a self-storage unit.\n\n#### Core Information to Retrieve:\n-   **Rental Agreement Details:** \"Lease agreement,\" \"rental terms,\" \"contract duration,\" \"renewal,\" \"notice period.\"\n-   **Payment Information:** \"Rent amount,\" \"due date,\" \"late fees,\" \"payment methods,\" \"billing cycles,\" \"invoice,\" \"receipt,\" \"payment portal.\"\n-   **Access Procedures:** \"Gate code,\" \"access hours,\" \"unit number,\" \"lock requirements,\" \"key fob,\" \"entry instructions.\"\n-   **Facility Rules & Regulations:** \"Prohibited items,\" \"hazardous materials,\" \"insurance requirements,\" \"loading dock rules,\" \"pest control,\" \"maintenance requests,\" \"clean-out procedures.\"\n-   **Security Measures:** \"Surveillance cameras,\" \"alarm system,\" \"security patrol,\" \"fencing,\" \"lock types,\" \"security breaches.\"\n-   **Contact Information:** \"Office hours,\" \"customer service,\" \"manager contact,\" \"emergency number,\" \"email address,\" \"address.\"\n-   **Move-Out Procedures:** \"Notice of vacating,\" \"cleaning requirements,\" \"deposit refund,\" \"damage policy,\" \"abandoned property.\"\n-   **Insurance:** \"Tenant insurance,\" \"property damage,\" \"liability,\" \"coverage limits,\" \"claim process.\"\n-   **Eviction/Lien Processes:** \"Default,\" \"non-payment,\" \"lien sale,\" \"auction notice,\" \"foreclosure.\"\n-   **Unit Specifications:** \"Unit size,\" \"climate-controlled,\" \"drive-up access,\" \"humidity control.\"\n\n#### Information to Ignore (Noise):\n-   Company financial reports or investor relations documents.\n-   Marketing materials for potential new tenants or business expansion.\n-   Internal HR policies or staff training manuals.\n-   Detailed facility construction plans or engineering schematics.\n-   Supplier invoices for building materials or equipment.\n-   General real estate market analyses or commercial property listings.\n-   News articles unrelated to storage industry regulations or local crime.\n-   Advertising for unrelated businesses (e.g., moving truck rentals not directly offered by the facility)."
}