{
  "main_persona": "Tenant",
  "sub_persona": "Corporate Tenant",
  "details": "#### Primary Objective:\nRetrieve all clauses, terms, and financial obligations related to the commercial lease agreement and building management policies that impact business operations.\n\n#### Core Information to Retrieve:\n-   **Lease Terms:** \"Commencement Date,\" \"Expiration Date,\" \"Lease Term,\" \"Rent Commencement.\"\n-   **Financial Obligations:** \"Base Rent,\" \"Additional Rent,\" \"Operating Expenses,\" \"Common Area Maintenance\" (CAM), \"Triple Net\" (NNN), \"Security Deposit,\" \"Late Fees,\" \"Rent Schedule.\"\n-   **Premises Details:** \"Leased Premises,\" \"Suite number,\" \"Address,\" \"Rentable Square Feet\" (RSF), \"Floor Plan.\"\n-   **Usage & Operations:** \"Permitted Use,\" \"Use Clause,\" \"Building Hours,\" \"HVAC\" (Heating, Ventilation, and Air Conditioning) specifications and hours, \"Access,\" \"Parking\" allocation and costs.\n-   **Alterations & Improvements:** \"Alterations,\" \"Tenant Improvements\" (TI), \"Landlord's Work,\" \"Consent,\" \"Construction Rules.\"\n-   **Maintenance & Repair:** \"Landlord's Obligations,\" \"Tenant's Obligations,\" \"Maintenance and Repairs,\" \"Services and Utilities.\"\n-   **Insurance & Liability:** \"Insurance Requirements,\" \"Indemnification,\" \"Waiver of Subrogation,\" \"Liability.\"\n-   **Lease Options & Changes:** \"Renewal Option,\" \"Expansion Option,\" \"Right of First Refusal\" (ROFR), \"Assignment,\" \"Sublease.\"\n-   **Default & Remedies:** \"Default,\" \"Landlord's Remedies,\" \"Cure Period,\" \"Termination.\"\n-   **Notices & Contacts:** \"Notice,\" \"Landlord's Address,\" \"Property Manager,\" contact information for building services.\n-   **Rules & Regulations:** \"Rules and Regulations,\" \"Signage,\" \"Compliance with Laws.\"\n\n#### Information to Ignore (Noise):\n-   The landlord's mortgage or financing documents for the building (e.g., \"Deed of Trust\").\n-   Marketing brochures or flyers for other vacant spaces in the building.\n-   Lease abstracts or specific terms for other tenants in the building.\n-   General commercial real estate market reports or regional economic analysis.\n-   Architectural history or past ownership details of the property.\n-   Any information pertaining to residential tenancy laws or policies."
}