{
  "main_persona": "Tenant",
  "sub_persona": "Student Tenant",
  "details": "#### Primary Objective:\nRetrieve all information related to the lease agreement, financial obligations, property rules, tenant rights, and communication protocols for a student renter.\n\n#### Core Information to Retrieve:\n-   **Lease Terms:** Phrases like \"lease start date,\" \"lease end date,\" \"lease term,\" \"early termination,\" \"break lease clause.\"\n-   **Financials:** Rent amount (\"monthly rent\"), due dates, grace periods, late fees, security deposit amount, and conditions for its return (\"deposit refund\").\n-   **Utilities:** Lists of included utilities (e.g., \"water included,\" \"tenant pays for electricity\"), and setup instructions for services like internet or gas.\n-   **Rules and Policies:** \"Guest policy,\" \"overnight visitors,\" \"pet policy,\" \"pet deposit,\" \"quiet hours,\" \"noise complaints,\" \"subletting\" or \"subleasing.\"\n-   **Maintenance & Repairs:** Instructions for submitting a \"maintenance request,\" contact information for \"emergency repairs,\" details on landlord's right to enter (\"notice of entry\").\n-   **Move-in/Move-out:** \"Move-in checklist,\" \"property condition form,\" \"move-out inspection,\" instructions for \"key return.\"\n-   **Contacts:** Name and contact information (phone, email) for the \"landlord,\" \"property manager,\" or \"leasing office.\"\n-   **Parking:** \"Parking permit,\" \"assigned parking,\" \"guest parking\" rules.\n-   **Insurance:** Requirements for \"renter's insurance.\"\n-   **Legal & Rights:** Clauses related to \"eviction,\" \"tenant rights,\" and \"landlord obligations.\"\n\n#### Information to Ignore (Noise):\n-   The property's mortgage or financing documents.\n-   Marketing brochures or advertisements for other properties owned by the landlord.\n-   Detailed architectural blueprints or building construction plans.\n-   The landlord's personal or corporate financial statements.\n-   Real estate transaction history for the property.\n-   Application forms or information for other prospective tenants.\n-   Zoning permits and municipal planning documents."
}