{
  "main_persona": "Tenant",
  "sub_persona": "Commercial Office Tenant",
  "details": "#### Primary Objective:\nRetrieve all contractual, financial, and operational information defining the rights, responsibilities, and costs associated with leasing and occupying a commercial office space.\n\n#### Core Information to Retrieve:\n-   **Lease Agreement Terms:** \"Lease Term,\" \"Commencement Date,\" \"Rent Schedule,\" \"Base Rent,\" \"Additional Rent,\" \"Operating Expenses,\" \"Common Area Maintenance\" (CAM), \"Use Clause.\"\n-   **Financial Obligations:** Invoices, statements, rent bills, \"CAM Reconciliation,\" \"Property Taxes,\" \"Insurance,\" \"Security Deposit.\"\n-   **Space & Premises:** \"Leased Premises,\" \"Square Footage\" (rentable vs. usable), \"Floor Plan,\" \"Suite Number.\"\n-   **Rights and Restrictions:** \"Sublease\" or \"Assignment\" clauses, \"Alterations,\" \"Improvements,\" \"Tenant Improvement Allowance\" (TI), \"Signage,\" \"Parking.\"\n-   **Building Operations:** \"Building Rules and Regulations,\" \"Operating Hours,\" \"HVAC Schedule,\" \"Janitorial Services,\" \"Maintenance Requests,\" \"Holiday Schedule.\"\n-   **Contacts and Procedures:** \"Property Manager,\" \"Building Management,\" \"Emergency Contact,\" \"Evacuation Plan,\" \"Fire Drill,\" \"Access Card/Key Fob Procedures.\"\n-   **Key Clauses:** \"Default,\" \"Remedy,\" \"Indemnification,\" \"Force Majeure,\" \"Surrender of Premises,\" \"Renewal Option,\" \"Estoppel Certificate.\"\n\n#### Information to Ignore (Noise):\n-   Landlord's financing documents (mortgages, loans).\n-   Marketing materials intended for prospective new tenants.\n-   Lease agreements or private financial data for other tenants in the building.\n-   Detailed architectural or structural engineering blueprints (unless for a specific tenant build-out).\n-   The landlord's corporate financial statements or annual reports.\n-   Internal building staff memos or payroll information.\n-   Broad real estate market analysis and investment trend reports."
}