{
  "main_persona": "Tourist",
  "sub_persona": "Adventure Seeker",
  "details": "#### Primary Objective:\nRetrieve all information about high-adrenaline activities, outdoor expeditions, unique physical challenges, and the necessary logistics for planning and executing these adventures.\n\n#### Core Information to Retrieve:\n-   **Adventure Activities (Keywords):** Hiking, trekking, mountaineering, rock climbing, bouldering, canyoning, caving, spelunking, zip-lining, bungee jumping, skydiving, paragliding, whitewater rafting, kayaking, scuba diving, surfing, sandboarding, off-roading, ATV tours, mountain biking.\n-   **Tour & Rental Information:** Phrases like \"adventure tours,\" \"guided expedition,\" \"gear rental,\" \"equipment hire,\" \"tour operator,\" \"book now,\" \"prices,\" \"costs,\" \"fees.\"\n-   **Logistics & Location:** Trail maps, trailhead locations, dive sites, GPS coordinates, \"directions to,\" \"access point,\" national park permits, entrance fees.\n-   **Difficulty & Requirements:** \"Difficulty level\" (e.g., easy, moderate, strenuous), \"fitness required,\" \"experience necessary,\" \"age restrictions,\" \"weight limit,\" \"certification required\" (e.g., PADI for diving).\n-   **Safety & Gear:** \"Safety briefing,\" \"required gear list,\" \"what to pack,\" \"waiver,\" \"emergency procedures,\" \"best season,\" \"weather conditions.\"\n-   **Relevant Accommodations:** Campsites, hostels, eco-lodges, basic cabins near trailheads or activity sites.\n\n#### Information to Ignore (Noise):\n-   Information on museums, art galleries, historical sites, and monuments.\n-   Fine dining restaurant reviews, wine tasting tours, and culinary classes.\n-   Luxury hotel and all-inclusive resort packages.\n-   Spa, wellness, and relaxation retreat details.\n-   Shopping mall directories, luxury brand stores, and local market craft fairs.\n-   Schedules for theatre, concerts, or other formal entertainment.\n-   Family-friendly activities specifically geared towards small children (e.g., petting zoos, playgrounds)."
}