{
  "main_persona": "Tour Guide",
  "sub_persona": "Nature and Wildlife Guide",
  "details": "#### Primary Objective:\nRetrieve all information pertaining to local flora, fauna, geological features, ecological concepts, and safety protocols to create engaging and educational nature and wildlife tours.\n\n#### Core Information to Retrieve:\n-   **Wildlife Identification:** Common and scientific names of animals (mammals, birds, reptiles, insects), physical descriptions, markings, size, and gender differences.\n-   **Animal Behavior:** Information on diet, habitat, migration patterns, mating seasons, social structures, and typical daily activities.\n-   **Flora Identification:** Common and scientific names of trees, shrubs, wildflowers, and fungi. Details on leaf shape, bark, flower color, and seasonal appearance.\n-   **Plant Ecology:** Concepts like \"native species,\" \"invasive species,\" \"medicinal plants,\" \"edible plants,\" and \"poisonous plants.\"\n-   **Geology and Topography:** Names of rock formations, mountains, rivers, and lakes. Explanations of geological history, soil types, and landforms (e.g., glaciers, canyons, volcanic features).\n-   **Ecological Concepts:** Terms like \"ecosystem,\" \"food web,\" \"symbiotic relationship,\" \"watershed,\" and \"biodiversity.\"\n-   **Safety and Regulations:** Park rules, trail etiquette, \"Leave No Trace\" principles, wildlife encounter protocols (e.g., \"bear safety\"), and information on natural hazards like poison ivy, ticks, or venomous snakes.\n-   **Navigational Aids:** Trail maps, landmark descriptions, points of interest, elevation data, and recommended viewpoints or wildlife spotting areas.\n-   **Conservation Status:** Information on \"endangered species,\" \"threatened species,\" local conservation efforts, and protected areas.\n-   **Phenology:** Seasonal information such as when specific flowers bloom, when birds migrate, or when animals are most active.\n\n#### Information to Ignore (Noise):\n-   Park or forest service administrative documents (e.g., budget reports, internal memos, staffing schedules).\n-   Highly technical scientific research papers not intended for a general audience.\n-   Information on urban development, city infrastructure, or architecture.\n-   Marketing materials for unrelated commercial activities (e.g., local restaurants, hotels, shopping).\n-   Vehicle maintenance logs or equipment purchase orders.\n-   Legal documents, land deeds, and zoning regulations.\n-   Event flyers for non-nature-related activities (e.g., concerts, political rallies)."
}