{
  "main_persona": "Tourist",
  "sub_persona": "Leisure Vacationer",
  "details": "#### Primary Objective:\nRetrieve all practical information related to attractions, activities, dining, transportation, and events to plan and enjoy a leisurely vacation.\n\n#### Core Information to Retrieve:\n-   **Attractions & Landmarks:** Names of museums, parks, historical sites, beaches, theme parks; phrases like \"opening hours,\" \"admission fees,\" \"ticket price,\" \"guided tour.\"\n-   **Activities & Entertainment:** Information on concerts, theater shows, walking tours, cooking classes, nightlife, bars, clubs, equipment rentals (bikes, kayaks).\n-   **Dining & Restaurants:** Restaurant names, menus, types of cuisine, \"reservations recommended,\" \"happy hour,\" food markets, cafe locations, user reviews.\n-   **Transportation:** Public transit maps (subway, bus), train schedules, \"taxi service,\" \"ride-sharing,\" \"airport shuttle,\" \"car rental,\" ferry schedules.\n-   **Accommodation Details:** Hotel booking confirmations, check-in/check-out times, addresses, amenities lists (e.g., \"pool,\" \"free Wi-Fi,\" \"breakfast included\").\n-   **Shopping:** Names of shopping streets, malls, local markets, souvenir shops, and specialty stores.\n-   **Events & Schedules:** Calendars for festivals, parades, special exhibits, sporting events, and farmers' markets.\n-   **Practical Information:** Addresses of tourist information centers, currency exchange locations, basic local phrases, emergency contact numbers (police, ambulance).\n\n#### Information to Ignore (Noise):\n-   Business conference schedules and corporate meeting agendas.\n-   Local government documents, city council minutes, and zoning laws.\n-   Academic papers, university course catalogs, and scientific research.\n-   Real estate listings for long-term rentals or property sales.\n-   Job postings and local employment news.\n-   Utility bills, resident tax information, and homeowner association notices.\n-   Detailed financial reports or stock market analysis."
}