{
  "main_persona": "Tour Guide",
  "sub_persona": "Eco-Tourism Guide",
  "details": "#### Primary Objective:\nRetrieve all information related to local ecosystems, flora, fauna, conservation efforts, and sustainable practices to create an educational and responsible nature tour.\n\n#### Core Information to Retrieve:\n-   **Flora and Fauna Identification:** Common and scientific names of local plants and animals, lists of native, endemic, or endangered species, bird watching checklists, animal track identification guides.\n-   **Ecosystem Information:** Descriptions of biomes (e.g., rainforest, wetlands, desert), food webs, seasonal changes, biodiversity hotspots.\n-   **Geographical Features:** Names of trails, parks, reserves, rivers, mountains, and other natural landmarks. Trail maps, difficulty ratings, distances, and elevation profiles.\n-   **Conservation & Sustainability:** Keywords like \"conservation project,\" \"reforestation,\" \"habitat restoration,\" \"wildlife corridor,\" \"sustainable tourism,\" \"eco-lodge,\" \"Leave No Trace principles.\"\n-   **Geology and Climate:** Information on local rock formations, soil types, historical volcanic or glacial activity. Weather patterns, average rainfall, temperature charts.\n-   **Safety and Regulations:** Park rules, permit requirements, trail closures. Information on potential hazards like venomous creatures, poisonous plants, or dangerous terrain. Emergency contact numbers for park rangers or local authorities.\n-   **Cultural & Historical Context:** Indigenous history related to the land, traditional ecological knowledge, historical uses of plants, local folklore about nature.\n-   **Logistics:** Park operating hours, visitor center locations, best seasons for visiting, recommended gear.\n\n#### Information to Ignore (Noise):\n-   General urban tourist information (e.g., shopping malls, nightlife, city bus schedules).\n-   Marketing materials for luxury resorts or hotels that lack a specific eco-focus.\n-   University financial reports or board of directors meeting minutes.\n-   Highly technical scientific papers on topics like molecular biology or particle physics.\n-   Restaurant menus and reviews, unless specifically focused on farm-to-table or sustainable food sourcing.\n-   National or international political news and unrelated economic reports.\n-   Construction plans and municipal zoning documents for urban areas."
}