{
  "main_persona": "Tourist",
  "sub_persona": "Cultural Explorer",
  "details": "#### Primary Objective:\nRetrieve all information about historical sites, local customs, artistic venues, and cultural events to facilitate an immersive and educational travel experience.\n\n#### Core Information to Retrieve:\n-   **Cultural Venues & Sites:** Names of museums, art galleries, historical landmarks, monuments, archaeological sites, UNESCO World Heritage sites.\n-   **Architectural Information:** Mentions of historic districts, specific architectural styles (e.g., \"Gothic,\" \"Art Deco,\" \"Bauhaus\"), names of famous architects, and significant buildings like cathedrals, temples, or palaces.\n-   **Events & Performances:** Schedules for cultural festivals, traditional ceremonies, local holidays, folk music concerts, opera, ballet, and theater performances.\n-   **Historical Context:** Phrases like \"history of,\" \"founded in,\" \"historical significance,\" \"local heritage,\" \"folklore,\" and names of key historical figures or events.\n-   **Artistic Information:** Names of local artists, art movements, details on museum collections, \"special exhibition,\" \"permanent collection.\"\n-   **Local Culture & Traditions:** Information on local cuisine, traditional dishes, artisan markets, craft workshops, and local customs or etiquette.\n-   **Practical Details:** Opening hours (\"open from,\" \"hours of operation\"), admission fees, ticket prices, tour availability (\"guided tour,\" \"audio guide\"), and location addresses for cultural points of interest.\n\n#### Information to Ignore (Noise):\n-   Modern shopping mall directories and promotions for international chain stores.\n-   Listings for nightclubs, modern bars, and casinos.\n-   Advertisements for amusement parks, water parks, and generic tourist attractions without cultural or historical value.\n-   Fast food restaurant menus and locations.\n-   Schedules for modern sporting events (e.g., football, basketball).\n-   Hotel accommodation details, unless the hotel is a historical landmark itself.\n-   Transportation timetables for standard public transit (buses, subways).\n-   Local government administrative reports, real estate listings, and business financial statements."
}