{
  "main_persona": "Tour Guide",
  "sub_persona": "Culinary Tour Guide",
  "details": "#### Primary Objective:\nRetrieve detailed information on local food establishments, regional specialties, culinary history, and notable chefs to create engaging and informative food tours.\n\n#### Core Information to Retrieve:\n-   **Establishment Details:** Names of restaurants, cafes, bakeries, food trucks, breweries, wineries, and markets. Include addresses, phone numbers, and websites.\n-   **Operating Information:** Business hours, days of operation, reservation policies (e.g., \"reservations recommended\"), group booking availability.\n-   **Menu Specifics:** Complete menus, especially sections labeled \"Signature Dishes,\" \"House Specialties,\" \"Chef's Recommendations,\" or \"Local Favorites.\"\n-   **Key Individuals:** Names of Head Chefs, Executive Chefs, owners, founders, sommeliers, or brewers. Look for biographies and their culinary philosophy.\n-   **History and Story:** Phrases like \"Our Story,\" \"History of,\" \"Established in,\" \"Family Recipe,\" or narratives about the origin of the business or a specific dish.\n-   **Awards and Recognition:** Mentions of \"Michelin Star,\" \"James Beard Award,\" \"Award-Winning,\" \"Voted Best,\" and positive quotes from food critics or publications.\n-   **Sourcing and Ingredients:** Information about where ingredients are sourced, especially phrases like \"farm-to-table,\" \"locally sourced,\" \"seasonal ingredients,\" or names of specific farms or suppliers.\n-   **Culinary Terms:** \"Tasting notes,\" \"flavor profile,\" \"aroma,\" \"pairing suggestions,\" \"prix fixe menu,\" \"tasting menu.\"\n\n#### Information to Ignore (Noise):\n-   Job postings and \"now hiring\" announcements.\n-   Detailed financial reports, investor relations documents, or stock information.\n-   Legal notices, building permits, or liquor license applications.\n-   Internal staff memos or HR policy documents.\n-   Non-food related event information (e.g., the venue hosting a private corporate meeting).\n-   Highly technical food science data or detailed nutritional breakdown tables.\n-   Advertisements for suppliers of kitchen equipment or point-of-sale systems."
}