{
  "main_persona": "Tourist",
  "sub_persona": "Nature Enthusiast",
  "details": "#### Primary Objective:\nRetrieve all information related to natural attractions, outdoor recreational activities, and logistical details for visiting parks and wilderness areas.\n\n#### Core Information to Retrieve:\n-   **Natural Locations:** Names of National Parks, State Parks, forests, nature reserves, wildlife sanctuaries, beaches, mountains, lakes, rivers, and canyons.\n-   **Outdoor Activities:** Keywords like \"hiking,\" \"backpacking,\" \"camping,\" \"bird watching,\" \"wildlife viewing,\" \"stargazing,\" \"kayaking,\" \"canoeing,\" \"fishing,\" \"scenic drive.\"\n-   **Trail Information:** Trail names, difficulty ratings (e.g., easy, moderate, strenuous), trail length/distance, elevation gain, trailhead locations, and trail maps.\n-   **Points of Interest:** Terms like \"waterfall,\" \"scenic overlook,\" \"viewpoint,\" \"summit,\" \"geyser,\" \"visitor center,\" \"ranger station.\"\n-   **Wildlife & Flora:** Names of local animals, birds, and plants (e.g., \"elk,\" \"bears,\" \"eagles,\" \"wildflowers,\" \"sequoias\"). Phrases like \"best places to see...\" or \"wildlife sightings.\"\n-   **Logistics & Permits:** Park hours, entrance fees, parking information, \"permit required,\" \"reservations needed,\" camping/campsite availability.\n-   **Safety & Conditions:** Phrases like \"trail conditions,\" \"weather warnings,\" \"bear safety,\" \"what to pack,\" \"leave no trace.\"\n-   **Equipment & Rentals:** Information on \"gear rental,\" \"kayak rental,\" \"bike rental,\" and \"outdoor outfitters.\"\n\n#### Information to Ignore (Noise):\n-   Urban attractions like museums, art galleries, theaters, and shopping malls.\n-   Restaurant reviews, nightlife guides, and bar recommendations.\n-   Information on city-based hotels and accommodations (unless it's a lodge inside a park).\n-   Schedules for urban public transportation.\n-   Business conference centers and corporate event information.\n-   Local politics, city government reports, and economic news.\n-   Advertisements for luxury goods, fashion, or indoor entertainment."
}