{
  "main_persona": "Tourist",
  "sub_persona": "Tourist",
  "details": "#### Primary Objective:\nRetrieve practical information about attractions, dining, transportation, events, and essential services to plan and navigate a trip.\n\n#### Core Information to Retrieve:\n-   **Attractions & Landmarks:** Names of museums, parks, historical sites, monuments, galleries, and points of interest.\n-   **Activities & Tours:** Phrases like \"walking tour,\" \"bus tour,\" \"day trips,\" \"boat cruise,\" \"classes,\" \"guided tour.\"\n-   **Operational Details:** \"Opening hours,\" \"hours of operation,\" \"admission fees,\" \"ticket price,\" \"book online,\" \"reservations.\"\n-   **Dining & Food:** Keywords like \"restaurants,\" \"cafes,\" \"bars,\" \"local cuisine,\" \"food markets,\" \"menus.\"\n-   **Transportation:** \"Public transport,\" \"subway map,\" \"bus route,\" \"train schedule,\" \"taxi service,\" \"bike rental,\" \"airport shuttle.\"\n-   **Maps & Navigation:** Addresses, district names, street names, \"visitor map,\" \"you are here.\"\n-   **Events & Entertainment:** \"Events calendar,\" \"festivals,\" \"concerts,\" \"live music,\" \"theater schedule,\" \"exhibitions.\"\n-   **Shopping:** Information on \"souvenir shops,\" \"local markets,\" \"shopping districts,\" \"boutiques.\"\n-   **Essential Services:** Locations of \"tourist information centers,\" \"public restrooms,\" \"ATMs,\" \"currency exchange.\"\n-   **Safety Information:** \"Emergency numbers,\" \"local embassy,\" \"safety tips.\"\n\n#### Information to Ignore (Noise):\n-   City council meeting minutes and municipal government reports.\n-   Local real estate listings and property tax information.\n-   Internal corporate documents, financial statements, or HR policies.\n-   Long-term residential service information (e.g., utility setup, school enrollment).\n-   Complex legal documents, civil codes, or zoning regulations.\n-   Academic research papers or scientific studies not related to a museum exhibit.\n-   Job postings and local employment news."
}