{
  "main_persona": "Truck Driver",
  "sub_persona": "Refrigerated (Reefer) Truck Driver",
  "details": "#### Primary Objective:\nRetrieve all critical operational, logistical, and compliance information required for the safe and timely transportation of temperature-sensitive cargo.\n\n#### Core Information to Retrieve:\n-   **Load & Dispatch Details:** Bill of Lading (BOL), pick-up numbers, delivery numbers, appointment times, shipper/receiver addresses and contact information.\n-   **Refrigeration Requirements:** Phrases like \"temperature setting,\" \"setpoint,\" \"continuous run,\" \"start/stop,\" \"pre-cool instructions,\" and specific temperatures (e.g., \"set at -10F,\" \"maintain 34 degrees\").\n-   **Compliance & Safety:** Hours of Service (HOS) rules, DOT regulations, \"food safety,\" \"FSMA\" (Food Safety Modernization Act), \"seal number,\" \"pulp temperature.\"\n-   **Route & Logistics:** Route instructions, fuel stop locations, weigh station locations, delivery windows, \"detour,\" \"road closure.\"\n-   **Equipment Operation:** Reefer unit model names (e.g., \"Thermo King,\" \"Carrier\"), \"fault codes,\" \"alarms,\" \"fuel level\" (for the reefer unit), \"PM service due.\"\n-   **Compensation & Expenses:** References to \"lumper fee,\" \"detention pay,\" \"layover,\" fuel receipts, toll charges, pay stubs.\n\n#### Information to Ignore (Noise):\n-   Company-wide financial reports, stock performance, or investor relations documents.\n-   Marketing materials and press releases from the shipping or receiving companies.\n-   Information related to non-refrigerated freight types (e.g., flatbed securement, tanker operations, dry van).\n-   General company newsletters about corporate events or employee achievements unrelated to driver performance.\n-   Detailed engineering schematics or manufacturing specifications for the truck or reefer unit.\n-   Human resources documents concerning corporate office policies or benefits enrollment unless directly targeted at drivers."
}