{
  "main_persona": "Truck Driver",
  "sub_persona": "Dump Truck Driver",
  "details": "#### Primary Objective:\nRetrieve all practical information related to vehicle operation, safety procedures, job site protocols, and daily work logs for a dump truck driver.\n\n#### Core Information to Retrieve:\n-   **Vehicle Operations & Maintenance:** Pre-trip/post-trip inspection checklists, Daily Vehicle Inspection Reports (DVIR), instructions for operating hydraulics, PTO (Power Take-Off), and tarp systems. Maintenance schedules, fluid level requirements, tire pressure charts.\n-   **Safety Procedures:** Keywords like \"site safety plan,\" \"overhead power lines,\" \"backing procedures,\" \"blind spots,\" \"spotter signals,\" \"lockout/tagout.\" Required Personal Protective Equipment (PPE) lists (e.g., \"hard hat,\" \"steel-toed boots,\" \"high-visibility vest\").\n-   **Job Site Information:** Site addresses, maps, contact numbers for foremen, dumping instructions, stockpile locations, and weigh station/scale house procedures.\n-   **Load & Material Documentation:** Load tickets, scale tickets, bill of lading, material types (e.g., \"gravel,\" \"sand,\" \"asphalt,\" \"fill dirt,\" \"aggregate\").\n-   **Regulations & Logs:** Hours of Service (HOS) rules, logbook examples, instructions for Electronic Logging Devices (ELDs), DOT (Department of Transportation) and MSHA (Mine Safety and Health Administration) regulations.\n-   **Dispatch & Routing:** Daily dispatch sheets, route instructions, delivery schedules, and communication protocols with dispatch.\n\n#### Information to Ignore (Noise):\n-   Long-haul trucking information (e.g., sleeper berth regulations, cross-country freight logistics).\n-   Company-wide financial reports, sales figures, or marketing materials.\n-   Human Resources documents unrelated to daily operations (e.g., 401k plans, executive-level policies).\n-   Technical engineering schematics of the engine or chassis.\n-   Information on other types of commercial vehicles (e.g., tanker trucks, reefers, flatbeds) unless it relates to site interaction.\n-   General news articles about the transportation industry."
}