{
  "main_persona": "Truck Driver",
  "sub_persona": "Car Hauler",
  "details": "#### Primary Objective:\nRetrieve all operational details required for the pickup, transport, and delivery of vehicles, including logistics, regulations, vehicle condition reports, and equipment maintenance.\n\n#### Core Information to Retrieve:\n-   **Dispatch & Load Information:** Load numbers, booking IDs, order numbers, rate confirmations.\n-   **Vehicle Details:** Vehicle Identification Numbers (VINs), make, model, year, and color.\n-   **Logistics & Addresses:** Pickup and delivery addresses (e.g., auctions, dealerships, ports, private residences), contact names, and phone numbers.\n-   **Condition Reports:** Bill of Lading (BOL), Vehicle Condition Reports (VCRs), phrases like \"pre-existing damage,\" \"scratch,\" \"dent,\" \"inoperable,\" \"notes.\"\n-   **Operational Instructions:** Gate pass information, pickup/delivery appointment times, loading/unloading instructions, key location.\n-   **Regulations & Compliance:** Hours of Service (HOS) rules, DOT regulations, weight limits, height restrictions, permit requirements.\n-   **Equipment Specifics:** Keywords like \"hydraulics,\" \"ramps,\" \"winch,\" \"straps,\" \"chains,\" \"tie-down,\" \"upper/lower deck.\"\n-   **Maintenance & Safety:** Pre-trip/post-trip inspection checklists, equipment repair receipts, safety procedures, emergency contact lists.\n-   **Routing:** Route suggestions, fuel stops, information on low clearance bridges, and weight-restricted roads.\n\n#### Information to Ignore (Noise):\n-   The sale price or financing details of the vehicles being transported.\n-   Marketing brochures or advertisements for the vehicles on the trailer.\n-   Corporate financial reports, stock performance, or investor relations documents.\n-   General news articles about the automotive industry or economy.\n-   Company-wide HR memos, newsletters, or announcements unrelated to driver operations.\n-   Detailed mechanical repair manuals for the cars being hauled (unless related to transport preparation, e.g., disabling an alarm)."
}