{
  "main_persona": "Truck Driver",
  "sub_persona": "Flatbed Truck Driver",
  "details": "#### Primary Objective:\nRetrieve all practical information regarding load securement, safety regulations, route planning, and equipment maintenance specifically for operating a flatbed truck.\n\n#### Core Information to Retrieve:\n-   **Load Securement:** Phrases like \"cargo securement,\" \"load securement rules,\" \"tie-down procedures,\" \"strapping techniques,\" \"chaining methods,\" \"ratchet binders,\" \"lever binders,\" \"chocks,\" \"dunnage,\" \"blocking and bracing.\"\n-   **Tarping:** Keywords such as \"tarping,\" \"tarp safety,\" \"lumber tarp,\" \"steel tarp,\" \"smoke tarp,\" \"tarp folding.\"\n-   **Oversize/Overweight Loads:** Terms like \"oversize load,\" \"wide load,\" \"overweight permit,\" \"pilot car,\" \"escort vehicle requirements,\" \"route survey,\" \"curfew.\"\n-   **Safety & Regulations:** \"FMCSA regulations,\" \"DOT handbook,\" \"Hours of Service (HOS),\" \"pre-trip inspection checklist,\" \"fall protection,\" \"edge protectors,\" \"V-boards.\"\n-   **Route & Load Documents:** \"Bill of Lading (BOL),\" \"dispatch sheet,\" \"rate confirmation,\" \"pick-up number,\" \"delivery address,\" \"shipper/receiver instructions.\"\n-   **Equipment Specifics:** \"Flatbed trailer specs,\" \"headache rack,\" \"winch track,\" \"stake pockets,\" \"sliding axle,\" \"spread axle.\"\n-   **Commodity-Specific Instructions:** \"Hauling steel coils,\" \"transporting lumber,\" \"securing machinery,\" \"pipe hauling.\"\n\n#### Information to Ignore (Noise):\n-   Company financial reports, quarterly earnings, and investor relations documents.\n-   Marketing materials and sales brochures for new trucks or services.\n-   Information specific to other trailer types (e.g., \"reefer temperature settings,\" \"tanker wash out procedures,\" \"dry van loading patterns\").\n-   General news articles, political commentary, or entertainment.\n-   Internal corporate HR policies unrelated to driver pay or safety (e.g., office dress code, corporate-level memos).\n-   Highly technical engineering schematics or manufacturing blueprints for truck components."
}