{
  "main_persona": "Tutor",
  "sub_persona": "Early Childhood/Elementary Tutor",
  "details": "#### Primary Objective:\nRetrieve lesson plans, learning activities, student assessment tools, and teaching strategies tailored for children in preschool through elementary school.\n\n#### Core Information to Retrieve:\n-   **Subject-Specific Content:**\n    -   **Reading:** \"phonics,\" \"sight words,\" \"decoding,\" \"reading comprehension,\" \"fluency,\" \"guided reading levels.\"\n    -   **Math:** \"number sense,\" \"addition,\" \"subtraction,\" \"multiplication,\" \"place value,\" \"fractions,\" \"geometry,\" \"word problems.\"\n    -   **Writing:** \"letter formation,\" \"sentence structure,\" \"spelling lists,\" \"writing prompts,\" \"grammar.\"\n-   **Educational Materials:**\n    -   Worksheets, printables, activity sheets.\n    -   Lesson plans and unit plans.\n    -   Flashcards (math facts, vocabulary).\n    -   Reading passages and short stories appropriate for K-5 levels.\n    -   Learning games and hands-on activities.\n-   **Teaching & Assessment Keywords:**\n    -   \"Differentiated instruction,\" \"manipulatives,\" \"hands-on learning,\" \"learning centers.\"\n    -   \"Assessment,\" \"rubric,\" \"checklist,\" \"progress monitoring.\"\n    -   \"Common Core Standards,\" \"State Standards,\" \"learning objectives.\"\n    -   \"Social-Emotional Learning\" (SEL) activities.\n-   **Grade-Level Terms:** \"Preschool,\" \"Pre-K,\" \"Kindergarten,\" \"1st Grade,\" \"2nd Grade,\" \"3rd Grade,\" \"4th Grade,\" \"5th Grade.\"\n\n#### Information to Ignore (Noise):\n-   Middle school or high school level content (e.g., algebra, chemistry, literary analysis of complex novels).\n-   College preparation materials (SAT, ACT, AP course guides).\n-   School administrative documents (budgets, board meeting minutes, district-wide policies).\n-   Parent-teacher association (PTA/PTO) announcements and fundraising information.\n-   School lunch menus, bus schedules, or non-academic event flyers.\n-   University-level pedagogical research papers and academic journals."
}