{
  "main_persona": "Tutor",
  "sub_persona": "Special Needs Tutor",
  "details": "#### Primary Objective:\nRetrieve specific learning strategies, student accommodations, assessment data, and educational resources tailored to the unique needs of students with disabilities.\n\n#### Core Information to Retrieve:\n-   **Student-Specific Plans:** Keywords like \"Individualized Education Program (IEP),\" \"504 Plan,\" \"Behavioral Intervention Plan (BIP).\"\n-   **Accommodations & Modifications:** Phrases like \"extended time,\" \"preferential seating,\" \"modified assignments,\" \"use of calculator,\" \"text-to-speech,\" \"visual aids,\" \"graphic organizers.\"\n-   **Assessments & Reports:** \"Psychoeducational evaluation,\" \"diagnostic testing,\" \"progress report,\" \"speech-language assessment,\" \"occupational therapy report,\" \"strengths and weaknesses.\"\n-   **Specific Conditions & Diagnoses:** Terms such as \"Autism Spectrum Disorder (ASD),\" \"ADHD,\" \"Dyslexia,\" \"Dyscalculia,\" \"Dysgraphia,\" \"Auditory Processing Disorder.\"\n-   **Learning Goals & Objectives:** Sections labeled \"IEP Goals,\" \"Annual Goals,\" \"Short-Term Objectives,\" \"Benchmarks.\"\n-   **Teaching Strategies:** Keywords like \"differentiated instruction,\" \"multi-sensory approach,\" \"scaffolding,\" \"task analysis,\" \"positive reinforcement,\" \"social stories.\"\n-   **Assistive Technology:** Mentions of specific software or hardware, such as \"voice-to-text software,\" \"AAC device,\" \"adaptive keyboard.\"\n-   **Communication Logs:** Notes from teachers, parents, and other service providers (e.g., speech therapists, school psychologists).\n\n#### Information to Ignore (Noise):\n-   General school district policies unrelated to special education.\n-   School-wide event schedules, lunch menus, and sports rosters.\n-   Standard curriculum documents not specifically modified or adapted.\n-   School budget and financial reports.\n-   Teacher union agreements and school board meeting minutes.\n-   Fundraising and alumni donation materials."
}