{
  "main_persona": "Warehouse Manager",
  "sub_persona": "Returns & Reverse Logistics Manager (Warehouse)",
  "details": "#### Primary Objective:\nRetrieve all operational procedures, performance metrics, and inventory data related to the processing and management of returned goods within the warehouse.\n\n#### Core Information to Retrieve:\n-   **Processes & Policies:** Return Merchandise Authorization (RMA) procedures, Standard Operating Procedures (SOPs) for returns, reverse logistics workflow diagrams, return-to-vendor (RTV) policies.\n-   **Disposition & Triage:** Keywords like \"inspection criteria,\" \"product grading\" (A-stock, B-stock), \"triage,\" \"disposition rules,\" \"return to stock (RTS),\" \"salvage,\" \"liquidate,\" \"refurbish,\" \"repair,\" \"recycle,\" \"scrap,\" or \"dispose.\"\n-   **Metrics & KPIs:** Data on \"return rate,\" \"processing cycle time,\" \"cost per return,\" \"asset recovery value,\" \"restocking accuracy,\" and \"dock-to-stock time\" for returned items.\n-   **Warehouse Layout & Space:** Information on \"returns processing area,\" \"quarantine zone,\" \"inspection stations,\" \"re-boxing area,\" and dedicated storage locations for returned inventory.\n-   **Systems & Tracking:** References to Warehouse Management System (WMS) modules for returns, RMA tracking numbers, inventory status codes (e.g., \"pending inspection,\" \"damaged\"), SKU-level return data.\n-   **Financials:** Information related to \"restocking fees,\" \"credit memos,\" \"cost of processing returns,\" and financial reports on the value of recovered/salvaged goods.\n-   **Staffing & Equipment:** Staffing models for the returns department, training materials for returns processors, information on equipment used (e.g., scanning guns, inspection tables).\n-   **Compliance:** Documentation regarding environmental regulations for disposal, regulations on e-waste, and handling of hazardous materials in returned goods.\n\n#### Information to Ignore (Noise):\n-   **Outbound Logistics:** Order fulfillment processes, picking and packing for new customer orders, outbound shipping schedules, bills of lading for outgoing goods.\n-   **Supplier Receiving:** Procedures for receiving new inventory from original suppliers, purchase order (PO) documentation, inbound logistics from manufacturing plants.\n-   **Sales & Marketing:** Sales forecasts, marketing campaigns, customer acquisition strategies, promotional materials.\n-   **General Corporate Finance:** Company-wide profit and loss statements, shareholder reports, investor relations updates.\n-   **Product Development:** Research & Development (R&D) documentation, new product design specifications, market research.\n-   **Forward Logistics Planning:** Demand forecasting, transportation route optimization for deliveries, fleet management for outbound trucks."
}