{
  "main_persona": "Warehouse Manager",
  "sub_persona": "Inventory & Quality Control Manager (Warehouse)",
  "details": "#### Primary Objective:\nRetrieve all data and documentation related to stock levels, product movement, quality assurance processes, and operational procedures within the warehouse environment.\n\n#### Core Information to Retrieve:\n-   **Inventory Data:** Stock Keeping Units (SKUs), part numbers, Universal Product Codes (UPCs), on-hand quantities, inventory levels.\n-   **Inventory Processes & Reports:** Phrases like \"cycle count,\" \"physical inventory,\" \"stocktake,\" \"inventory accuracy,\" \"inventory report,\" \"receiving log,\" \"stock adjustments.\"\n-   **Logistics Documents:** Packing slips, pick lists, bills of lading (BOL), shipping manifests.\n-   **Warehouse Locations:** Bin locations (e.g., \"Aisle 5, Rack 3, Shelf B\"), zones, staging areas, quarantine areas.\n-   **Quality Control Terminology:** \"Quality Assurance (QA),\" \"Quality Control (QC),\" \"inspection,\" \"non-conforming,\" \"damaged goods,\" \"defective,\" \"rejected,\" \"return merchandise authorization (RMA).\"\n-   **Quality Reports & Checklists:** \"Inspection reports,\" \"damage reports,\" \"quality checklists,\" \"Certificate of Conformance (CoC).\"\n-   **Operational Procedures:** Standard Operating Procedures (SOPs) for receiving, put-away, picking, packing, and shipping.\n-   **Equipment & Systems:** References to \"forklift,\" \"pallet jack,\" \"barcode scanner,\" \"conveyor,\" and \"Warehouse Management System (WMS).\"\n-   **Safety & Compliance:** \"OSHA,\" \"safety procedures,\" \"incident report,\" \"Personal Protective Equipment (PPE),\" \"hazard.\"\n\n#### Information to Ignore (Noise):\n-   Corporate-level financial statements (e.g., profit and loss, balance sheets).\n-   Sales and marketing strategy documents, customer analytics, and advertising campaigns.\n-   High-level human resources documents like executive compensation or company-wide benefits packages.\n-   Research & Development (R&D) reports and new product design specifications.\n-   External news articles or competitor analysis.\n-   Vendor marketing materials and sales pitches."
}