{
  "main_persona": "Warehouse Manager",
  "sub_persona": "Automated & Robotics Warehouse Manager",
  "details": "#### Primary Objective:\nRetrieve all technical, operational, and performance data related to automated systems, robotic hardware, and associated warehouse logistics to optimize efficiency, safety, and throughput.\n\n#### Core Information to Retrieve:\n-   **Robotics & Automation Hardware:**\n    -   Terms: \"AGV\" (Automated Guided Vehicle), \"AMR\" (Autonomous Mobile Robot), \"ASRS\" (Automated Storage and Retrieval System), \"robotic arm,\" \"automated conveyor,\" \"sorter.\"\n    -   Documents: Maintenance schedules, technical specifications, troubleshooting guides, error code lists, calibration procedures.\n    -   Data: Firmware versions, hardware fault logs, battery life reports, sensor data.\n-   **Warehouse Management Software (WMS/WCS/WES):**\n    -   Phrases: \"system integration,\" \"API documentation,\" \"software update,\" \"bug report,\" \"patch notes.\"\n    -   Metrics: System uptime, latency, processing speed, data sync status.\n    -   Functionality: Inventory tracking data, order fulfillment algorithms, pick path optimization reports.\n-   **Performance & KPIs:**\n    -   Metrics: Throughput rates, order picking accuracy, cycle time, inventory accuracy, system downtime/uptime percentages.\n    -   Reports: Daily/weekly/monthly performance reports, productivity analysis, bottleneck identification reports.\n-   **Safety & Compliance:**\n    -   Protocols: \"Lockout/Tagout\" procedures, emergency stop (E-stop) protocols, robot safety zones, risk assessments.\n    -   Standards: OSHA guidelines for robotics, manufacturer safety manuals.\n    -   Training: Materials for human staff working alongside automated systems.\n-   **Operational Procedures:**\n    -   Standard Operating Procedures (SOPs) for automated receiving, picking, packing, and shipping.\n    -   Incident reports related to system failures or robotic malfunctions.\n    -   Flowcharts and process maps of automated workflows.\n-   **Financials & Procurement:**\n    -   Vendor quotes and proposals for new robotic equipment or software.\n    -   ROI (Return on Investment) calculations and Total Cost of Ownership (TCO) analysis.\n    -   Service Level Agreements (SLAs) with hardware or software vendors.\n\n#### Information to Ignore (Noise):\n-   General corporate HR documents (e.g., company-wide holiday schedules, benefits enrollment for other departments).\n-   Marketing materials and sales forecasts for the products stored in the warehouse.\n-   Manuals and procedures for non-automated, traditional warehouse equipment (e.g., basic pallet jacks, non-integrated forklifts).\n-   High-level corporate financial reports (e.g., quarterly earnings calls, shareholder reports).\n-   Information related to manual-only processes, such as traditional time and motion studies for human pickers.\n-   External news articles about logistics in general, unless they specifically mention relevant automation technologies."
}