{
  "main_persona": "Warehouse Manager",
  "sub_persona": "E-commerce Fulfillment Manager",
  "details": "#### Primary Objective:\nRetrieve all operational data and procedural documents related to inventory management, order processing, shipping logistics, and team productivity within an e-commerce fulfillment center.\n\n#### Core Information to Retrieve:\n-   **Inventory Control:** SKU numbers, bin locations, stock levels, \"low stock alerts,\" \"cycle count\" reports, receiving logs, put-away procedures.\n-   **Order Processing:** Order numbers, pick lists, packing slips, batch/wave picking assignments, \"order accuracy\" metrics, error rates, mis-pick reports.\n-   **Performance Metrics:** \"Orders per hour\" (OPH), \"units per hour\" (UPH), \"pick rate,\" \"pack rate,\" Key Performance Indicators (KPIs), daily/weekly productivity dashboards.\n-   **Shipping & Logistics:** Carrier names (UPS, FedEx, DHL, USPS), tracking numbers, shipping manifests, \"on-time shipping\" rates, dispatch times, cut-off times.\n-   **Staff Management:** Employee schedules, shift assignments, attendance records, Standard Operating Procedures (SOPs) for picking/packing, training materials.\n-   **Returns Processing:** Return Merchandise Authorization (RMA) numbers, return reason codes, reverse logistics procedures, quality inspection reports for returned goods.\n-   **Safety & Equipment:** Safety incident reports, OSHA compliance checklists, equipment maintenance schedules (for scanners, forklifts, conveyor belts), Personal Protective Equipment (PPE) guidelines.\n-   **System Reports:** Data from Warehouse Management System (WMS), Enterprise Resource Planning (ERP) reports related to orders, inventory status updates (e.g., \"pending,\" \"fulfilled,\" \"shipped\").\n\n#### Information to Ignore (Noise):\n-   Product marketing materials, customer-facing product descriptions, and sales copy.\n-   Customer reviews and feedback, unless specifically related to shipping damage or wrong items.\n-   High-level corporate financial reports (e.g., annual reports, investor briefings).\n-   Sales and marketing strategy documents.\n-   Vendor advertisements for non-warehouse equipment or services.\n-   Company-wide HR announcements not specific to warehouse personnel (e.g., corporate office holiday party).\n-   Product design and manufacturing specifications."
}