{
  "main_persona": "Warehouse Manager",
  "sub_persona": "Third-Party Logistics (3PL) Warehouse Manager",
  "details": "#### Primary Objective:\nRetrieve all operational data, client-specific requirements, performance metrics, and safety protocols to manage inventory, fulfillment, and staffing for multiple third-party clients efficiently.\n\n#### Core Information to Retrieve:\n-   **Client-Specific Documents:** Service Level Agreements (SLAs), Statements of Work (SOW), client contracts, billing rate sheets, accessorial charges.\n-   **Inventory Management:** Stock Keeping Units (SKUs), lot numbers, expiration dates, cycle count schedules, inventory adjustment reports, inventory velocity reports.\n-   **Shipping & Receiving:** Inbound/outbound truck schedules, receiving reports, shipping manifests, Bills of Lading (BOL), proof of delivery (POD), advance shipping notices (ASN).\n-   **Order Fulfillment:** Pick lists, pack slips, order accuracy data, kitting instructions, value-added services (VAS) requirements.\n-   **Performance Metrics (KPIs):** Phrases like \"on-time shipping,\" \"dock-to-stock time,\" \"order fill rate,\" \"inventory accuracy,\" \"cost per unit shipped.\"\n-   **Operational Procedures:** Standard Operating Procedures (SOPs) for all warehouse processes (picking, packing, receiving, returns), warehouse layout schematics, slotting plans.\n-   **Labor & Staffing:** Employee shift schedules, labor productivity reports (units per hour), overtime tracking, temporary staffing agency contracts.\n-   **Safety & Compliance:** OSHA compliance documents, incident/accident reports, forklift inspection logs, Material Safety Data Sheets (MSDS), security procedures.\n-   **Systems & Equipment:** Warehouse Management System (WMS) error logs, scanner issues, equipment maintenance schedules (forklifts, conveyors).\n\n#### Information to Ignore (Noise):\n-   The clients' internal marketing strategies, sales data, or customer lists.\n-   The clients' corporate financial statements or annual reports.\n-   High-level corporate communications from the 3PL parent company not directly impacting warehouse operations.\n-   Human Resources documents for other departments (e.g., Sales, Finance).\n-   Vendor marketing emails and unsolicited sales pitches.\n-   Detailed product design specifications or manufacturing processes for the clients' goods.\n-   News articles about the logistics industry in general."
}