{
  "main_persona": "Warehouse Manager",
  "sub_persona": "Manufacturing Warehouse Manager",
  "details": "#### Primary Objective:\nRetrieve all operational data related to inventory management, logistics, safety protocols, and personnel to ensure the efficient flow of raw materials, work-in-progress, and finished goods supporting the manufacturing process.\n\n#### Core Information to Retrieve:\n-   **Inventory Management:**\n    -   Terms: \"Inventory levels,\" \"stock count,\" \"cycle count,\" \"inventory turnover,\" \"SKU\" (Stock Keeping Unit), \"part number,\" \"lot number.\"\n    -   Inventory types: \"Raw materials,\" \"Work-in-Progress\" (WIP), \"finished goods.\"\n    -   Processes: \"Receiving,\" \"put-away,\" \"picking,\" \"packing,\" \"kitting,\" \"staging.\"\n    -   Documents: \"Bill of Lading\" (BOL), \"packing slip,\" \"inventory report,\" \"receiving report.\"\n-   **Logistics & Shipping:**\n    -   Keywords: \"Inbound logistics,\" \"outbound logistics,\" \"shipping manifest,\" \"freight,\" \"carrier,\" \"dock schedule,\" \"load plan.\"\n-   **Manufacturing Integration:**\n    -   Concepts: \"Production schedule,\" \"work order,\" \"material requisition,\" \"Just-in-Time\" (JIT), \"Kanban,\" \"lean manufacturing.\"\n-   **Safety & Compliance:**\n    -   Acronyms: \"OSHA,\" \"PPE\" (Personal Protective Equipment), \"SDS\" (Safety Data Sheet), \"LOTO\" (Lockout/Tagout).\n    -   Phrases: \"Safety audit,\" \"incident report,\" \"forklift safety,\" \"emergency procedures,\" \"spill response,\" \"hazard communication.\"\n-   **Personnel & Performance:**\n    -   Metrics: \"Key Performance Indicators\" (KPIs), \"pick rate,\" \"order accuracy,\" \"dock-to-stock time.\"\n    -   Staffing: \"Shift schedule,\" \"staffing levels,\" \"overtime,\" \"training records.\"\n-   **Equipment & Systems:**\n    -   Technology: \"Warehouse Management System\" (WMS), \"ERP\" (Enterprise Resource Planning), \"barcode scanner,\" \"RFID.\"\n    -   Machinery: \"Forklift inspection,\" \"conveyor maintenance,\" \"pallet jack,\" \"racking inspection,\" \"equipment log.\"\n\n#### Information to Ignore (Noise):\n-   Corporate-level financial reports (e.g., annual reports, shareholder letters).\n-   Sales and marketing strategy documents, customer demographic analysis.\n-   Product research and development (R&D) specifications or reports.\n-   Detailed human resources documents unrelated to warehouse staff (e.g., executive compensation, company-wide benefits packages).\n-   Legal contracts with clients or high-level supplier agreements.\n-   Marketing materials and press releases."
}